[NoCoverage] ObjectLiteral
src/engine/rowFinder.ts:21:60
         private filterEngine: FilterEngine,
         private tableMapper: TableMapper,
         private makeSmartRow: (loc: Locator, map: Map<string, number>, index: number, tablePageIndex?: number) => SmartRow<T>,
-        private tableState: { currentPageIndex: number } = { currentPageIndex: 0 }
+        private tableState: { currentPageIndex: number } = {}
     ) {
         this.resolve = resolve;

[NoCoverage] BlockStatement
src/engine/rowFinder.ts:22:7
         private tableMapper: TableMapper,
         private makeSmartRow: (loc: Locator, map: Map<string, number>, index: number, tablePageIndex?: number) => SmartRow<T>,
         private tableState: { currentPageIndex: number } = { currentPageIndex: 0 }
-    ) {
-        this.resolve = resolve;
-    }
+    ) {}
 
     private log(msg: string) {

[NoCoverage] BlockStatement
src/engine/rowFinder.ts:26:30
         this.resolve = resolve;
     }
 
-    private log(msg: string) {
-        logDebug(this.config, 'verbose', msg);
-    }
+    private log(msg: string) {}
 
     public async findRow(

[NoCoverage] BlockStatement
src/engine/rowFinder.ts:33:29
     public async findRow(
         filters: Record<string, FilterValue>,
         options: { exact?: boolean, maxPages?: number } = {}
-    ): Promise<SmartRow<T>> {
-        logDebug(this.config, 'info', 'Searching for row', filters);
-
-        await this.tableMapper.getMap();
-
-        const rowLocator = await this.findRowLocator(filters, options);
-
-        if (rowLocator) {
-            logDebug(this.config, 'info', 'Row found');
-            await debugDelay(this.config, 'findRow');
-            return this.makeSmartRow(rowLocator, await this.tableMapper.getMap(), 0);
-        }
-
-        logDebug(this.config, 'error', 'Row not found', filters);
-        await debugDelay(this.config, 'findRow');
-
-        const sentinel = this.resolve(this.config.rowSelector, this.rootLocator)
-            .filter({ hasText: "___SENTINEL_ROW_NOT_FOUND___" + Date.now() });
-        const smartRow = this.makeSmartRow(sentinel, await this.tableMapper.getMap(), 0);
-        (smartRow as any)[SENTINEL_ROW] = true;
-        return smartRow;
-    }
+    ): Promise<SmartRow<T>> {}
 
     public async findRows(

[NoCoverage] StringLiteral
src/engine/rowFinder.ts:34:31
         filters: Record<string, FilterValue>,
         options: { exact?: boolean, maxPages?: number } = {}
     ): Promise<SmartRow<T>> {
-        logDebug(this.config, 'info', 'Searching for row', filters);
+        logDebug(this.config, "", 'Searching for row', filters);
 
         await this.tableMapper.getMap();

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:40:13
 
         const rowLocator = await this.findRowLocator(filters, options);
 
-        if (rowLocator) {
+        if (true) {
             logDebug(this.config, 'info', 'Row found');
             await debugDelay(this.config, 'findRow');

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:40:13
 
         const rowLocator = await this.findRowLocator(filters, options);
 
-        if (rowLocator) {
+        if (false) {
             logDebug(this.config, 'info', 'Row found');
             await debugDelay(this.config, 'findRow');

[NoCoverage] StringLiteral
src/engine/rowFinder.ts:42:43
 
         if (rowLocator) {
             logDebug(this.config, 'info', 'Row found');
-            await debugDelay(this.config, 'findRow');
+            await debugDelay(this.config, "");
             return this.makeSmartRow(rowLocator, await this.tableMapper.getMap(), 0);
         }

[NoCoverage] StringLiteral
src/engine/rowFinder.ts:47:39
         }
 
         logDebug(this.config, 'error', 'Row not found', filters);
-        await debugDelay(this.config, 'findRow');
+        await debugDelay(this.config, "");
 
         const sentinel = this.resolve(this.config.rowSelector, this.rootLocator)

[NoCoverage] MethodExpression
src/engine/rowFinder.ts:49:26
         logDebug(this.config, 'error', 'Row not found', filters);
         await debugDelay(this.config, 'findRow');
 
-        const sentinel = this.resolve(this.config.rowSelector, this.rootLocator)
-            .filter({ hasText: "___SENTINEL_ROW_NOT_FOUND___" + Date.now() });
+        const sentinel = this.resolve(this.config.rowSelector, this.rootLocator);
         const smartRow = this.makeSmartRow(sentinel, await this.tableMapper.getMap(), 0);
         (smartRow as any)[SENTINEL_ROW] = true;

[NoCoverage] ObjectLiteral
src/engine/rowFinder.ts:50:21
         await debugDelay(this.config, 'findRow');
 
         const sentinel = this.resolve(this.config.rowSelector, this.rootLocator)
-            .filter({ hasText: "___SENTINEL_ROW_NOT_FOUND___" + Date.now() });
+            .filter({});
         const smartRow = this.makeSmartRow(sentinel, await this.tableMapper.getMap(), 0);
         (smartRow as any)[SENTINEL_ROW] = true;

[NoCoverage] StringLiteral
src/engine/rowFinder.ts:50:32
         await debugDelay(this.config, 'findRow');
 
         const sentinel = this.resolve(this.config.rowSelector, this.rootLocator)
-            .filter({ hasText: "___SENTINEL_ROW_NOT_FOUND___" + Date.now() });
+            .filter({ hasText: "" + Date.now() });
         const smartRow = this.makeSmartRow(sentinel, await this.tableMapper.getMap(), 0);
         (smartRow as any)[SENTINEL_ROW] = true;

[NoCoverage] BooleanLiteral
src/engine/rowFinder.ts:52:43
         const sentinel = this.resolve(this.config.rowSelector, this.rootLocator)
             .filter({ hasText: "___SENTINEL_ROW_NOT_FOUND___" + Date.now() });
         const smartRow = this.makeSmartRow(sentinel, await this.tableMapper.getMap(), 0);
-        (smartRow as any)[SENTINEL_ROW] = true;
+        (smartRow as any)[SENTINEL_ROW] = false;
         return smartRow;
     }

[NoCoverage] LogicalOperator
src/engine/rowFinder.ts:63:35
         const filtersRecord = filters;
         const map = await this.tableMapper.getMap();
         const allRows: SmartRow<T>[] = [];
-        const effectiveMaxPages = options?.maxPages ?? this.config.maxPages ?? Infinity;
+        const effectiveMaxPages = (options?.maxPages ?? this.config.maxPages) && Infinity;
         let pagesScanned = 1;
 

[NoCoverage] OptionalChaining
src/engine/rowFinder.ts:63:35
         const filtersRecord = filters;
         const map = await this.tableMapper.getMap();
         const allRows: SmartRow<T>[] = [];
-        const effectiveMaxPages = options?.maxPages ?? this.config.maxPages ?? Infinity;
+        const effectiveMaxPages = options.maxPages ?? this.config.maxPages ?? Infinity;
         let pagesScanned = 1;
 

[NoCoverage] StringLiteral
src/engine/rowFinder.ts:66:18
         const effectiveMaxPages = options?.maxPages ?? this.config.maxPages ?? Infinity;
         let pagesScanned = 1;
 
-        this.log(`findRows: starting (maxPages=${effectiveMaxPages}, filters=${JSON.stringify(filtersRecord)})`);
+        this.log(``);
 
         const tracker = new ElementTracker('findRows');

[NoCoverage] BlockStatement
src/engine/rowFinder.ts:74:60
             const collectMatches = async () => {
                 let rowLocators = this.resolve(this.config.rowSelector, this.rootLocator);
                 // Only apply filters if we have them
-                if (Object.keys(filtersRecord).length > 0) {
-                    rowLocators = this.filterEngine.applyFilters(
-                        rowLocators,
-                        filtersRecord,
-                        map,
-                        options?.exact ?? false,
-                        this.rootLocator.page(),
-                        this.rootLocator
-                    );
-                }
+                if (Object.keys(filtersRecord).length > 0) {}
 
                 // Get only newly seen matched rows

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:74:21
             const collectMatches = async () => {
                 let rowLocators = this.resolve(this.config.rowSelector, this.rootLocator);
                 // Only apply filters if we have them
-                if (Object.keys(filtersRecord).length > 0) {
+                if (true) {
                     rowLocators = this.filterEngine.applyFilters(
                         rowLocators,

[NoCoverage] LogicalOperator
src/engine/rowFinder.ts:79:25
                         rowLocators,
                         filtersRecord,
                         map,
-                        options?.exact ?? false,
+                        options?.exact && false,
                         this.rootLocator.page(),
                         this.rootLocator

[NoCoverage] BooleanLiteral
src/engine/rowFinder.ts:79:43
                         rowLocators,
                         filtersRecord,
                         map,
-                        options?.exact ?? false,
+                        options?.exact ?? true,
                         this.rootLocator.page(),
                         this.rootLocator

[NoCoverage] OptionalChaining
src/engine/rowFinder.ts:88:38
                 // Get only newly seen matched rows
                 const newIndices = await tracker.getUnseenIndices(rowLocators);
                 const currentRows = await rowLocators.all();
-                const isRowLoading = this.config.strategies.loading?.isRowLoading;
+                const isRowLoading = this.config.strategies.loading.isRowLoading;
                 let added = 0;
 

[NoCoverage] BlockStatement
src/engine/rowFinder.ts:91:47
                 const isRowLoading = this.config.strategies.loading?.isRowLoading;
                 let added = 0;
 
-                for (const idx of newIndices) {
-                    const smartRow = this.makeSmartRow(currentRows[idx], map, allRows.length, this.tableState.currentPageIndex);
-                    if (isRowLoading && await isRowLoading(smartRow)) {
-                        this.log(`findRows: page ${this.tableState.currentPageIndex} — row skipped (isRowLoading=true)`);
-                        continue;
-                    }
-                    allRows.push(smartRow);
-                    added++;
-                }
+                for (const idx of newIndices) {}
                 this.log(`findRows: page ${this.tableState.currentPageIndex} — ${added} new match(es) (total: ${allRows.length})`);
             };

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:93:25
 
                 for (const idx of newIndices) {
                     const smartRow = this.makeSmartRow(currentRows[idx], map, allRows.length, this.tableState.currentPageIndex);
-                    if (isRowLoading && await isRowLoading(smartRow)) {
+                    if (false) {
                         this.log(`findRows: page ${this.tableState.currentPageIndex} — row skipped (isRowLoading=true)`);
                         continue;

[NoCoverage] BlockStatement
src/engine/rowFinder.ts:93:71
 
                 for (const idx of newIndices) {
                     const smartRow = this.makeSmartRow(currentRows[idx], map, allRows.length, this.tableState.currentPageIndex);
-                    if (isRowLoading && await isRowLoading(smartRow)) {
-                        this.log(`findRows: page ${this.tableState.currentPageIndex} — row skipped (isRowLoading=true)`);
-                        continue;
-                    }
+                    if (isRowLoading && await isRowLoading(smartRow)) {}
                     allRows.push(smartRow);
                     added++;

[NoCoverage] StringLiteral
src/engine/rowFinder.ts:94:34
                 for (const idx of newIndices) {
                     const smartRow = this.makeSmartRow(currentRows[idx], map, allRows.length, this.tableState.currentPageIndex);
                     if (isRowLoading && await isRowLoading(smartRow)) {
-                        this.log(`findRows: page ${this.tableState.currentPageIndex} — row skipped (isRowLoading=true)`);
+                        this.log(``);
                         continue;
                     }

[NoCoverage] UpdateOperator
src/engine/rowFinder.ts:98:21
                         continue;
                     }
                     allRows.push(smartRow);
-                    added++;
+                    added--;
                 }
                 this.log(`findRows: page ${this.tableState.currentPageIndex} — ${added} new match(es) (total: ${allRows.length})`);

[NoCoverage] EqualityOperator
src/engine/rowFinder.ts:107:20
             await collectMatches();
 
             // Pagination Loop
-            while (pagesScanned < effectiveMaxPages && this.config.strategies.pagination) {
+            while (pagesScanned <= effectiveMaxPages && this.config.strategies.pagination) {
                 const context: TableContext = {
                     root: this.rootLocator,

[NoCoverage] EqualityOperator
src/engine/rowFinder.ts:107:20
             await collectMatches();
 
             // Pagination Loop
-            while (pagesScanned < effectiveMaxPages && this.config.strategies.pagination) {
+            while (pagesScanned >= effectiveMaxPages && this.config.strategies.pagination) {
                 const context: TableContext = {
                     root: this.rootLocator,

[NoCoverage] ObjectLiteral
src/engine/rowFinder.ts:108:47
 
             // Pagination Loop
             while (pagesScanned < effectiveMaxPages && this.config.strategies.pagination) {
-                const context: TableContext = {
-                    root: this.rootLocator,
-                    config: this.config,
-                    resolve: this.resolve,
-                    page: this.rootLocator.page()
-                };
+                const context: TableContext = {};
 
                 let paginationResult: boolean | number | PaginationPrimitives | undefined;

[NoCoverage] OptionalChaining
src/engine/rowFinder.ts:116:21
                 };
 
                 let paginationResult: boolean | number | PaginationPrimitives | undefined;
-                if (this.config.strategies.pagination?.goNextBulk) {
+                if (this.config.strategies.pagination.goNextBulk) {
                     paginationResult = await this.config.strategies.pagination.goNextBulk(context);
                 } else if (this.config.strategies.pagination?.goNext) {

[NoCoverage] BlockStatement
src/engine/rowFinder.ts:116:68
                 };
 
                 let paginationResult: boolean | number | PaginationPrimitives | undefined;
-                if (this.config.strategies.pagination?.goNextBulk) {
-                    paginationResult = await this.config.strategies.pagination.goNextBulk(context);
-                } else if (this.config.strategies.pagination?.goNext) {
+                if (this.config.strategies.pagination?.goNextBulk) {} else if (this.config.strategies.pagination?.goNext) {
                     paginationResult = await this.config.strategies.pagination.goNext(context);
                 } else {

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:118:28
                 let paginationResult: boolean | number | PaginationPrimitives | undefined;
                 if (this.config.strategies.pagination?.goNextBulk) {
                     paginationResult = await this.config.strategies.pagination.goNextBulk(context);
-                } else if (this.config.strategies.pagination?.goNext) {
+                } else if (false) {
                     paginationResult = await this.config.strategies.pagination.goNext(context);
                 } else {

[NoCoverage] BlockStatement
src/engine/rowFinder.ts:118:71
                 let paginationResult: boolean | number | PaginationPrimitives | undefined;
                 if (this.config.strategies.pagination?.goNextBulk) {
                     paginationResult = await this.config.strategies.pagination.goNextBulk(context);
-                } else if (this.config.strategies.pagination?.goNext) {
-                    paginationResult = await this.config.strategies.pagination.goNext(context);
-                } else {
+                } else if (this.config.strategies.pagination?.goNext) {} else {
                     this.log(`findRows: no pagination primitive — stopping`);
                     break;

[NoCoverage] BlockStatement
src/engine/rowFinder.ts:120:24
                     paginationResult = await this.config.strategies.pagination.goNextBulk(context);
                 } else if (this.config.strategies.pagination?.goNext) {
                     paginationResult = await this.config.strategies.pagination.goNext(context);
-                } else {
-                    this.log(`findRows: no pagination primitive — stopping`);
-                    break;
-                }
+                } else {}
 
                 const didPaginate = validatePaginationResult(paginationResult, 'Pagination Strategy');

[NoCoverage] StringLiteral
src/engine/rowFinder.ts:121:30
                 } else if (this.config.strategies.pagination?.goNext) {
                     paginationResult = await this.config.strategies.pagination.goNext(context);
                 } else {
-                    this.log(`findRows: no pagination primitive — stopping`);
+                    this.log(``);
                     break;
                 }

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:126:21
                 }
 
                 const didPaginate = validatePaginationResult(paginationResult, 'Pagination Strategy');
-                if (!didPaginate) {
+                if (true) {
                     this.log(`findRows: pagination returned false — end of data`);
                     break;

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:126:21
                 }
 
                 const didPaginate = validatePaginationResult(paginationResult, 'Pagination Strategy');
-                if (!didPaginate) {
+                if (false) {
                     this.log(`findRows: pagination returned false — end of data`);
                     break;

[NoCoverage] EqualityOperator
src/engine/rowFinder.ts:131:37
                     break;
                 }
 
-                const pagesJumped = typeof paginationResult === 'number' ? paginationResult : 1;
+                const pagesJumped = typeof paginationResult !== 'number' ? paginationResult : 1;
                 this.tableState.currentPageIndex += pagesJumped;
                 pagesScanned += pagesJumped;

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:131:37
                     break;
                 }
 
-                const pagesJumped = typeof paginationResult === 'number' ? paginationResult : 1;
+                const pagesJumped = false ? paginationResult : 1;
                 this.tableState.currentPageIndex += pagesJumped;
                 pagesScanned += pagesJumped;

[NoCoverage] AssignmentOperator
src/engine/rowFinder.ts:132:17
                 }
 
                 const pagesJumped = typeof paginationResult === 'number' ? paginationResult : 1;
-                this.tableState.currentPageIndex += pagesJumped;
+                this.tableState.currentPageIndex -= pagesJumped;
                 pagesScanned += pagesJumped;
                 this.log(`findRows: advanced ${pagesJumped} page(s), now at page ${this.tableState.currentPageIndex}`);

[NoCoverage] AssignmentOperator
src/engine/rowFinder.ts:133:17
 
                 const pagesJumped = typeof paginationResult === 'number' ? paginationResult : 1;
                 this.tableState.currentPageIndex += pagesJumped;
-                pagesScanned += pagesJumped;
+                pagesScanned -= pagesJumped;
                 this.log(`findRows: advanced ${pagesJumped} page(s), now at page ${this.tableState.currentPageIndex}`);
                 await collectMatches();

[NoCoverage] BlockStatement
src/engine/rowFinder.ts:137:19
                 this.log(`findRows: advanced ${pagesJumped} page(s), now at page ${this.tableState.currentPageIndex}`);
                 await collectMatches();
             }
-        } finally {
-            await tracker.cleanup(this.rootLocator.page());
-        }
+        } finally {}
 
         this.log(`findRows: done — ${allRows.length} row(s) collected across ${pagesScanned} page(s)`);

[NoCoverage] LogicalOperator
src/engine/rowFinder.ts:150:35
         options: { exact?: boolean, maxPages?: number } = {}
     ): Promise<Locator | null> {
         const map = await this.tableMapper.getMap();
-        const effectiveMaxPages = options.maxPages ?? this.config.maxPages;
+        const effectiveMaxPages = options.maxPages && this.config.maxPages;
         let pagesScanned = 1;
 

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:157:17
 
         while (true) {
             // Check Loading
-            if (this.config.strategies.loading?.isTableLoading) {
+            if (true) {
                 const isLoading = await this.config.strategies.loading.isTableLoading({
                     root: this.rootLocator,

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:157:17
 
         while (true) {
             // Check Loading
-            if (this.config.strategies.loading?.isTableLoading) {
+            if (false) {
                 const isLoading = await this.config.strategies.loading.isTableLoading({
                     root: this.rootLocator,

[NoCoverage] BlockStatement
src/engine/rowFinder.ts:165:32
                     resolve: this.resolve
                 });
 
-                if (isLoading) {
-                    this.log('Table is loading... waiting');
-                    await this.rootLocator.page().waitForTimeout(200);
-                    continue;
-                }
+                if (isLoading) {}
             }
 

[NoCoverage] StringLiteral
src/engine/rowFinder.ts:166:30
                 });
 
                 if (isLoading) {
-                    this.log('Table is loading... waiting');
+                    this.log("");
                     await this.rootLocator.page().waitForTimeout(200);
                     continue;

[NoCoverage] LogicalOperator
src/engine/rowFinder.ts:177:17
                 allRows,
                 filters,
                 map,
-                options.exact || false,
+                options.exact && false,
                 this.rootLocator.page(),
                 this.rootLocator

[NoCoverage] BooleanLiteral
src/engine/rowFinder.ts:177:34
                 allRows,
                 filters,
                 map,
-                options.exact || false,
+                options.exact || true,
                 this.rootLocator.page(),
                 this.rootLocator

[NoCoverage] StringLiteral
src/engine/rowFinder.ts:183:22
             );
 
             const count = await matchedRows.count();
-            this.log(`Page ${this.tableState.currentPageIndex}: Found ${count} matches.`);
+            this.log(``);
 
             if (count > 1) {

[NoCoverage] BlockStatement
src/engine/rowFinder.ts:185:28
             const count = await matchedRows.count();
             this.log(`Page ${this.tableState.currentPageIndex}: Found ${count} matches.`);
 
-            if (count > 1) {
-                const sampleData: string[] = [];
-                try {
-                    const firstFewRows = await matchedRows.all();
-                    const sampleCount = Math.min(firstFewRows.length, 3);
-                    for (let i = 0; i < sampleCount; i++) {
-                        const rowData = await this.makeSmartRow(firstFewRows[i], map, 0, this.tableState.currentPageIndex).toJSON();
-                        sampleData.push(JSON.stringify(rowData));
-                    }
-                } catch (e) { }
-                const sampleMsg = sampleData.length > 0 ? `\nSample matching rows:\n${sampleData.map((d, i) => `  ${i + 1}. ${d}`).join('\n')}` : '';
-
-                throw new Error(
-                    `Ambiguous Row: Found ${count} rows matching ${JSON.stringify(filters)} on page ${this.tableState.currentPageIndex}. ` +
-                    `Expected exactly one match. Try adding more filters to make your query unique.${sampleMsg}`
-                );
-            }
+            if (count > 1) {}
 
             if (count === 1) return matchedRows.first();

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:185:17
             const count = await matchedRows.count();
             this.log(`Page ${this.tableState.currentPageIndex}: Found ${count} matches.`);
 
-            if (count > 1) {
+            if (false) {
                 const sampleData: string[] = [];
                 try {

[NoCoverage] ArrayDeclaration
src/engine/rowFinder.ts:186:46
             this.log(`Page ${this.tableState.currentPageIndex}: Found ${count} matches.`);
 
             if (count > 1) {
-                const sampleData: string[] = [];
+                const sampleData: string[] = ["Stryker was here"];
                 try {
                     const firstFewRows = await matchedRows.all();

[NoCoverage] BlockStatement
src/engine/rowFinder.ts:187:21
 
             if (count > 1) {
                 const sampleData: string[] = [];
-                try {
-                    const firstFewRows = await matchedRows.all();
-                    const sampleCount = Math.min(firstFewRows.length, 3);
-                    for (let i = 0; i < sampleCount; i++) {
-                        const rowData = await this.makeSmartRow(firstFewRows[i], map, 0, this.tableState.currentPageIndex).toJSON();
-                        sampleData.push(JSON.stringify(rowData));
-                    }
-                } catch (e) { }
+                try {} catch (e) { }
                 const sampleMsg = sampleData.length > 0 ? `\nSample matching rows:\n${sampleData.map((d, i) => `  ${i + 1}. ${d}`).join('\n')}` : '';
 

[NoCoverage] MethodExpression
src/engine/rowFinder.ts:189:41
                 const sampleData: string[] = [];
                 try {
                     const firstFewRows = await matchedRows.all();
-                    const sampleCount = Math.min(firstFewRows.length, 3);
+                    const sampleCount = Math.max(firstFewRows.length, 3);
                     for (let i = 0; i < sampleCount; i++) {
                         const rowData = await this.makeSmartRow(firstFewRows[i], map, 0, this.tableState.currentPageIndex).toJSON();

[NoCoverage] UpdateOperator
src/engine/rowFinder.ts:190:54
                 try {
                     const firstFewRows = await matchedRows.all();
                     const sampleCount = Math.min(firstFewRows.length, 3);
-                    for (let i = 0; i < sampleCount; i++) {
+                    for (let i = 0; i < sampleCount; i--) {
                         const rowData = await this.makeSmartRow(firstFewRows[i], map, 0, this.tableState.currentPageIndex).toJSON();
                         sampleData.push(JSON.stringify(rowData));

[NoCoverage] EqualityOperator
src/engine/rowFinder.ts:190:37
                 try {
                     const firstFewRows = await matchedRows.all();
                     const sampleCount = Math.min(firstFewRows.length, 3);
-                    for (let i = 0; i < sampleCount; i++) {
+                    for (let i = 0; i <= sampleCount; i++) {
                         const rowData = await this.makeSmartRow(firstFewRows[i], map, 0, this.tableState.currentPageIndex).toJSON();
                         sampleData.push(JSON.stringify(rowData));

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:195:35
                         sampleData.push(JSON.stringify(rowData));
                     }
                 } catch (e) { }
-                const sampleMsg = sampleData.length > 0 ? `\nSample matching rows:\n${sampleData.map((d, i) => `  ${i + 1}. ${d}`).join('\n')}` : '';
+                const sampleMsg = false ? `\nSample matching rows:\n${sampleData.map((d, i) => `  ${i + 1}. ${d}`).join('\n')}` : '';
 
                 throw new Error(

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:195:35
                         sampleData.push(JSON.stringify(rowData));
                     }
                 } catch (e) { }
-                const sampleMsg = sampleData.length > 0 ? `\nSample matching rows:\n${sampleData.map((d, i) => `  ${i + 1}. ${d}`).join('\n')}` : '';
+                const sampleMsg = true ? `\nSample matching rows:\n${sampleData.map((d, i) => `  ${i + 1}. ${d}`).join('\n')}` : '';
 
                 throw new Error(

[NoCoverage] StringLiteral
src/engine/rowFinder.ts:199:21
 
                 throw new Error(
                     `Ambiguous Row: Found ${count} rows matching ${JSON.stringify(filters)} on page ${this.tableState.currentPageIndex}. ` +
-                    `Expected exactly one match. Try adding more filters to make your query unique.${sampleMsg}`
+                    ``
                 );
             }

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:203:17
                 );
             }
 
-            if (count === 1) return matchedRows.first();
+            if (true) return matchedRows.first();
 
             if (pagesScanned < effectiveMaxPages) {

[NoCoverage] EqualityOperator
src/engine/rowFinder.ts:203:17
                 );
             }
 
-            if (count === 1) return matchedRows.first();
+            if (count !== 1) return matchedRows.first();
 
             if (pagesScanned < effectiveMaxPages) {

[NoCoverage] EqualityOperator
src/engine/rowFinder.ts:205:17
 
             if (count === 1) return matchedRows.first();
 
-            if (pagesScanned < effectiveMaxPages) {
+            if (pagesScanned >= effectiveMaxPages) {
                 this.log(`Page ${this.tableState.currentPageIndex}: Not found. Attempting pagination...`);
                 const context: TableContext = {
