[NoCoverage] EqualityOperator
src/engine/rowFinder.ts:205:17
 
             if (count === 1) return matchedRows.first();
 
-            if (pagesScanned < effectiveMaxPages) {
+            if (pagesScanned <= effectiveMaxPages) {
                 this.log(`Page ${this.tableState.currentPageIndex}: Not found. Attempting pagination...`);
                 const context: TableContext = {

[NoCoverage] StringLiteral
src/engine/rowFinder.ts:206:26
             if (count === 1) return matchedRows.first();
 
             if (pagesScanned < effectiveMaxPages) {
-                this.log(`Page ${this.tableState.currentPageIndex}: Not found. Attempting pagination...`);
+                this.log(``);
                 const context: TableContext = {
                     root: this.rootLocator,

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:215:21
                 };
 
                 let paginationResult: boolean | number | PaginationPrimitives | undefined;
-                if (this.config.strategies.pagination?.goNextBulk) {
+                if (false) {
                     paginationResult = await this.config.strategies.pagination.goNextBulk(context);
                 } else if (this.config.strategies.pagination?.goNext) {

[NoCoverage] OptionalChaining
src/engine/rowFinder.ts:217:28
                 let paginationResult: boolean | number | PaginationPrimitives | undefined;
                 if (this.config.strategies.pagination?.goNextBulk) {
                     paginationResult = await this.config.strategies.pagination.goNextBulk(context);
-                } else if (this.config.strategies.pagination?.goNext) {
+                } else if (this.config.strategies.pagination.goNext) {
                     paginationResult = await this.config.strategies.pagination.goNext(context);
                 } else {

[NoCoverage] BlockStatement
src/engine/rowFinder.ts:219:24
                     paginationResult = await this.config.strategies.pagination.goNextBulk(context);
                 } else if (this.config.strategies.pagination?.goNext) {
                     paginationResult = await this.config.strategies.pagination.goNext(context);
-                } else {
-                    this.log(`Page ${this.tableState.currentPageIndex}: Pagination failed (no goNext or goNextBulk primitive).`);
-                    return null;
-                }
+                } else {}
 
                 const didLoadMore = validatePaginationResult(paginationResult, 'Pagination Strategy');

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:226:21
 
                 const didLoadMore = validatePaginationResult(paginationResult, 'Pagination Strategy');
 
-                if (didLoadMore) {
+                if (true) {
                     const pagesJumped = typeof paginationResult === 'number' ? paginationResult : 1;
                     this.tableState.currentPageIndex += pagesJumped;

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:226:21
 
                 const didLoadMore = validatePaginationResult(paginationResult, 'Pagination Strategy');
 
-                if (didLoadMore) {
+                if (false) {
                     const pagesJumped = typeof paginationResult === 'number' ? paginationResult : 1;
                     this.tableState.currentPageIndex += pagesJumped;

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:227:41
                 const didLoadMore = validatePaginationResult(paginationResult, 'Pagination Strategy');
 
                 if (didLoadMore) {
-                    const pagesJumped = typeof paginationResult === 'number' ? paginationResult : 1;
+                    const pagesJumped = false ? paginationResult : 1;
                     this.tableState.currentPageIndex += pagesJumped;
                     pagesScanned += pagesJumped;

[NoCoverage] ConditionalExpression
src/engine/rowFinder.ts:227:41
                 const didLoadMore = validatePaginationResult(paginationResult, 'Pagination Strategy');
 
                 if (didLoadMore) {
-                    const pagesJumped = typeof paginationResult === 'number' ? paginationResult : 1;
+                    const pagesJumped = true ? paginationResult : 1;
                     this.tableState.currentPageIndex += pagesJumped;
                     pagesScanned += pagesJumped;

[NoCoverage] BlockStatement
src/engine/rowFinder.ts:231:24
                     this.tableState.currentPageIndex += pagesJumped;
                     pagesScanned += pagesJumped;
                     continue;
-                } else {
-                    this.log(`Page ${this.tableState.currentPageIndex}: Pagination failed (end of data).`);
-                }
+                } else {}
             }
             return null;

[NoCoverage] StringLiteral
src/engine/rowFinder.ts:232:30
                     pagesScanned += pagesJumped;
                     continue;
                 } else {
-                    this.log(`Page ${this.tableState.currentPageIndex}: Pagination failed (end of data).`);
+                    this.log(``);
                 }
             }
