[Killed] BlockStatement
src/engine/tableIteration.ts:18:53
   getPage: () => Page;
 }
 
-function log(config: FinalTableConfig, msg: string) {
-  logDebug(config, 'verbose', msg);
-}
+function log(config: FinalTableConfig, msg: string) {}
 
 /**
killedBy: Iteration engine verbose logging runMap emits "map: starting" under verbose
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/engine/tableIteration.ts:19:20
 }
 
 function log(config: FinalTableConfig, msg: string) {
-  logDebug(config, 'verbose', msg);
+  logDebug(config, "", msg);
 }
 
killedBy: Iteration engine verbose logging runMap emits "map: starting" under verbose
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
src/engine/tableIteration.ts:31:29
   options: RowIterationOptions = {}
 ): Promise<void> {
   const map = env.getMap();
-  const effectiveMaxPages = options.maxPages ?? env.config.maxPages;
+  const effectiveMaxPages = options.maxPages && env.config.maxPages;
   const dedupeStrategy = options.dedupe ?? env.config.strategies.dedupe;
   const dedupeKeys = dedupeStrategy ? new Set<string | number>() : null;

[Killed] LogicalOperator
src/engine/tableIteration.ts:32:26
 ): Promise<void> {
   const map = env.getMap();
   const effectiveMaxPages = options.maxPages ?? env.config.maxPages;
-  const dedupeStrategy = options.dedupe ?? env.config.strategies.dedupe;
+  const dedupeStrategy = options.dedupe && env.config.strategies.dedupe;
   const dedupeKeys = dedupeStrategy ? new Set<string | number>() : null;
   const parallel = options.parallel ?? false;
killedBy: Iteration engine verbose logging runForEach emits "dedupe skip" when dedupe key is repeated
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/engine/tableIteration.ts:34:40
   const effectiveMaxPages = options.maxPages ?? env.config.maxPages;
   const dedupeStrategy = options.dedupe ?? env.config.strategies.dedupe;
   const dedupeKeys = dedupeStrategy ? new Set<string | number>() : null;
-  const parallel = options.parallel ?? false;
+  const parallel = options.parallel ?? true;
   const useBulk = options.useBulkPagination ?? false;
   const tracker = new ElementTracker('forEach');

[Survived] LogicalOperator
src/engine/tableIteration.ts:34:20
   const effectiveMaxPages = options.maxPages ?? env.config.maxPages;
   const dedupeStrategy = options.dedupe ?? env.config.strategies.dedupe;
   const dedupeKeys = dedupeStrategy ? new Set<string | number>() : null;
-  const parallel = options.parallel ?? false;
+  const parallel = options.parallel && false;
   const useBulk = options.useBulkPagination ?? false;
   const tracker = new ElementTracker('forEach');

[Survived] BooleanLiteral
src/engine/tableIteration.ts:35:48
   const dedupeStrategy = options.dedupe ?? env.config.strategies.dedupe;
   const dedupeKeys = dedupeStrategy ? new Set<string | number>() : null;
   const parallel = options.parallel ?? false;
-  const useBulk = options.useBulkPagination ?? false;
+  const useBulk = options.useBulkPagination ?? true;
   const tracker = new ElementTracker('forEach');
 

[Survived] LogicalOperator
src/engine/tableIteration.ts:35:19
   const dedupeStrategy = options.dedupe ?? env.config.strategies.dedupe;
   const dedupeKeys = dedupeStrategy ? new Set<string | number>() : null;
   const parallel = options.parallel ?? false;
-  const useBulk = options.useBulkPagination ?? false;
+  const useBulk = options.useBulkPagination && false;
   const tracker = new ElementTracker('forEach');
 

[Survived] BooleanLiteral
src/engine/tableIteration.ts:38:101
   const useBulk = options.useBulkPagination ?? false;
   const tracker = new ElementTracker('forEach');
 
-  log(env.config, `forEach: starting (maxPages=${effectiveMaxPages}, parallel=${parallel}, dedupe=${!!dedupeStrategy})`);
+  log(env.config, `forEach: starting (maxPages=${effectiveMaxPages}, parallel=${parallel}, dedupe=${!dedupeStrategy})`);
 
   try {

[Killed] BooleanLiteral
src/engine/tableIteration.ts:42:19
 
   try {
     let rowIndex = 0;
-    let stopped = false;
+    let stopped = true;
     let pagesScanned = 1;
     let totalProcessed = 0;
killedBy: Iteration engine verbose logging runForEach emits "stop() called" when stop is invoked
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/engine/tableIteration.ts:45:24
     let stopped = false;
     let pagesScanned = 1;
     let totalProcessed = 0;
-    const stop = () => {
-      log(env.config, `forEach: stop() called — halting after current page`);
-      stopped = true;
-    };
+    const stop = () => {};
 
     while (!stopped) {
killedBy: Iteration engine verbose logging runForEach emits "stop() called" when stop is invoked
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/engine/tableIteration.ts:47:17
     let totalProcessed = 0;
     const stop = () => {
       log(env.config, `forEach: stop() called — halting after current page`);
-      stopped = true;
+      stopped = false;
     };
 

[Killed] BooleanLiteral
src/engine/tableIteration.ts:50:12
       stopped = true;
     };
 
-    while (!stopped) {
+    while (stopped) {
       const rowLocators = env.getRowLocators();
       const newIndices = await tracker.getUnseenIndices(rowLocators);
killedBy: Iteration engine verbose logging runForEach emits "stop() called" when stop is invoked
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/engine/tableIteration.ts:50:12
       stopped = true;
     };
 
-    while (!stopped) {
+    while (false) {
       const rowLocators = env.getRowLocators();
       const newIndices = await tracker.getUnseenIndices(rowLocators);
killedBy: Iteration engine verbose logging runForEach emits "stop() called" when stop is invoked
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/engine/tableIteration.ts:54:40
       const rowLocators = env.getRowLocators();
       const newIndices = await tracker.getUnseenIndices(rowLocators);
       const pageRows = await rowLocators.all();
-      const smartRows = newIndices.map((idx, i) => env.makeSmartRow(pageRows[idx], map, rowIndex + i));
+      const smartRows = newIndices.map(() => undefined);
 
       log(env.config, `forEach: page ${pagesScanned} — ${newIndices.length} new row(s) found`);
killedBy: Iteration engine verbose logging runForEach emits "stop() called" when stop is invoked
statusReason: Cannot read properties of undefined (reading 'rowIndex')

[Survived] ArithmeticOperator
src/engine/tableIteration.ts:54:89
       const rowLocators = env.getRowLocators();
       const newIndices = await tracker.getUnseenIndices(rowLocators);
       const pageRows = await rowLocators.all();
-      const smartRows = newIndices.map((idx, i) => env.makeSmartRow(pageRows[idx], map, rowIndex + i));
+      const smartRows = newIndices.map((idx, i) => env.makeSmartRow(pageRows[idx], map, rowIndex - i));
 
       log(env.config, `forEach: page ${pagesScanned} — ${newIndices.length} new row(s) found`);

[Survived] StringLiteral
src/engine/tableIteration.ts:56:23
       const pageRows = await rowLocators.all();
       const smartRows = newIndices.map((idx, i) => env.makeSmartRow(pageRows[idx], map, rowIndex + i));
 
-      log(env.config, `forEach: page ${pagesScanned} — ${newIndices.length} new row(s) found`);
+      log(env.config, ``);
 
       if (parallel) {

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:58:21
 
       log(env.config, `forEach: page ${pagesScanned} — ${newIndices.length} new row(s) found`);
 
-      if (parallel) {
-        await Promise.all(smartRows.map(async (row) => {
-          if (stopped) return;
-          if (dedupeKeys && dedupeStrategy) {
-            const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `forEach: dedupe skip key="${key}"`);
-              return;
-            }
-            dedupeKeys.add(key);
-          }
-          await callback({ row, rowIndex: row.rowIndex!, stop });
-          totalProcessed++;
-        }));
-      } else {
+      if (parallel) {} else {
         for (const row of smartRows) {
           if (stopped) break;

[Survived] ConditionalExpression
src/engine/tableIteration.ts:58:11
 
       log(env.config, `forEach: page ${pagesScanned} — ${newIndices.length} new row(s) found`);
 
-      if (parallel) {
+      if (true) {
         await Promise.all(smartRows.map(async (row) => {
           if (stopped) return;

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:59:56
       log(env.config, `forEach: page ${pagesScanned} — ${newIndices.length} new row(s) found`);
 
       if (parallel) {
-        await Promise.all(smartRows.map(async (row) => {
-          if (stopped) return;
-          if (dedupeKeys && dedupeStrategy) {
-            const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `forEach: dedupe skip key="${key}"`);
-              return;
-            }
-            dedupeKeys.add(key);
-          }
-          await callback({ row, rowIndex: row.rowIndex!, stop });
-          totalProcessed++;
-        }));
+        await Promise.all(smartRows.map(async (row) => {}));
       } else {
         for (const row of smartRows) {

[NoCoverage] ConditionalExpression
src/engine/tableIteration.ts:60:15
 
       if (parallel) {
         await Promise.all(smartRows.map(async (row) => {
-          if (stopped) return;
+          if (false) return;
           if (dedupeKeys && dedupeStrategy) {
             const key = await dedupeStrategy(row);

[NoCoverage] ConditionalExpression
src/engine/tableIteration.ts:60:15
 
       if (parallel) {
         await Promise.all(smartRows.map(async (row) => {
-          if (stopped) return;
+          if (true) return;
           if (dedupeKeys && dedupeStrategy) {
             const key = await dedupeStrategy(row);

[NoCoverage] ConditionalExpression
src/engine/tableIteration.ts:61:15
       if (parallel) {
         await Promise.all(smartRows.map(async (row) => {
           if (stopped) return;
-          if (dedupeKeys && dedupeStrategy) {
+          if (true) {
             const key = await dedupeStrategy(row);
             if (dedupeKeys.has(key)) {

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:61:45
       if (parallel) {
         await Promise.all(smartRows.map(async (row) => {
           if (stopped) return;
-          if (dedupeKeys && dedupeStrategy) {
-            const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `forEach: dedupe skip key="${key}"`);
-              return;
-            }
-            dedupeKeys.add(key);
-          }
+          if (dedupeKeys && dedupeStrategy) {}
           await callback({ row, rowIndex: row.rowIndex!, stop });
           totalProcessed++;

[NoCoverage] ConditionalExpression
src/engine/tableIteration.ts:63:17
           if (stopped) return;
           if (dedupeKeys && dedupeStrategy) {
             const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
+            if (true) {
               log(env.config, `forEach: dedupe skip key="${key}"`);
               return;

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:63:38
           if (stopped) return;
           if (dedupeKeys && dedupeStrategy) {
             const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `forEach: dedupe skip key="${key}"`);
-              return;
-            }
+            if (dedupeKeys.has(key)) {}
             dedupeKeys.add(key);
           }

[NoCoverage] StringLiteral
src/engine/tableIteration.ts:64:31
           if (dedupeKeys && dedupeStrategy) {
             const key = await dedupeStrategy(row);
             if (dedupeKeys.has(key)) {
-              log(env.config, `forEach: dedupe skip key="${key}"`);
+              log(env.config, ``);
               return;
             }

[NoCoverage] UpdateOperator
src/engine/tableIteration.ts:70:11
             dedupeKeys.add(key);
           }
           await callback({ row, rowIndex: row.rowIndex!, stop });
-          totalProcessed++;
+          totalProcessed--;
         }));
       } else {

[Killed] BlockStatement
src/engine/tableIteration.ts:72:14
           await callback({ row, rowIndex: row.rowIndex!, stop });
           totalProcessed++;
         }));
-      } else {
-        for (const row of smartRows) {
-          if (stopped) break;
-          if (dedupeKeys && dedupeStrategy) {
-            const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `forEach: dedupe skip key="${key}"`);
-              continue;
-            }
-            dedupeKeys.add(key);
-          }
-          await callback({ row, rowIndex: row.rowIndex!, stop });
-          totalProcessed++;
-        }
-      }
+      } else {}
       rowIndex += smartRows.length;
 
killedBy: Iteration engine verbose logging runForEach emits "stop() called" when stop is invoked
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/engine/tableIteration.ts:73:38
           totalProcessed++;
         }));
       } else {
-        for (const row of smartRows) {
-          if (stopped) break;
-          if (dedupeKeys && dedupeStrategy) {
-            const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `forEach: dedupe skip key="${key}"`);
-              continue;
-            }
-            dedupeKeys.add(key);
-          }
-          await callback({ row, rowIndex: row.rowIndex!, stop });
-          totalProcessed++;
-        }
+        for (const row of smartRows) {}
       }
       rowIndex += smartRows.length;
killedBy: Iteration engine verbose logging runForEach emits "stop() called" when stop is invoked
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/engine/tableIteration.ts:74:15
         }));
       } else {
         for (const row of smartRows) {
-          if (stopped) break;
+          if (true) break;
           if (dedupeKeys && dedupeStrategy) {
             const key = await dedupeStrategy(row);
killedBy: Iteration engine verbose logging runForEach emits "stop() called" when stop is invoked
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/engine/tableIteration.ts:74:15
         }));
       } else {
         for (const row of smartRows) {
-          if (stopped) break;
+          if (false) break;
           if (dedupeKeys && dedupeStrategy) {
             const key = await dedupeStrategy(row);

[Killed] ConditionalExpression
src/engine/tableIteration.ts:75:15
       } else {
         for (const row of smartRows) {
           if (stopped) break;
-          if (dedupeKeys && dedupeStrategy) {
+          if (false) {
             const key = await dedupeStrategy(row);
             if (dedupeKeys.has(key)) {
killedBy: Iteration engine verbose logging runForEach emits "dedupe skip" when dedupe key is repeated
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/engine/tableIteration.ts:75:45
       } else {
         for (const row of smartRows) {
           if (stopped) break;
-          if (dedupeKeys && dedupeStrategy) {
-            const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `forEach: dedupe skip key="${key}"`);
-              continue;
-            }
-            dedupeKeys.add(key);
-          }
+          if (dedupeKeys && dedupeStrategy) {}
           await callback({ row, rowIndex: row.rowIndex!, stop });
           totalProcessed++;
killedBy: Iteration engine verbose logging runForEach emits "dedupe skip" when dedupe key is repeated
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/engine/tableIteration.ts:77:38
           if (stopped) break;
           if (dedupeKeys && dedupeStrategy) {
             const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `forEach: dedupe skip key="${key}"`);
-              continue;
-            }
+            if (dedupeKeys.has(key)) {}
             dedupeKeys.add(key);
           }
killedBy: Iteration engine verbose logging runForEach emits "dedupe skip" when dedupe key is repeated
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/engine/tableIteration.ts:77:17
           if (stopped) break;
           if (dedupeKeys && dedupeStrategy) {
             const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
+            if (false) {
               log(env.config, `forEach: dedupe skip key="${key}"`);
               continue;
killedBy: Iteration engine verbose logging runForEach emits "dedupe skip" when dedupe key is repeated
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/engine/tableIteration.ts:83:26
             }
             dedupeKeys.add(key);
           }
-          await callback({ row, rowIndex: row.rowIndex!, stop });
+          await callback({});
           totalProcessed++;
         }
killedBy: Iteration engine verbose logging runForEach emits "stop() called" when stop is invoked
statusReason: stop is not a function

[Survived] AssignmentOperator
src/engine/tableIteration.ts:87:7
           totalProcessed++;
         }
       }
-      rowIndex += smartRows.length;
+      rowIndex -= smartRows.length;
 
       if (stopped || pagesScanned >= effectiveMaxPages) break;

[Killed] ConditionalExpression
src/engine/tableIteration.ts:89:11
       }
       rowIndex += smartRows.length;
 
-      if (stopped || pagesScanned >= effectiveMaxPages) break;
+      if (true) break;
       log(env.config, `forEach: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
       if (!await env.advancePage(useBulk)) {
killedBy: Iteration engine verbose logging runForEach emits "advancing to next page" when multiple pages configured
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/engine/tableIteration.ts:89:22
       }
       rowIndex += smartRows.length;
 
-      if (stopped || pagesScanned >= effectiveMaxPages) break;
+      if (stopped || pagesScanned < effectiveMaxPages) break;
       log(env.config, `forEach: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
       if (!await env.advancePage(useBulk)) {
killedBy: Iteration engine verbose logging runForEach emits "advancing to next page" when multiple pages configured
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/engine/tableIteration.ts:90:77
       rowIndex += smartRows.length;
 
       if (stopped || pagesScanned >= effectiveMaxPages) break;
-      log(env.config, `forEach: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
+      log(env.config, `forEach: advancing to next page (${pagesScanned} → ${pagesScanned - 1})`);
       if (!await env.advancePage(useBulk)) {
         log(env.config, `forEach: no more pages — done`);

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:91:44
 
       if (stopped || pagesScanned >= effectiveMaxPages) break;
       log(env.config, `forEach: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
-      if (!await env.advancePage(useBulk)) {
-        log(env.config, `forEach: no more pages — done`);
-        break;
-      }
+      if (!await env.advancePage(useBulk)) {}
       pagesScanned++;
     }

[Survived] ConditionalExpression
src/engine/tableIteration.ts:91:11
 
       if (stopped || pagesScanned >= effectiveMaxPages) break;
       log(env.config, `forEach: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
-      if (!await env.advancePage(useBulk)) {
+      if (false) {
         log(env.config, `forEach: no more pages — done`);
         break;

[NoCoverage] StringLiteral
src/engine/tableIteration.ts:92:25
       if (stopped || pagesScanned >= effectiveMaxPages) break;
       log(env.config, `forEach: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
       if (!await env.advancePage(useBulk)) {
-        log(env.config, `forEach: no more pages — done`);
+        log(env.config, ``);
         break;
       }

[Survived] UpdateOperator
src/engine/tableIteration.ts:95:7
         log(env.config, `forEach: no more pages — done`);
         break;
       }
-      pagesScanned++;
+      pagesScanned--;
     }
     log(env.config, `forEach: complete — ${totalProcessed} row(s) processed across ${pagesScanned} page(s)`);

[Survived] BlockStatement
src/engine/tableIteration.ts:98:13
       pagesScanned++;
     }
     log(env.config, `forEach: complete — ${totalProcessed} row(s) processed across ${pagesScanned} page(s)`);
-  } finally {
-    await tracker.cleanup(env.getPage());
-  }
+  } finally {}
 }
 

[Survived] BooleanLiteral
src/engine/tableIteration.ts:115:40
   const effectiveMaxPages = options.maxPages ?? env.config.maxPages;
   const dedupeStrategy = options.dedupe ?? env.config.strategies.dedupe;
   const dedupeKeys = dedupeStrategy ? new Set<string | number>() : null;
-  const parallel = options.parallel ?? true;
+  const parallel = options.parallel ?? false;
   const useBulk = options.useBulkPagination ?? false;
   const tracker = new ElementTracker('map');

[Survived] LogicalOperator
src/engine/tableIteration.ts:115:20
   const effectiveMaxPages = options.maxPages ?? env.config.maxPages;
   const dedupeStrategy = options.dedupe ?? env.config.strategies.dedupe;
   const dedupeKeys = dedupeStrategy ? new Set<string | number>() : null;
-  const parallel = options.parallel ?? true;
+  const parallel = options.parallel && true;
   const useBulk = options.useBulkPagination ?? false;
   const tracker = new ElementTracker('map');

[Survived] LogicalOperator
src/engine/tableIteration.ts:116:19
   const dedupeStrategy = options.dedupe ?? env.config.strategies.dedupe;
   const dedupeKeys = dedupeStrategy ? new Set<string | number>() : null;
   const parallel = options.parallel ?? true;
-  const useBulk = options.useBulkPagination ?? false;
+  const useBulk = options.useBulkPagination && false;
   const tracker = new ElementTracker('map');
 

[Survived] BooleanLiteral
src/engine/tableIteration.ts:116:48
   const dedupeStrategy = options.dedupe ?? env.config.strategies.dedupe;
   const dedupeKeys = dedupeStrategy ? new Set<string | number>() : null;
   const parallel = options.parallel ?? true;
-  const useBulk = options.useBulkPagination ?? false;
+  const useBulk = options.useBulkPagination ?? true;
   const tracker = new ElementTracker('map');
 

[Survived] StringLiteral
src/engine/tableIteration.ts:117:38
   const dedupeKeys = dedupeStrategy ? new Set<string | number>() : null;
   const parallel = options.parallel ?? true;
   const useBulk = options.useBulkPagination ?? false;
-  const tracker = new ElementTracker('map');
+  const tracker = new ElementTracker("");
 
   log(env.config, `map: starting (maxPages=${effectiveMaxPages}, parallel=${parallel}, dedupe=${!!dedupeStrategy})`);

[Survived] BooleanLiteral
src/engine/tableIteration.ts:119:97
   const useBulk = options.useBulkPagination ?? false;
   const tracker = new ElementTracker('map');
 
-  log(env.config, `map: starting (maxPages=${effectiveMaxPages}, parallel=${parallel}, dedupe=${!!dedupeStrategy})`);
+  log(env.config, `map: starting (maxPages=${effectiveMaxPages}, parallel=${parallel}, dedupe=${!dedupeStrategy})`);
 
   const results: R[] = [];

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:128:24
     let rowIndex = 0;
     let stopped = false;
     let pagesScanned = 1;
-    const stop = () => {
-      log(env.config, `map: stop() called — halting after current page`);
-      stopped = true;
-    };
+    const stop = () => {};
 
     while (!stopped) {

[NoCoverage] BooleanLiteral
src/engine/tableIteration.ts:130:17
     let pagesScanned = 1;
     const stop = () => {
       log(env.config, `map: stop() called — halting after current page`);
-      stopped = true;
+      stopped = false;
     };
 

[Survived] StringLiteral
src/engine/tableIteration.ts:139:23
       const pageRows = await rowLocators.all();
       const smartRows = newIndices.map((idx, i) => env.makeSmartRow(pageRows[idx], map, rowIndex + i));
 
-      log(env.config, `map: scanning page ${pagesScanned} — ${newIndices.length} new row(s)`);
+      log(env.config, ``);
 
       if (parallel) {

[Survived] BlockStatement
src/engine/tableIteration.ts:141:21
 
       log(env.config, `map: scanning page ${pagesScanned} — ${newIndices.length} new row(s)`);
 
-      if (parallel) {
-        const pageResults = await Promise.all(smartRows.map(async (row) => {
-          if (dedupeKeys && dedupeStrategy) {
-            const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `map: dedupe skip key="${key}"`);
-              return SKIP;
-            }
-            dedupeKeys.add(key);
-          }
-          return callback({ row, rowIndex: row.rowIndex!, stop });
-        }));
-        for (const r of pageResults) {
-          if (r !== SKIP) results.push(r as R);
-        }
-      } else {
+      if (parallel) {} else {
         for (const row of smartRows) {
           if (stopped) break;

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:142:76
       log(env.config, `map: scanning page ${pagesScanned} — ${newIndices.length} new row(s)`);
 
       if (parallel) {
-        const pageResults = await Promise.all(smartRows.map(async (row) => {
-          if (dedupeKeys && dedupeStrategy) {
-            const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `map: dedupe skip key="${key}"`);
-              return SKIP;
-            }
-            dedupeKeys.add(key);
-          }
-          return callback({ row, rowIndex: row.rowIndex!, stop });
-        }));
+        const pageResults = await Promise.all(smartRows.map(async (row) => {}));
         for (const r of pageResults) {
           if (r !== SKIP) results.push(r as R);

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:143:45
 
       if (parallel) {
         const pageResults = await Promise.all(smartRows.map(async (row) => {
-          if (dedupeKeys && dedupeStrategy) {
-            const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `map: dedupe skip key="${key}"`);
-              return SKIP;
-            }
-            dedupeKeys.add(key);
-          }
+          if (dedupeKeys && dedupeStrategy) {}
           return callback({ row, rowIndex: row.rowIndex!, stop });
         }));

[NoCoverage] ConditionalExpression
src/engine/tableIteration.ts:143:15
 
       if (parallel) {
         const pageResults = await Promise.all(smartRows.map(async (row) => {
-          if (dedupeKeys && dedupeStrategy) {
+          if (true) {
             const key = await dedupeStrategy(row);
             if (dedupeKeys.has(key)) {

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:145:38
         const pageResults = await Promise.all(smartRows.map(async (row) => {
           if (dedupeKeys && dedupeStrategy) {
             const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `map: dedupe skip key="${key}"`);
-              return SKIP;
-            }
+            if (dedupeKeys.has(key)) {}
             dedupeKeys.add(key);
           }

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:153:38
           }
           return callback({ row, rowIndex: row.rowIndex!, stop });
         }));
-        for (const r of pageResults) {
-          if (r !== SKIP) results.push(r as R);
-        }
+        for (const r of pageResults) {}
       } else {
         for (const row of smartRows) {

[NoCoverage] ConditionalExpression
src/engine/tableIteration.ts:154:15
           return callback({ row, rowIndex: row.rowIndex!, stop });
         }));
         for (const r of pageResults) {
-          if (r !== SKIP) results.push(r as R);
+          if (true) results.push(r as R);
         }
       } else {

[NoCoverage] EqualityOperator
src/engine/tableIteration.ts:154:15
           return callback({ row, rowIndex: row.rowIndex!, stop });
         }));
         for (const r of pageResults) {
-          if (r !== SKIP) results.push(r as R);
+          if (r === SKIP) results.push(r as R);
         }
       } else {

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:156:14
         for (const r of pageResults) {
           if (r !== SKIP) results.push(r as R);
         }
-      } else {
-        for (const row of smartRows) {
-          if (stopped) break;
-          if (dedupeKeys && dedupeStrategy) {
-            const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `map: dedupe skip key="${key}"`);
-              continue;
-            }
-            dedupeKeys.add(key);
-          }
-          results.push(await callback({ row, rowIndex: row.rowIndex!, stop }));
-        }
-      }
+      } else {}
       rowIndex += smartRows.length;
 
