[NoCoverage] BlockStatement
src/engine/tableIteration.ts:157:38
           if (r !== SKIP) results.push(r as R);
         }
       } else {
-        for (const row of smartRows) {
-          if (stopped) break;
-          if (dedupeKeys && dedupeStrategy) {
-            const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `map: dedupe skip key="${key}"`);
-              continue;
-            }
-            dedupeKeys.add(key);
-          }
-          results.push(await callback({ row, rowIndex: row.rowIndex!, stop }));
-        }
+        for (const row of smartRows) {}
       }
       rowIndex += smartRows.length;

[NoCoverage] LogicalOperator
src/engine/tableIteration.ts:159:15
       } else {
         for (const row of smartRows) {
           if (stopped) break;
-          if (dedupeKeys && dedupeStrategy) {
+          if (dedupeKeys || dedupeStrategy) {
             const key = await dedupeStrategy(row);
             if (dedupeKeys.has(key)) {

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:161:38
           if (stopped) break;
           if (dedupeKeys && dedupeStrategy) {
             const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `map: dedupe skip key="${key}"`);
-              continue;
-            }
+            if (dedupeKeys.has(key)) {}
             dedupeKeys.add(key);
           }

[Survived] EqualityOperator
src/engine/tableIteration.ts:172:22
       }
       rowIndex += smartRows.length;
 
-      if (stopped || pagesScanned >= effectiveMaxPages) break;
+      if (stopped || pagesScanned > effectiveMaxPages) break;
       log(env.config, `map: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
       if (!await env.advancePage(useBulk)) {

[Survived] ConditionalExpression
src/engine/tableIteration.ts:172:22
       }
       rowIndex += smartRows.length;
 
-      if (stopped || pagesScanned >= effectiveMaxPages) break;
+      if (stopped || false) break;
       log(env.config, `map: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
       if (!await env.advancePage(useBulk)) {

[NoCoverage] ArithmeticOperator
src/engine/tableIteration.ts:173:73
       rowIndex += smartRows.length;
 
       if (stopped || pagesScanned >= effectiveMaxPages) break;
-      log(env.config, `map: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
+      log(env.config, `map: advancing to next page (${pagesScanned} → ${pagesScanned - 1})`);
       if (!await env.advancePage(useBulk)) {
         log(env.config, `map: no more pages — done`);

[NoCoverage] BooleanLiteral
src/engine/tableIteration.ts:174:11
 
       if (stopped || pagesScanned >= effectiveMaxPages) break;
       log(env.config, `map: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
-      if (!await env.advancePage(useBulk)) {
+      if (await env.advancePage(useBulk)) {
         log(env.config, `map: no more pages — done`);
         break;

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:174:44
 
       if (stopped || pagesScanned >= effectiveMaxPages) break;
       log(env.config, `map: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
-      if (!await env.advancePage(useBulk)) {
-        log(env.config, `map: no more pages — done`);
-        break;
-      }
+      if (!await env.advancePage(useBulk)) {}
       pagesScanned++;
     }

[Survived] BlockStatement
src/engine/tableIteration.ts:181:13
       pagesScanned++;
     }
     log(env.config, `map: complete — ${results.length} result(s) across ${pagesScanned} page(s)`);
-  } finally {
-    await tracker.cleanup(env.getPage());
-  }
+  } finally {}
   return results;
 }

[Survived] StringLiteral
src/engine/tableIteration.ts:201:38
   const dedupeKeys = dedupeStrategy ? new Set<string | number>() : null;
   const parallel = options.parallel ?? false;
   const useBulk = options.useBulkPagination ?? false;
-  const tracker = new ElementTracker('filter');
+  const tracker = new ElementTracker("");
 
   log(env.config, `filter: starting (maxPages=${effectiveMaxPages}, parallel=${parallel}, dedupe=${!!dedupeStrategy})`);

[Survived] BooleanLiteral
src/engine/tableIteration.ts:203:100
   const useBulk = options.useBulkPagination ?? false;
   const tracker = new ElementTracker('filter');
 
-  log(env.config, `filter: starting (maxPages=${effectiveMaxPages}, parallel=${parallel}, dedupe=${!!dedupeStrategy})`);
+  log(env.config, `filter: starting (maxPages=${effectiveMaxPages}, parallel=${parallel}, dedupe=${!dedupeStrategy})`);
 
   const matched: SmartRow<T>[] = [];

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:211:24
     let rowIndex = 0;
     let stopped = false;
     let pagesScanned = 1;
-    const stop = () => {
-      log(env.config, `filter: stop() called — halting after current page`);
-      stopped = true;
-    };
+    const stop = () => {};
 
     while (!stopped) {

[NoCoverage] StringLiteral
src/engine/tableIteration.ts:212:23
     let stopped = false;
     let pagesScanned = 1;
     const stop = () => {
-      log(env.config, `filter: stop() called — halting after current page`);
+      log(env.config, ``);
       stopped = true;
     };

[NoCoverage] BooleanLiteral
src/engine/tableIteration.ts:213:17
     let pagesScanned = 1;
     const stop = () => {
       log(env.config, `filter: stop() called — halting after current page`);
-      stopped = true;
+      stopped = false;
     };
 

[Survived] ArrowFunction
src/engine/tableIteration.ts:220:40
       const rowLocators = env.getRowLocators();
       const newIndices = await tracker.getUnseenIndices(rowLocators);
       const pageRows = await rowLocators.all();
-      const smartRows = newIndices.map((idx, i) =>
-        env.makeSmartRow(pageRows[idx], map, rowIndex + i, pagesScanned - 1)
+      const smartRows = newIndices.map(() => undefined
       );
 

[NoCoverage] ArithmeticOperator
src/engine/tableIteration.ts:221:60
       const newIndices = await tracker.getUnseenIndices(rowLocators);
       const pageRows = await rowLocators.all();
       const smartRows = newIndices.map((idx, i) =>
-        env.makeSmartRow(pageRows[idx], map, rowIndex + i, pagesScanned - 1)
+        env.makeSmartRow(pageRows[idx], map, rowIndex + i, pagesScanned + 1)
       );
 

[NoCoverage] ArithmeticOperator
src/engine/tableIteration.ts:221:46
       const newIndices = await tracker.getUnseenIndices(rowLocators);
       const pageRows = await rowLocators.all();
       const smartRows = newIndices.map((idx, i) =>
-        env.makeSmartRow(pageRows[idx], map, rowIndex + i, pagesScanned - 1)
+        env.makeSmartRow(pageRows[idx], map, rowIndex - i, pagesScanned - 1)
       );
 

[Survived] StringLiteral
src/engine/tableIteration.ts:224:23
         env.makeSmartRow(pageRows[idx], map, rowIndex + i, pagesScanned - 1)
       );
 
-      log(env.config, `filter: scanning page ${pagesScanned} — ${newIndices.length} new row(s)`);
+      log(env.config, ``);
 
       if (parallel) {

[Survived] ConditionalExpression
src/engine/tableIteration.ts:226:11
 
       log(env.config, `filter: scanning page ${pagesScanned} — ${newIndices.length} new row(s)`);
 
-      if (parallel) {
+      if (false) {
         const flags = await Promise.all(smartRows.map(async (row) => {
           if (dedupeKeys && dedupeStrategy) {

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:227:70
       log(env.config, `filter: scanning page ${pagesScanned} — ${newIndices.length} new row(s)`);
 
       if (parallel) {
-        const flags = await Promise.all(smartRows.map(async (row) => {
-          if (dedupeKeys && dedupeStrategy) {
-            const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `filter: dedupe skip key="${key}"`);
-              return false;
-            }
-            dedupeKeys.add(key);
-          }
-          return predicate({ row, rowIndex: row.rowIndex!, stop });
-        }));
+        const flags = await Promise.all(smartRows.map(async (row) => {}));
         smartRows.forEach((row, i) => { if (flags[i]) matched.push(row); });
       } else {

[NoCoverage] ConditionalExpression
src/engine/tableIteration.ts:228:15
 
       if (parallel) {
         const flags = await Promise.all(smartRows.map(async (row) => {
-          if (dedupeKeys && dedupeStrategy) {
+          if (true) {
             const key = await dedupeStrategy(row);
             if (dedupeKeys.has(key)) {

[NoCoverage] LogicalOperator
src/engine/tableIteration.ts:228:15
 
       if (parallel) {
         const flags = await Promise.all(smartRows.map(async (row) => {
-          if (dedupeKeys && dedupeStrategy) {
+          if (dedupeKeys || dedupeStrategy) {
             const key = await dedupeStrategy(row);
             if (dedupeKeys.has(key)) {

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:230:38
         const flags = await Promise.all(smartRows.map(async (row) => {
           if (dedupeKeys && dedupeStrategy) {
             const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `filter: dedupe skip key="${key}"`);
-              return false;
-            }
+            if (dedupeKeys.has(key)) {}
             dedupeKeys.add(key);
           }

[NoCoverage] StringLiteral
src/engine/tableIteration.ts:231:31
           if (dedupeKeys && dedupeStrategy) {
             const key = await dedupeStrategy(row);
             if (dedupeKeys.has(key)) {
-              log(env.config, `filter: dedupe skip key="${key}"`);
+              log(env.config, ``);
               return false;
             }

[NoCoverage] BooleanLiteral
src/engine/tableIteration.ts:232:22
             const key = await dedupeStrategy(row);
             if (dedupeKeys.has(key)) {
               log(env.config, `filter: dedupe skip key="${key}"`);
-              return false;
+              return true;
             }
             dedupeKeys.add(key);

[NoCoverage] ConditionalExpression
src/engine/tableIteration.ts:238:45
           }
           return predicate({ row, rowIndex: row.rowIndex!, stop });
         }));
-        smartRows.forEach((row, i) => { if (flags[i]) matched.push(row); });
+        smartRows.forEach((row, i) => { if (false) matched.push(row); });
       } else {
         for (const row of smartRows) {

[NoCoverage] ConditionalExpression
src/engine/tableIteration.ts:238:45
           }
           return predicate({ row, rowIndex: row.rowIndex!, stop });
         }));
-        smartRows.forEach((row, i) => { if (flags[i]) matched.push(row); });
+        smartRows.forEach((row, i) => { if (true) matched.push(row); });
       } else {
         for (const row of smartRows) {

[Survived] BlockStatement
src/engine/tableIteration.ts:239:14
           return predicate({ row, rowIndex: row.rowIndex!, stop });
         }));
         smartRows.forEach((row, i) => { if (flags[i]) matched.push(row); });
-      } else {
-        for (const row of smartRows) {
-          if (stopped) break;
-          if (dedupeKeys && dedupeStrategy) {
-            const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `filter: dedupe skip key="${key}"`);
-              continue;
-            }
-            dedupeKeys.add(key);
-          }
-          if (await predicate({ row, rowIndex: row.rowIndex!, stop })) {
-            matched.push(row);
-          }
-        }
-      }
+      } else {}
       rowIndex += smartRows.length;
 

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:240:38
         }));
         smartRows.forEach((row, i) => { if (flags[i]) matched.push(row); });
       } else {
-        for (const row of smartRows) {
-          if (stopped) break;
-          if (dedupeKeys && dedupeStrategy) {
-            const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `filter: dedupe skip key="${key}"`);
-              continue;
-            }
-            dedupeKeys.add(key);
-          }
-          if (await predicate({ row, rowIndex: row.rowIndex!, stop })) {
-            matched.push(row);
-          }
-        }
+        for (const row of smartRows) {}
       }
       rowIndex += smartRows.length;

[NoCoverage] ConditionalExpression
src/engine/tableIteration.ts:242:15
       } else {
         for (const row of smartRows) {
           if (stopped) break;
-          if (dedupeKeys && dedupeStrategy) {
+          if (true) {
             const key = await dedupeStrategy(row);
             if (dedupeKeys.has(key)) {

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:244:38
           if (stopped) break;
           if (dedupeKeys && dedupeStrategy) {
             const key = await dedupeStrategy(row);
-            if (dedupeKeys.has(key)) {
-              log(env.config, `filter: dedupe skip key="${key}"`);
-              continue;
-            }
+            if (dedupeKeys.has(key)) {}
             dedupeKeys.add(key);
           }

[NoCoverage] BlockStatement
src/engine/tableIteration.ts:250:72
             }
             dedupeKeys.add(key);
           }
-          if (await predicate({ row, rowIndex: row.rowIndex!, stop })) {
-            matched.push(row);
-          }
+          if (await predicate({ row, rowIndex: row.rowIndex!, stop })) {}
         }
       }

[NoCoverage] ConditionalExpression
src/engine/tableIteration.ts:250:15
             }
             dedupeKeys.add(key);
           }
-          if (await predicate({ row, rowIndex: row.rowIndex!, stop })) {
+          if (true) {
             matched.push(row);
           }

[Survived] LogicalOperator
src/engine/tableIteration.ts:257:11
       }
       rowIndex += smartRows.length;
 
-      if (stopped || pagesScanned >= effectiveMaxPages) break;
+      if (stopped && pagesScanned >= effectiveMaxPages) break;
       log(env.config, `filter: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
       if (!await env.advancePage(useBulk)) {

[NoCoverage] ArithmeticOperator
src/engine/tableIteration.ts:258:76
       rowIndex += smartRows.length;
 
       if (stopped || pagesScanned >= effectiveMaxPages) break;
-      log(env.config, `filter: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
+      log(env.config, `filter: advancing to next page (${pagesScanned} → ${pagesScanned - 1})`);
       if (!await env.advancePage(useBulk)) {
         log(env.config, `filter: no more pages — done`);

[NoCoverage] StringLiteral
src/engine/tableIteration.ts:258:23
       rowIndex += smartRows.length;
 
       if (stopped || pagesScanned >= effectiveMaxPages) break;
-      log(env.config, `filter: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
+      log(env.config, ``);
       if (!await env.advancePage(useBulk)) {
         log(env.config, `filter: no more pages — done`);

[NoCoverage] ConditionalExpression
src/engine/tableIteration.ts:259:11
 
       if (stopped || pagesScanned >= effectiveMaxPages) break;
       log(env.config, `filter: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
-      if (!await env.advancePage(useBulk)) {
+      if (false) {
         log(env.config, `filter: no more pages — done`);
         break;

[NoCoverage] BooleanLiteral
src/engine/tableIteration.ts:259:11
 
       if (stopped || pagesScanned >= effectiveMaxPages) break;
       log(env.config, `filter: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
-      if (!await env.advancePage(useBulk)) {
+      if (await env.advancePage(useBulk)) {
         log(env.config, `filter: no more pages — done`);
         break;

[NoCoverage] StringLiteral
src/engine/tableIteration.ts:260:25
       if (stopped || pagesScanned >= effectiveMaxPages) break;
       log(env.config, `filter: advancing to next page (${pagesScanned} → ${pagesScanned + 1})`);
       if (!await env.advancePage(useBulk)) {
-        log(env.config, `filter: no more pages — done`);
+        log(env.config, ``);
         break;
       }

[Survived] BlockStatement
src/engine/tableIteration.ts:266:13
       pagesScanned++;
     }
     log(env.config, `filter: complete — ${matched.length} match(es) across ${pagesScanned} page(s)`);
-  } finally {
-    await tracker.cleanup(env.getPage());
-  }
+  } finally {}
   return env.createSmartRowArray(matched);
 }
