[Killed] BlockStatement
src/engine/tableMapper.ts:16:7
         rootLocator: Locator,
         config: FinalTableConfig,
         resolve: (item: Selector, parent: Locator | Page) => Locator
-    ) {
-        this.rootLocator = rootLocator;
-        this.config = config;
-        this.resolve = resolve;
-    }
+    ) {}
 
     private log(msg: string) {
killedBy: TableMapper.processHeaders/getMap maps headers and applies headerTransformer
statusReason: Cannot read properties of undefined (reading 'debug')

[Killed] ConditionalExpression
src/engine/tableMapper.ts:27:13
     }
 
     public async getMap(timeout?: number): Promise<Map<string, number>> {
-        if (this._headerMap) return this._headerMap;
+        if (false) return this._headerMap;
 
         this.log('Mapping headers...');
killedBy: TableMapper should return cached map on subsequent calls
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/engine/tableMapper.ts:27:13
     }
 
     public async getMap(timeout?: number): Promise<Map<string, number>> {
-        if (this._headerMap) return this._headerMap;
+        if (true) return this._headerMap;
 
         this.log('Mapping headers...');
killedBy: TableMapper.processHeaders/getMap maps headers and applies headerTransformer
statusReason: Cannot read properties of null (reading 'get')

[Killed] LogicalOperator
src/engine/tableMapper.ts:30:31
         if (this._headerMap) return this._headerMap;
 
         this.log('Mapping headers...');
-        const headerTimeout = timeout ?? 3000;
+        const headerTimeout = timeout && 3000;
         const startTime = Date.now();
 
killedBy: TableMapper.processHeaders/getMap maps headers and applies headerTransformer
statusReason: Timed out waiting for headers after undefinedms

[Survived] ConditionalExpression
src/engine/tableMapper.ts:33:13
         const headerTimeout = timeout ?? 3000;
         const startTime = Date.now();
 
-        if (this.config.autoScroll) {
+        if (true) {
             try { await this.rootLocator.scrollIntoViewIfNeeded({ timeout: 1000 }); } catch (e) { }
         }

[Survived] ConditionalExpression
src/engine/tableMapper.ts:33:13
         const headerTimeout = timeout ?? 3000;
         const startTime = Date.now();
 
-        if (this.config.autoScroll) {
+        if (false) {
             try { await this.rootLocator.scrollIntoViewIfNeeded({ timeout: 1000 }); } catch (e) { }
         }

[NoCoverage] BlockStatement
src/engine/tableMapper.ts:34:17
         const startTime = Date.now();
 
         if (this.config.autoScroll) {
-            try { await this.rootLocator.scrollIntoViewIfNeeded({ timeout: 1000 }); } catch (e) { }
+            try {} catch (e) { }
         }
 

[Killed] ConditionalExpression
src/engine/tableMapper.ts:38:26
         }
 
         const headerLoc = this.resolve(this.config.headerSelector as Selector, this.rootLocator);
-        const strategy = this.config.strategies.header || HeaderStrategies.visible;
+        const strategy = false;
         const context: TableContext = {
             root: this.rootLocator,
killedBy: TableMapper.processHeaders/getMap maps headers and applies headerTransformer
statusReason: strategy is not a function

[Killed] ConditionalExpression
src/engine/tableMapper.ts:38:26
         }
 
         const headerLoc = this.resolve(this.config.headerSelector as Selector, this.rootLocator);
-        const strategy = this.config.strategies.header || HeaderStrategies.visible;
+        const strategy = true;
         const context: TableContext = {
             root: this.rootLocator,
killedBy: TableMapper.processHeaders/getMap maps headers and applies headerTransformer
statusReason: strategy is not a function

[Killed] ArithmeticOperator
src/engine/tableMapper.ts:48:16
 
         let lastError: Error | null = null;
 
-        while (Date.now() - startTime < headerTimeout) {
+        while (Date.now() + startTime < headerTimeout) {
             // 1. Wait for visibility
             try {
killedBy: TableMapper.processHeaders/getMap maps headers and applies headerTransformer
statusReason: Timed out waiting for headers after 3000ms

[Killed] EqualityOperator
src/engine/tableMapper.ts:48:16
 
         let lastError: Error | null = null;
 
-        while (Date.now() - startTime < headerTimeout) {
+        while (Date.now() - startTime >= headerTimeout) {
             // 1. Wait for visibility
             try {
killedBy: TableMapper.processHeaders/getMap maps headers and applies headerTransformer
statusReason: Timed out waiting for headers after 3000ms

[Survived] BlockStatement
src/engine/tableMapper.ts:50:17
 
         while (Date.now() - startTime < headerTimeout) {
             // 1. Wait for visibility
-            try {
-                await headerLoc.first().waitFor({ state: 'visible', timeout: 200 });
-            } catch (e) {
+            try {} catch (e) {
                 // Continue to check existing/loading state even if not strictly "visible" yet
             }

[Killed] OptionalChaining
src/engine/tableMapper.ts:57:17
             }
 
             // 2. Check Smart Loading State
-            if (this.config.strategies.loading?.isHeaderLoading) {
+            if (this.config.strategies.loading.isHeaderLoading) {
                 const isStable = !(await this.config.strategies.loading.isHeaderLoading(context));
                 if (!isStable) {
killedBy: TableMapper.processHeaders/getMap maps headers and applies headerTransformer
statusReason: Cannot read properties of undefined (reading 'isHeaderLoading')

[Killed] BlockStatement
src/engine/tableMapper.ts:57:66
             }
 
             // 2. Check Smart Loading State
-            if (this.config.strategies.loading?.isHeaderLoading) {
-                const isStable = !(await this.config.strategies.loading.isHeaderLoading(context));
-                if (!isStable) {
-                    this.log('Headers are loading/unstable... waiting');
-                    await new Promise(r => setTimeout(r, 100));
-                    continue;
-                }
-            }
+            if (this.config.strategies.loading?.isHeaderLoading) {}
 
             // 3. Attempt Scan
killedBy: TableMapper should check isHeaderLoading strategy
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] BooleanLiteral
src/engine/tableMapper.ts:58:34
 
             // 2. Check Smart Loading State
             if (this.config.strategies.loading?.isHeaderLoading) {
-                const isStable = !(await this.config.strategies.loading.isHeaderLoading(context));
+                const isStable = await this.config.strategies.loading.isHeaderLoading(context);
                 if (!isStable) {
                     this.log('Headers are loading/unstable... waiting');
killedBy: TableMapper should check isHeaderLoading strategy
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] BooleanLiteral
src/engine/tableMapper.ts:59:21
             // 2. Check Smart Loading State
             if (this.config.strategies.loading?.isHeaderLoading) {
                 const isStable = !(await this.config.strategies.loading.isHeaderLoading(context));
-                if (!isStable) {
+                if (isStable) {
                     this.log('Headers are loading/unstable... waiting');
                     await new Promise(r => setTimeout(r, 100));
killedBy: TableMapper should check isHeaderLoading strategy
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
src/engine/tableMapper.ts:59:21
             // 2. Check Smart Loading State
             if (this.config.strategies.loading?.isHeaderLoading) {
                 const isStable = !(await this.config.strategies.loading.isHeaderLoading(context));
-                if (!isStable) {
+                if (false) {
                     this.log('Headers are loading/unstable... waiting');
                     await new Promise(r => setTimeout(r, 100));
killedBy: TableMapper should check isHeaderLoading strategy
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ArrowFunction
src/engine/tableMapper.ts:61:39
                 const isStable = !(await this.config.strategies.loading.isHeaderLoading(context));
                 if (!isStable) {
                     this.log('Headers are loading/unstable... waiting');
-                    await new Promise(r => setTimeout(r, 100));
+                    await new Promise(() => undefined);
                     continue;
                 }
killedBy: TableMapper should check isHeaderLoading strategy
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Timeout] BlockStatement
src/engine/tableMapper.ts:67:17
             }
 
             // 3. Attempt Scan
-            try {
-                const rawHeaders = await strategy(context);
-                const entries = await this.processHeaders(rawHeaders);
-
-                // Success
-                this._headerMap = new Map(entries);
-                this.log(`Mapped ${entries.length} columns: ${JSON.stringify(entries.map(e => e[0]))}`);
-                return this._headerMap;
-
-            } catch (e) {
+            try {} catch (e) {
                 lastError = e as Error;
                 this.log(`Header mapping failed (retrying): ${(e as Error).message}`);

[Survived] ArrowFunction
src/engine/tableMapper.ts:73:90
 
                 // Success
                 this._headerMap = new Map(entries);
-                this.log(`Mapped ${entries.length} columns: ${JSON.stringify(entries.map(e => e[0]))}`);
+                this.log(`Mapped ${entries.length} columns: ${JSON.stringify(entries.map(() => undefined))}`);
                 return this._headerMap;
 

[Timeout] BlockStatement
src/engine/tableMapper.ts:76:25
                 this.log(`Mapped ${entries.length} columns: ${JSON.stringify(entries.map(e => e[0]))}`);
                 return this._headerMap;
 
-            } catch (e) {
-                lastError = e as Error;
-                this.log(`Header mapping failed (retrying): ${(e as Error).message}`);
-                await new Promise(r => setTimeout(r, 100));
-            }
+            } catch (e) {}
         }
 

[Killed] ArrowFunction
src/engine/tableMapper.ts:79:35
             } catch (e) {
                 lastError = e as Error;
                 this.log(`Header mapping failed (retrying): ${(e as Error).message}`);
-                await new Promise(r => setTimeout(r, 100));
+                await new Promise(() => undefined);
             }
         }
killedBy: TableMapper.processHeaders/getMap throws when no headers found
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/engine/tableMapper.ts:83:15
             }
         }
 
-        throw lastError || new Error(`Timed out waiting for headers after ${headerTimeout}ms`);
+        throw true;
     }
 
killedBy: TableMapper should throw error if no headers found
statusReason: expected [Function] to throw error matching /No columns found/ but got ''

[Killed] LogicalOperator
src/engine/tableMapper.ts:83:15
             }
         }
 
-        throw lastError || new Error(`Timed out waiting for headers after ${headerTimeout}ms`);
+        throw lastError && new Error(`Timed out waiting for headers after ${headerTimeout}ms`);
     }
 
killedBy: TableMapper should throw error if no headers found
statusReason: expected [Function] to throw error matching /No columns found/ but got 'Timed out waiting for headers after 1…'

[Killed] BlockStatement
src/engine/tableMapper.ts:86:48
         throw lastError || new Error(`Timed out waiting for headers after ${headerTimeout}ms`);
     }
 
-    public async remapHeaders(): Promise<void> {
-        this._headerMap = null;
-        await this.getMap();
-    }
+    public async remapHeaders(): Promise<void> {}
 
     public getMapSync(): Map<string, number> | null {
killedBy: TableMapper.processHeaders/getMap remapHeaders resets internal map
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/engine/tableMapper.ts:91:53
         await this.getMap();
     }
 
-    public getMapSync(): Map<string, number> | null {
-        return this._headerMap;
-    }
+    public getMapSync(): Map<string, number> | null {}
 
     public isInitialized(): boolean {
killedBy: TableMapper should return cached map on subsequent calls
statusReason: expected undefined to be Map{ 'ID' => +0 } // Object.is equality

[Killed] BlockStatement
src/engine/tableMapper.ts:95:37
         return this._headerMap;
     }
 
-    public isInitialized(): boolean {
-        return this._headerMap !== null;
-    }
+    public isInitialized(): boolean {}
 
     public clear(): void {
killedBy: TableMapper.processHeaders/getMap remapHeaders resets internal map
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/engine/tableMapper.ts:96:16
     }
 
     public isInitialized(): boolean {
-        return this._headerMap !== null;
+        return true;
     }
 
killedBy: TableMapper.processHeaders/getMap remapHeaders resets internal map
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/engine/tableMapper.ts:96:16
     }
 
     public isInitialized(): boolean {
-        return this._headerMap !== null;
+        return this._headerMap === null;
     }
 
killedBy: TableMapper.processHeaders/getMap remapHeaders resets internal map
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/engine/tableMapper.ts:99:26
         return this._headerMap !== null;
     }
 
-    public clear(): void {
-        this._headerMap = null;
-    }
+    public clear(): void {}
 
     private async processHeaders(rawHeaders: string[]): Promise<[string, number][]> {
killedBy: TableMapper.processHeaders/getMap remapHeaders resets internal map
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/engine/tableMapper.ts:107:25
         const seenHeaders = new Set<string>();
         const entries: [string, number][] = [];
 
-        for (let i = 0; i < rawHeaders.length; i++) {
+        for (let i = 0; i <= rawHeaders.length; i++) {
             let text = rawHeaders[i].trim() || `__col_${i}`;
             if (this.config.headerTransformer) {
killedBy: TableMapper.processHeaders/getMap maps headers and applies headerTransformer
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] EqualityOperator
src/engine/tableMapper.ts:107:25
         const seenHeaders = new Set<string>();
         const entries: [string, number][] = [];
 
-        for (let i = 0; i < rawHeaders.length; i++) {
+        for (let i = 0; i >= rawHeaders.length; i++) {
             let text = rawHeaders[i].trim() || `__col_${i}`;
             if (this.config.headerTransformer) {
killedBy: TableMapper.processHeaders/getMap maps headers and applies headerTransformer
statusReason: Initialization Error: No columns found using selector "th". Check your selector or ensure the table is visible.

[Killed] ConditionalExpression
src/engine/tableMapper.ts:108:24
         const entries: [string, number][] = [];
 
         for (let i = 0; i < rawHeaders.length; i++) {
-            let text = rawHeaders[i].trim() || `__col_${i}`;
+            let text = true;
             if (this.config.headerTransformer) {
                 text = await this.config.headerTransformer({
killedBy: TableMapper should map headers correctly
statusReason: Initialization Error: Duplicate column names found: "true". Use 'headerTransformer' to rename duplicate columns.

[Killed] ConditionalExpression
src/engine/tableMapper.ts:108:24
         const entries: [string, number][] = [];
 
         for (let i = 0; i < rawHeaders.length; i++) {
-            let text = rawHeaders[i].trim() || `__col_${i}`;
+            let text = false;
             if (this.config.headerTransformer) {
                 text = await this.config.headerTransformer({
killedBy: TableMapper should map headers correctly
statusReason: Initialization Error: Duplicate column names found: "false". Use 'headerTransformer' to rename duplicate columns.

[Killed] ConditionalExpression
src/engine/tableMapper.ts:109:17
 
         for (let i = 0; i < rawHeaders.length; i++) {
             let text = rawHeaders[i].trim() || `__col_${i}`;
-            if (this.config.headerTransformer) {
+            if (true) {
                 text = await this.config.headerTransformer({
                     text,
killedBy: TableMapper should map headers correctly
statusReason: this.config.headerTransformer is not a function

[Killed] BlockStatement
src/engine/tableMapper.ts:109:48
 
         for (let i = 0; i < rawHeaders.length; i++) {
             let text = rawHeaders[i].trim() || `__col_${i}`;
-            if (this.config.headerTransformer) {
-                text = await this.config.headerTransformer({
-                    text,
-                    index: i,
-                    locator: this.resolve(this.config.headerSelector, this.rootLocator).nth(i),
-                    seenHeaders
-                });
-            }
+            if (this.config.headerTransformer) {}
             entries.push([text, i]);
             seenHeaders.add(text);
killedBy: TableMapper should use headerTransformer to rename columns
statusReason: Initialization Error: Duplicate column names found: "Name". Use 'headerTransformer' to rename duplicate columns.

[Killed] ArrayDeclaration
src/engine/tableMapper.ts:117:26
                     seenHeaders
                 });
             }
-            entries.push([text, i]);
+            entries.push([]);
             seenHeaders.add(text);
         }
killedBy: TableMapper.processHeaders/getMap maps headers and applies headerTransformer
statusReason: Initialization Error: Duplicate column names found: "undefined". Use 'headerTransformer' to rename duplicate columns.

[Killed] ConditionalExpression
src/engine/tableMapper.ts:122:13
         }
 
         // Validation: Check for empty table
-        if (entries.length === 0) {
+        if (true) {
             throw new Error(`Initialization Error: No columns found using selector "${this.config.headerSelector}". Check your selector or ensure the table is visible.`);
         }
killedBy: TableMapper.processHeaders/getMap maps headers and applies headerTransformer
statusReason: Initialization Error: No columns found using selector "th". Check your selector or ensure the table is visible.

[Killed] EqualityOperator
src/engine/tableMapper.ts:122:13
         }
 
         // Validation: Check for empty table
-        if (entries.length === 0) {
+        if (entries.length !== 0) {
             throw new Error(`Initialization Error: No columns found using selector "${this.config.headerSelector}". Check your selector or ensure the table is visible.`);
         }
killedBy: TableMapper.processHeaders/getMap maps headers and applies headerTransformer
statusReason: Initialization Error: No columns found using selector "th". Check your selector or ensure the table is visible.

[Killed] BlockStatement
src/engine/tableMapper.ts:129:39
         // Validation: Check for duplicates
         const seen = new Set<string>();
         const duplicates = new Set<string>();
-        for (const [name] of entries) {
-            if (seen.has(name)) {
-                duplicates.add(name);
-            }
-            seen.add(name);
-        }
+        for (const [name] of entries) {}
 
         if (duplicates.size > 0) {
killedBy: TableMapper should throw error if duplicate headers found
statusReason: promise resolved "Map{ 'ID' => 2, 'Name' => 1 }" instead of rejecting

[Killed] BlockStatement
src/engine/tableMapper.ts:130:33
         const seen = new Set<string>();
         const duplicates = new Set<string>();
         for (const [name] of entries) {
-            if (seen.has(name)) {
-                duplicates.add(name);
-            }
+            if (seen.has(name)) {}
             seen.add(name);
         }
killedBy: TableMapper should throw error if duplicate headers found
statusReason: promise resolved "Map{ 'ID' => 2, 'Name' => 1 }" instead of rejecting

[Killed] ConditionalExpression
src/engine/tableMapper.ts:130:17
         const seen = new Set<string>();
         const duplicates = new Set<string>();
         for (const [name] of entries) {
-            if (seen.has(name)) {
+            if (true) {
                 duplicates.add(name);
             }
killedBy: TableMapper should map headers correctly
statusReason: Initialization Error: Duplicate column names found: "ID", "Name", "Email". Use 'headerTransformer' to rename duplicate columns.

[Killed] ConditionalExpression
src/engine/tableMapper.ts:136:13
             seen.add(name);
         }
 
-        if (duplicates.size > 0) {
+        if (false) {
             const dupList = Array.from(duplicates).map(d => `"${d}"`).join(', ');
             throw new Error(`Initialization Error: Duplicate column names found: ${dupList}. Use 'headerTransformer' to rename duplicate columns.`);
killedBy: TableMapper should throw error if duplicate headers found
statusReason: promise resolved "Map{ 'ID' => 2, 'Name' => 1 }" instead of rejecting

[Killed] ConditionalExpression
src/engine/tableMapper.ts:136:13
             seen.add(name);
         }
 
-        if (duplicates.size > 0) {
+        if (true) {
             const dupList = Array.from(duplicates).map(d => `"${d}"`).join(', ');
             throw new Error(`Initialization Error: Duplicate column names found: ${dupList}. Use 'headerTransformer' to rename duplicate columns.`);
killedBy: TableMapper should map headers correctly
statusReason: Initialization Error: Duplicate column names found: . Use 'headerTransformer' to rename duplicate columns.

[Killed] ArrowFunction
src/engine/tableMapper.ts:137:56
         }
 
         if (duplicates.size > 0) {
-            const dupList = Array.from(duplicates).map(d => `"${d}"`).join(', ');
+            const dupList = Array.from(duplicates).map(() => undefined).join(', ');
             throw new Error(`Initialization Error: Duplicate column names found: ${dupList}. Use 'headerTransformer' to rename duplicate columns.`);
         }
killedBy: TableMapper should throw error if duplicate headers found
statusReason: expected [Function] to throw error matching /Duplicate column names found: "ID"/ but got 'Initialization Error: Duplicate colum…'

[Survived] StringLiteral
src/engine/tableMapper.ts:137:76
         }
 
         if (duplicates.size > 0) {
-            const dupList = Array.from(duplicates).map(d => `"${d}"`).join(', ');
+            const dupList = Array.from(duplicates).map(d => `"${d}"`).join("");
             throw new Error(`Initialization Error: Duplicate column names found: ${dupList}. Use 'headerTransformer' to rename duplicate columns.`);
         }
