[NoCoverage] BlockStatement
src/plugins/glide/columns.ts:9:62
  * The orchestration logic lives in _navigateToCell.
  */
 
-export const glideGoUp = async (context: StrategyContext) => {
-    await context.page.keyboard.press('ArrowUp');
-};
+export const glideGoUp = async (context: StrategyContext) => {};
 
 export const glideGoDown = async (context: StrategyContext) => {

[NoCoverage] BlockStatement
src/plugins/glide/columns.ts:13:64
     await context.page.keyboard.press('ArrowUp');
 };
 
-export const glideGoDown = async (context: StrategyContext) => {
-    await context.page.keyboard.press('ArrowDown');
-};
+export const glideGoDown = async (context: StrategyContext) => {};
 
 export const glideGoLeft = async (context: StrategyContext) => {

[NoCoverage] BlockStatement
src/plugins/glide/columns.ts:17:64
     await context.page.keyboard.press('ArrowDown');
 };
 
-export const glideGoLeft = async (context: StrategyContext) => {
-    await context.page.keyboard.press('ArrowLeft');
-};
+export const glideGoLeft = async (context: StrategyContext) => {};
 
 export const glideGoRight = async (context: StrategyContext) => {

[NoCoverage] StringLiteral
src/plugins/glide/columns.ts:18:39
 };
 
 export const glideGoLeft = async (context: StrategyContext) => {
-    await context.page.keyboard.press('ArrowLeft');
+    await context.page.keyboard.press("");
 };
 

[NoCoverage] BlockStatement
src/plugins/glide/columns.ts:21:65
     await context.page.keyboard.press('ArrowLeft');
 };
 
-export const glideGoRight = async (context: StrategyContext) => {
-    await context.page.keyboard.press('ArrowRight');
-};
+export const glideGoRight = async (context: StrategyContext) => {};
 
 export const glideGoHome = async (context: StrategyContext) => {

[NoCoverage] StringLiteral
src/plugins/glide/columns.ts:22:39
 };
 
 export const glideGoRight = async (context: StrategyContext) => {
-    await context.page.keyboard.press('ArrowRight');
+    await context.page.keyboard.press("");
 };
 

[NoCoverage] BlockStatement
src/plugins/glide/columns.ts:25:64
     await context.page.keyboard.press('ArrowRight');
 };
 
-export const glideGoHome = async (context: StrategyContext) => {
-    const { root, page } = context;
-
-    // Glide renders to canvas - the accessibility table (root) is inside the canvas
-    await root.evaluate((el) => {
-        const canvas = el.closest('canvas') || el.parentElement?.querySelector('canvas');
-        if (canvas instanceof HTMLCanvasElement) {
-            canvas.tabIndex = 0;
-            canvas.focus();
-        }
-    });
-    await page.waitForTimeout(100);
-
-    await page.keyboard.press('Control+Home');
-    await page.keyboard.press('Meta+ArrowUp');
-    await page.keyboard.press('Home');
-    await page.waitForTimeout(150);
-};
+export const glideGoHome = async (context: StrategyContext) => {};
 

[NoCoverage] BlockStatement
src/plugins/glide/columns.ts:29:33
     const { root, page } = context;
 
     // Glide renders to canvas - the accessibility table (root) is inside the canvas
-    await root.evaluate((el) => {
-        const canvas = el.closest('canvas') || el.parentElement?.querySelector('canvas');
-        if (canvas instanceof HTMLCanvasElement) {
-            canvas.tabIndex = 0;
-            canvas.focus();
-        }
-    });
+    await root.evaluate((el) => {});
     await page.waitForTimeout(100);
 

[NoCoverage] ConditionalExpression
src/plugins/glide/columns.ts:30:24
 
     // Glide renders to canvas - the accessibility table (root) is inside the canvas
     await root.evaluate((el) => {
-        const canvas = el.closest('canvas') || el.parentElement?.querySelector('canvas');
+        const canvas = false;
         if (canvas instanceof HTMLCanvasElement) {
             canvas.tabIndex = 0;

[NoCoverage] OptionalChaining
src/plugins/glide/columns.ts:30:48
 
     // Glide renders to canvas - the accessibility table (root) is inside the canvas
     await root.evaluate((el) => {
-        const canvas = el.closest('canvas') || el.parentElement?.querySelector('canvas');
+        const canvas = el.closest('canvas') || el.parentElement.querySelector('canvas');
         if (canvas instanceof HTMLCanvasElement) {
             canvas.tabIndex = 0;

[NoCoverage] ConditionalExpression
src/plugins/glide/columns.ts:31:13
     // Glide renders to canvas - the accessibility table (root) is inside the canvas
     await root.evaluate((el) => {
         const canvas = el.closest('canvas') || el.parentElement?.querySelector('canvas');
-        if (canvas instanceof HTMLCanvasElement) {
+        if (true) {
             canvas.tabIndex = 0;
             canvas.focus();

[NoCoverage] BlockStatement
src/plugins/glide/columns.ts:31:50
     // Glide renders to canvas - the accessibility table (root) is inside the canvas
     await root.evaluate((el) => {
         const canvas = el.closest('canvas') || el.parentElement?.querySelector('canvas');
-        if (canvas instanceof HTMLCanvasElement) {
-            canvas.tabIndex = 0;
-            canvas.focus();
-        }
+        if (canvas instanceof HTMLCanvasElement) {}
     });
     await page.waitForTimeout(100);

[NoCoverage] StringLiteral
src/plugins/glide/columns.ts:39:31
     await page.waitForTimeout(100);
 
     await page.keyboard.press('Control+Home');
-    await page.keyboard.press('Meta+ArrowUp');
+    await page.keyboard.press("");
     await page.keyboard.press('Home');
     await page.waitForTimeout(150);
