[NoCoverage] LogicalOperator
src/plugins/glide/headers.ts:8:19
  */
 export const scrollRightHeader = async (context: StrategyContext, options?: { limit?: number, selector?: string, scrollAmount?: number }): Promise<string[]> => {
     const { resolve, config, root, page } = context;
-    const limit = options?.limit ?? 20;
+    const limit = options?.limit && 20;
     const scrollAmount = options?.scrollAmount ?? 300;
     const collectedHeaders = new Set<string>();

[NoCoverage] OptionalChaining
src/plugins/glide/headers.ts:8:19
  */
 export const scrollRightHeader = async (context: StrategyContext, options?: { limit?: number, selector?: string, scrollAmount?: number }): Promise<string[]> => {
     const { resolve, config, root, page } = context;
-    const limit = options?.limit ?? 20;
+    const limit = options.limit ?? 20;
     const scrollAmount = options?.scrollAmount ?? 300;
     const collectedHeaders = new Set<string>();

[NoCoverage] LogicalOperator
src/plugins/glide/headers.ts:9:26
 export const scrollRightHeader = async (context: StrategyContext, options?: { limit?: number, selector?: string, scrollAmount?: number }): Promise<string[]> => {
     const { resolve, config, root, page } = context;
     const limit = options?.limit ?? 20;
-    const scrollAmount = options?.scrollAmount ?? 300;
+    const scrollAmount = options?.scrollAmount && 300;
     const collectedHeaders = new Set<string>();
 

[NoCoverage] OptionalChaining
src/plugins/glide/headers.ts:9:26
 export const scrollRightHeader = async (context: StrategyContext, options?: { limit?: number, selector?: string, scrollAmount?: number }): Promise<string[]> => {
     const { resolve, config, root, page } = context;
     const limit = options?.limit ?? 20;
-    const scrollAmount = options?.scrollAmount ?? 300;
+    const scrollAmount = options.scrollAmount ?? 300;
     const collectedHeaders = new Set<string>();
 

[NoCoverage] BlockStatement
src/plugins/glide/headers.ts:12:36
     const scrollAmount = options?.scrollAmount ?? 300;
     const collectedHeaders = new Set<string>();
 
-    const getVisible = async () => {
-        const headerLoc = resolve(config.headerSelector as Selector, root);
-        const texts = await headerLoc.allInnerTexts();
-        return texts.map(t => t.trim());
-    };
+    const getVisible = async () => {};
 
     let currentHeaders = await getVisible();

[NoCoverage] ArrowFunction
src/plugins/glide/headers.ts:15:26
     const getVisible = async () => {
         const headerLoc = resolve(config.headerSelector as Selector, root);
         const texts = await headerLoc.allInnerTexts();
-        return texts.map(t => t.trim());
+        return texts.map(() => undefined);
     };
 

[NoCoverage] MethodExpression
src/plugins/glide/headers.ts:15:31
     const getVisible = async () => {
         const headerLoc = resolve(config.headerSelector as Selector, root);
         const texts = await headerLoc.allInnerTexts();
-        return texts.map(t => t.trim());
+        return texts.map(t => t);
     };
 

[NoCoverage] ArrowFunction
src/plugins/glide/headers.ts:19:28
     };
 
     let currentHeaders = await getVisible();
-    currentHeaders.forEach(h => collectedHeaders.add(h));
+    currentHeaders.forEach(() => undefined);
 
     const scrollerHandle = await root.evaluateHandle((el, selector) => {

[NoCoverage] BlockStatement
src/plugins/glide/headers.ts:21:72
     let currentHeaders = await getVisible();
     currentHeaders.forEach(h => collectedHeaders.add(h));
 
-    const scrollerHandle = await root.evaluateHandle((el, selector) => {
-        if (selector && el.matches(selector)) return el;
-        const effectiveSelector = selector || '.dvn-scroller';
-        const ancestor = el.closest(effectiveSelector);
-        if (ancestor) return ancestor;
-        return document.querySelector(effectiveSelector);
-    }, options?.selector);
+    const scrollerHandle = await root.evaluateHandle((el, selector) => {}, options?.selector);
 
     const isScrollerFound = await scrollerHandle.evaluate(el => !!el);

[NoCoverage] LogicalOperator
src/plugins/glide/headers.ts:22:13
     currentHeaders.forEach(h => collectedHeaders.add(h));
 
     const scrollerHandle = await root.evaluateHandle((el, selector) => {
-        if (selector && el.matches(selector)) return el;
+        if (selector || el.matches(selector)) return el;
         const effectiveSelector = selector || '.dvn-scroller';
         const ancestor = el.closest(effectiveSelector);

[NoCoverage] ConditionalExpression
src/plugins/glide/headers.ts:22:13
     currentHeaders.forEach(h => collectedHeaders.add(h));
 
     const scrollerHandle = await root.evaluateHandle((el, selector) => {
-        if (selector && el.matches(selector)) return el;
+        if (true) return el;
         const effectiveSelector = selector || '.dvn-scroller';
         const ancestor = el.closest(effectiveSelector);

[NoCoverage] ConditionalExpression
src/plugins/glide/headers.ts:23:35
 
     const scrollerHandle = await root.evaluateHandle((el, selector) => {
         if (selector && el.matches(selector)) return el;
-        const effectiveSelector = selector || '.dvn-scroller';
+        const effectiveSelector = true;
         const ancestor = el.closest(effectiveSelector);
         if (ancestor) return ancestor;

[NoCoverage] LogicalOperator
src/plugins/glide/headers.ts:23:35
 
     const scrollerHandle = await root.evaluateHandle((el, selector) => {
         if (selector && el.matches(selector)) return el;
-        const effectiveSelector = selector || '.dvn-scroller';
+        const effectiveSelector = selector && '.dvn-scroller';
         const ancestor = el.closest(effectiveSelector);
         if (ancestor) return ancestor;

[NoCoverage] ConditionalExpression
src/plugins/glide/headers.ts:25:13
         if (selector && el.matches(selector)) return el;
         const effectiveSelector = selector || '.dvn-scroller';
         const ancestor = el.closest(effectiveSelector);
-        if (ancestor) return ancestor;
+        if (false) return ancestor;
         return document.querySelector(effectiveSelector);
     }, options?.selector);

[NoCoverage] ConditionalExpression
src/plugins/glide/headers.ts:25:13
         if (selector && el.matches(selector)) return el;
         const effectiveSelector = selector || '.dvn-scroller';
         const ancestor = el.closest(effectiveSelector);
-        if (ancestor) return ancestor;
+        if (true) return ancestor;
         return document.querySelector(effectiveSelector);
     }, options?.selector);

[NoCoverage] OptionalChaining
src/plugins/glide/headers.ts:27:8
         const ancestor = el.closest(effectiveSelector);
         if (ancestor) return ancestor;
         return document.querySelector(effectiveSelector);
-    }, options?.selector);
+    }, options.selector);
 
     const isScrollerFound = await scrollerHandle.evaluate(el => !!el);

[NoCoverage] ArrowFunction
src/plugins/glide/headers.ts:29:59
         return document.querySelector(effectiveSelector);
     }, options?.selector);
 
-    const isScrollerFound = await scrollerHandle.evaluate(el => !!el);
+    const isScrollerFound = await scrollerHandle.evaluate(() => undefined);
 
     if (isScrollerFound) {

[NoCoverage] BooleanLiteral
src/plugins/glide/headers.ts:29:65
         return document.querySelector(effectiveSelector);
     }, options?.selector);
 
-    const isScrollerFound = await scrollerHandle.evaluate(el => !!el);
+    const isScrollerFound = await scrollerHandle.evaluate(el => !el);
 
     if (isScrollerFound) {

[NoCoverage] ConditionalExpression
src/plugins/glide/headers.ts:31:9
 
     const isScrollerFound = await scrollerHandle.evaluate(el => !!el);
 
-    if (isScrollerFound) {
+    if (false) {
         await scrollerHandle.evaluate(el => el!.scrollLeft = 0);
         await page.waitForTimeout(200);

[NoCoverage] BlockStatement
src/plugins/glide/headers.ts:31:26
 
     const isScrollerFound = await scrollerHandle.evaluate(el => !!el);
 
-    if (isScrollerFound) {
-        await scrollerHandle.evaluate(el => el!.scrollLeft = 0);
-        await page.waitForTimeout(200);
-
-        for (let i = 0; i < limit; i++) {
-            const sizeBefore = collectedHeaders.size;
-
-            await scrollerHandle.evaluate((el, amount) => el!.scrollLeft += amount, scrollAmount);
-            await page.waitForTimeout(300);
-
-            const newHeaders = await getVisible();
-            newHeaders.forEach(h => collectedHeaders.add(h));
-
-            if (collectedHeaders.size === sizeBefore) {
-                await scrollerHandle.evaluate((el, amount) => el!.scrollLeft += amount, scrollAmount);
-                await page.waitForTimeout(300);
-                const retryHeaders = await getVisible();
-                retryHeaders.forEach(h => collectedHeaders.add(h));
-                if (collectedHeaders.size === sizeBefore) break;
-            }
-        }
-    } else {
+    if (isScrollerFound) {} else {
         console.warn("HeaderStrategies.scrollRight: Could not find scroller. Returning visible headers.");
     }

[NoCoverage] ArrowFunction
src/plugins/glide/headers.ts:32:39
     const isScrollerFound = await scrollerHandle.evaluate(el => !!el);
 
     if (isScrollerFound) {
-        await scrollerHandle.evaluate(el => el!.scrollLeft = 0);
+        await scrollerHandle.evaluate(() => undefined);
         await page.waitForTimeout(200);
 

[NoCoverage] ConditionalExpression
src/plugins/glide/headers.ts:35:25
         await scrollerHandle.evaluate(el => el!.scrollLeft = 0);
         await page.waitForTimeout(200);
 
-        for (let i = 0; i < limit; i++) {
+        for (let i = 0; false; i++) {
             const sizeBefore = collectedHeaders.size;
 

[NoCoverage] EqualityOperator
src/plugins/glide/headers.ts:35:25
         await scrollerHandle.evaluate(el => el!.scrollLeft = 0);
         await page.waitForTimeout(200);
 
-        for (let i = 0; i < limit; i++) {
+        for (let i = 0; i >= limit; i++) {
             const sizeBefore = collectedHeaders.size;
 

[NoCoverage] AssignmentOperator
src/plugins/glide/headers.ts:38:59
         for (let i = 0; i < limit; i++) {
             const sizeBefore = collectedHeaders.size;
 
-            await scrollerHandle.evaluate((el, amount) => el!.scrollLeft += amount, scrollAmount);
+            await scrollerHandle.evaluate((el, amount) => el!.scrollLeft -= amount, scrollAmount);
             await page.waitForTimeout(300);
 

[NoCoverage] ArrowFunction
src/plugins/glide/headers.ts:38:43
         for (let i = 0; i < limit; i++) {
             const sizeBefore = collectedHeaders.size;
 
-            await scrollerHandle.evaluate((el, amount) => el!.scrollLeft += amount, scrollAmount);
+            await scrollerHandle.evaluate(() => undefined, scrollAmount);
             await page.waitForTimeout(300);
 

[NoCoverage] ArrowFunction
src/plugins/glide/headers.ts:42:32
             await page.waitForTimeout(300);
 
             const newHeaders = await getVisible();
-            newHeaders.forEach(h => collectedHeaders.add(h));
+            newHeaders.forEach(() => undefined);
 
             if (collectedHeaders.size === sizeBefore) {

[NoCoverage] ConditionalExpression
src/plugins/glide/headers.ts:44:17
             const newHeaders = await getVisible();
             newHeaders.forEach(h => collectedHeaders.add(h));
 
-            if (collectedHeaders.size === sizeBefore) {
+            if (true) {
                 await scrollerHandle.evaluate((el, amount) => el!.scrollLeft += amount, scrollAmount);
                 await page.waitForTimeout(300);

[NoCoverage] ConditionalExpression
src/plugins/glide/headers.ts:44:17
             const newHeaders = await getVisible();
             newHeaders.forEach(h => collectedHeaders.add(h));
 
-            if (collectedHeaders.size === sizeBefore) {
+            if (false) {
                 await scrollerHandle.evaluate((el, amount) => el!.scrollLeft += amount, scrollAmount);
                 await page.waitForTimeout(300);

[NoCoverage] ArrowFunction
src/plugins/glide/headers.ts:45:47
             newHeaders.forEach(h => collectedHeaders.add(h));
 
             if (collectedHeaders.size === sizeBefore) {
-                await scrollerHandle.evaluate((el, amount) => el!.scrollLeft += amount, scrollAmount);
+                await scrollerHandle.evaluate(() => undefined, scrollAmount);
                 await page.waitForTimeout(300);
                 const retryHeaders = await getVisible();

[NoCoverage] AssignmentOperator
src/plugins/glide/headers.ts:45:63
             newHeaders.forEach(h => collectedHeaders.add(h));
 
             if (collectedHeaders.size === sizeBefore) {
-                await scrollerHandle.evaluate((el, amount) => el!.scrollLeft += amount, scrollAmount);
+                await scrollerHandle.evaluate((el, amount) => el!.scrollLeft -= amount, scrollAmount);
                 await page.waitForTimeout(300);
                 const retryHeaders = await getVisible();

[NoCoverage] ArrowFunction
src/plugins/glide/headers.ts:48:38
                 await scrollerHandle.evaluate((el, amount) => el!.scrollLeft += amount, scrollAmount);
                 await page.waitForTimeout(300);
                 const retryHeaders = await getVisible();
-                retryHeaders.forEach(h => collectedHeaders.add(h));
+                retryHeaders.forEach(() => undefined);
                 if (collectedHeaders.size === sizeBefore) break;
             }

[NoCoverage] ConditionalExpression
src/plugins/glide/headers.ts:49:21
                 await page.waitForTimeout(300);
                 const retryHeaders = await getVisible();
                 retryHeaders.forEach(h => collectedHeaders.add(h));
-                if (collectedHeaders.size === sizeBefore) break;
+                if (true) break;
             }
         }

[NoCoverage] EqualityOperator
src/plugins/glide/headers.ts:49:21
                 await page.waitForTimeout(300);
                 const retryHeaders = await getVisible();
                 retryHeaders.forEach(h => collectedHeaders.add(h));
-                if (collectedHeaders.size === sizeBefore) break;
+                if (collectedHeaders.size !== sizeBefore) break;
             }
         }

[NoCoverage] BlockStatement
src/plugins/glide/headers.ts:52:12
                 if (collectedHeaders.size === sizeBefore) break;
             }
         }
-    } else {
-        console.warn("HeaderStrategies.scrollRight: Could not find scroller. Returning visible headers.");
-    }
+    } else {}
 
     await scrollerHandle.evaluate(el => el!.scrollLeft = 0);

[NoCoverage] StringLiteral
src/plugins/glide/headers.ts:53:22
             }
         }
     } else {
-        console.warn("HeaderStrategies.scrollRight: Could not find scroller. Returning visible headers.");
+        console.warn("");
     }
 

[NoCoverage] ArrowFunction
src/plugins/glide/headers.ts:56:35
         console.warn("HeaderStrategies.scrollRight: Could not find scroller. Returning visible headers.");
     }
 
-    await scrollerHandle.evaluate(el => el!.scrollLeft = 0);
+    await scrollerHandle.evaluate(() => undefined);
     await page.waitForTimeout(200);
 
