[NoCoverage] BlockStatement
src/smartRow.ts:35:42
 
     // Get active cell if strategy is available
     let activeCell = null;
-    if (config.strategies.getActiveCell) {
-        activeCell = await config.strategies.getActiveCell({
-            config,
-            root: rootLocator,
-            page,
-            resolve
-        });
-
-        // Optimization: Check if we are ALREADY at the target cell
-        if (activeCell && activeCell.rowIndex === rowIndex && activeCell.columnIndex === index) {
-            // Skip navigation - we're already there!
-            return activeCell.locator;
-        }
-    }
+    if (config.strategies.getActiveCell) {}
 
     const context: StrategyContext = { config, root: rootLocator, page, resolve };

[NoCoverage] ConditionalExpression
src/smartRow.ts:35:9
 
     // Get active cell if strategy is available
     let activeCell = null;
-    if (config.strategies.getActiveCell) {
+    if (true) {
         activeCell = await config.strategies.getActiveCell({
             config,

[NoCoverage] EqualityOperator
src/smartRow.ts:44:27
         });
 
         // Optimization: Check if we are ALREADY at the target cell
-        if (activeCell && activeCell.rowIndex === rowIndex && activeCell.columnIndex === index) {
+        if (activeCell && activeCell.rowIndex !== rowIndex && activeCell.columnIndex === index) {
             // Skip navigation - we're already there!
             return activeCell.locator;

[NoCoverage] ConditionalExpression
src/smartRow.ts:44:27
         });
 
         // Optimization: Check if we are ALREADY at the target cell
-        if (activeCell && activeCell.rowIndex === rowIndex && activeCell.columnIndex === index) {
+        if (activeCell && true && activeCell.columnIndex === index) {
             // Skip navigation - we're already there!
             return activeCell.locator;

[NoCoverage] ConditionalExpression
src/smartRow.ts:53:9
     const context: StrategyContext = { config, root: rootLocator, page, resolve };
 
     // Use navigation primitives if available
-    if (config.strategies.navigation) {
+    if (true) {
         const nav = config.strategies.navigation;
 

[NoCoverage] ConditionalExpression
src/smartRow.ts:53:9
     const context: StrategyContext = { config, root: rootLocator, page, resolve };
 
     // Use navigation primitives if available
-    if (config.strategies.navigation) {
+    if (false) {
         const nav = config.strategies.navigation;
 

[NoCoverage] ConditionalExpression
src/smartRow.ts:56:13
     if (config.strategies.navigation) {
         const nav = config.strategies.navigation;
 
-        if (typeof rowIndex !== 'number') {
+        if (true) {
             throw new Error('Row index is required for navigation');
         }

[NoCoverage] BlockStatement
src/smartRow.ts:56:43
     if (config.strategies.navigation) {
         const nav = config.strategies.navigation;
 
-        if (typeof rowIndex !== 'number') {
-            throw new Error('Row index is required for navigation');
-        }
+        if (typeof rowIndex !== 'number') {}
 
         // Determine starting position

[NoCoverage] StringLiteral
src/smartRow.ts:57:29
         const nav = config.strategies.navigation;
 
         if (typeof rowIndex !== 'number') {
-            throw new Error('Row index is required for navigation');
+            throw new Error("");
         }
 

[NoCoverage] ConditionalExpression
src/smartRow.ts:64:55
         let startRow = 0;
         let startCol = 0;
 
-        if (activeCell && activeCell.rowIndex >= 0 && activeCell.columnIndex >= 0) {
+        if (activeCell && activeCell.rowIndex >= 0 && true) {
             // Use current position
             startRow = activeCell.rowIndex;

[NoCoverage] EqualityOperator
src/smartRow.ts:64:27
         let startRow = 0;
         let startCol = 0;
 
-        if (activeCell && activeCell.rowIndex >= 0 && activeCell.columnIndex >= 0) {
+        if (activeCell && activeCell.rowIndex > 0 && activeCell.columnIndex >= 0) {
             // Use current position
             startRow = activeCell.rowIndex;

[NoCoverage] ConditionalExpression
src/smartRow.ts:68:20
             // Use current position
             startRow = activeCell.rowIndex;
             startCol = activeCell.columnIndex;
-        } else if (nav.goHome) {
+        } else if (true) {
             // Reset to top-left
             await nav.goHome(context);

[NoCoverage] BlockStatement
src/smartRow.ts:68:32
             // Use current position
             startRow = activeCell.rowIndex;
             startCol = activeCell.columnIndex;
-        } else if (nav.goHome) {
-            // Reset to top-left
-            await nav.goHome(context);
-        }
+        } else if (nav.goHome) {}
 
         // Calculate movement needed

[NoCoverage] ArithmeticOperator
src/smartRow.ts:74:25
         }
 
         // Calculate movement needed
-        const rowDiff = rowIndex - startRow;
+        const rowDiff = rowIndex + startRow;
         const colDiff = index - startCol;
 

[NoCoverage] ArithmeticOperator
src/smartRow.ts:75:25
 
         // Calculate movement needed
         const rowDiff = rowIndex - startRow;
-        const colDiff = index - startCol;
+        const colDiff = index + startCol;
 
         // Navigate vertically

[NoCoverage] EqualityOperator
src/smartRow.ts:78:25
         const colDiff = index - startCol;
 
         // Navigate vertically
-        for (let i = 0; i < Math.abs(rowDiff); i++) {
+        for (let i = 0; i <= Math.abs(rowDiff); i++) {
             if (rowDiff > 0 && nav.goDown) {
                 await nav.goDown(context);

[NoCoverage] ConditionalExpression
src/smartRow.ts:78:25
         const colDiff = index - startCol;
 
         // Navigate vertically
-        for (let i = 0; i < Math.abs(rowDiff); i++) {
+        for (let i = 0; false; i++) {
             if (rowDiff > 0 && nav.goDown) {
                 await nav.goDown(context);

[NoCoverage] LogicalOperator
src/smartRow.ts:79:17
 
         // Navigate vertically
         for (let i = 0; i < Math.abs(rowDiff); i++) {
-            if (rowDiff > 0 && nav.goDown) {
+            if (rowDiff > 0 || nav.goDown) {
                 await nav.goDown(context);
             } else if (rowDiff < 0 && nav.goUp) {

[NoCoverage] EqualityOperator
src/smartRow.ts:79:17
 
         // Navigate vertically
         for (let i = 0; i < Math.abs(rowDiff); i++) {
-            if (rowDiff > 0 && nav.goDown) {
+            if (rowDiff >= 0 && nav.goDown) {
                 await nav.goDown(context);
             } else if (rowDiff < 0 && nav.goUp) {

[NoCoverage] BlockStatement
src/smartRow.ts:81:49
         for (let i = 0; i < Math.abs(rowDiff); i++) {
             if (rowDiff > 0 && nav.goDown) {
                 await nav.goDown(context);
-            } else if (rowDiff < 0 && nav.goUp) {
-                await nav.goUp(context);
-            }
+            } else if (rowDiff < 0 && nav.goUp) {}
         }
 

[NoCoverage] LogicalOperator
src/smartRow.ts:81:24
         for (let i = 0; i < Math.abs(rowDiff); i++) {
             if (rowDiff > 0 && nav.goDown) {
                 await nav.goDown(context);
-            } else if (rowDiff < 0 && nav.goUp) {
+            } else if (rowDiff < 0 || nav.goUp) {
                 await nav.goUp(context);
             }

[NoCoverage] ConditionalExpression
src/smartRow.ts:87:25
         }
 
         // Navigate horizontally
-        for (let i = 0; i < Math.abs(colDiff); i++) {
+        for (let i = 0; false; i++) {
             if (colDiff > 0 && nav.goRight) {
                 await nav.goRight(context);

[NoCoverage] BlockStatement
src/smartRow.ts:87:53
         }
 
         // Navigate horizontally
-        for (let i = 0; i < Math.abs(colDiff); i++) {
-            if (colDiff > 0 && nav.goRight) {
-                await nav.goRight(context);
-            } else if (colDiff < 0 && nav.goLeft) {
-                await nav.goLeft(context);
-            }
-        }
+        for (let i = 0; i < Math.abs(colDiff); i++) {}
 
         // Wait for active cell to match target: poll getActiveCell or fallback to fixed delay

[NoCoverage] ConditionalExpression
src/smartRow.ts:88:17
 
         // Navigate horizontally
         for (let i = 0; i < Math.abs(colDiff); i++) {
-            if (colDiff > 0 && nav.goRight) {
+            if (false) {
                 await nav.goRight(context);
             } else if (colDiff < 0 && nav.goLeft) {

[NoCoverage] LogicalOperator
src/smartRow.ts:88:17
 
         // Navigate horizontally
         for (let i = 0; i < Math.abs(colDiff); i++) {
-            if (colDiff > 0 && nav.goRight) {
+            if (colDiff > 0 || nav.goRight) {
                 await nav.goRight(context);
             } else if (colDiff < 0 && nav.goLeft) {

[NoCoverage] LogicalOperator
src/smartRow.ts:90:24
         for (let i = 0; i < Math.abs(colDiff); i++) {
             if (colDiff > 0 && nav.goRight) {
                 await nav.goRight(context);
-            } else if (colDiff < 0 && nav.goLeft) {
+            } else if (colDiff < 0 || nav.goLeft) {
                 await nav.goLeft(context);
             }

[NoCoverage] BlockStatement
src/smartRow.ts:90:51
         for (let i = 0; i < Math.abs(colDiff); i++) {
             if (colDiff > 0 && nav.goRight) {
                 await nav.goRight(context);
-            } else if (colDiff < 0 && nav.goLeft) {
-                await nav.goLeft(context);
-            }
+            } else if (colDiff < 0 && nav.goLeft) {}
         }
 

[NoCoverage] BlockStatement
src/smartRow.ts:96:46
         }
 
         // Wait for active cell to match target: poll getActiveCell or fallback to fixed delay
-        if (config.strategies.getActiveCell) {
-            const pollIntervalMs = 10;
-            const maxWaitMs = 50;
-            const start = Date.now();
-            while (Date.now() - start < maxWaitMs) {
-                const updatedActiveCell = await config.strategies.getActiveCell({
-                    config,
-                    root: rootLocator,
-                    page,
-                    resolve
-                });
-                if (updatedActiveCell && updatedActiveCell.rowIndex === rowIndex && updatedActiveCell.columnIndex === index) {
-                    return updatedActiveCell.locator;
-                }
-                await page.waitForTimeout(pollIntervalMs);
-            }
-            const final = await config.strategies.getActiveCell({
-                config,
-                root: rootLocator,
-                page,
-                resolve
-            });
-            if (final) return final.locator;
-            return null;
-        }
+        if (config.strategies.getActiveCell) {}
 
         return null;

[NoCoverage] ConditionalExpression
src/smartRow.ts:96:13
         }
 
         // Wait for active cell to match target: poll getActiveCell or fallback to fixed delay
-        if (config.strategies.getActiveCell) {
+        if (true) {
             const pollIntervalMs = 10;
             const maxWaitMs = 50;

[NoCoverage] ArithmeticOperator
src/smartRow.ts:100:20
             const pollIntervalMs = 10;
             const maxWaitMs = 50;
             const start = Date.now();
-            while (Date.now() - start < maxWaitMs) {
+            while (Date.now() + start < maxWaitMs) {
                 const updatedActiveCell = await config.strategies.getActiveCell({
                     config,

[NoCoverage] BlockStatement
src/smartRow.ts:100:52
             const pollIntervalMs = 10;
             const maxWaitMs = 50;
             const start = Date.now();
-            while (Date.now() - start < maxWaitMs) {
-                const updatedActiveCell = await config.strategies.getActiveCell({
-                    config,
-                    root: rootLocator,
-                    page,
-                    resolve
-                });
-                if (updatedActiveCell && updatedActiveCell.rowIndex === rowIndex && updatedActiveCell.columnIndex === index) {
-                    return updatedActiveCell.locator;
-                }
-                await page.waitForTimeout(pollIntervalMs);
-            }
+            while (Date.now() - start < maxWaitMs) {}
             const final = await config.strategies.getActiveCell({
                 config,

[NoCoverage] LogicalOperator
src/smartRow.ts:107:21
                     page,
                     resolve
                 });
-                if (updatedActiveCell && updatedActiveCell.rowIndex === rowIndex && updatedActiveCell.columnIndex === index) {
+                if (updatedActiveCell || updatedActiveCell.rowIndex === rowIndex && updatedActiveCell.columnIndex === index) {
                     return updatedActiveCell.locator;
                 }

[NoCoverage] BlockStatement
src/smartRow.ts:107:126
                     page,
                     resolve
                 });
-                if (updatedActiveCell && updatedActiveCell.rowIndex === rowIndex && updatedActiveCell.columnIndex === index) {
-                    return updatedActiveCell.locator;
-                }
+                if (updatedActiveCell && updatedActiveCell.rowIndex === rowIndex && updatedActiveCell.columnIndex === index) {}
                 await page.waitForTimeout(pollIntervalMs);
             }

[NoCoverage] ConditionalExpression
src/smartRow.ts:118:17
                 page,
                 resolve
             });
-            if (final) return final.locator;
+            if (true) return final.locator;
             return null;
         }

[NoCoverage] ConditionalExpression
src/smartRow.ts:118:17
                 page,
                 resolve
             });
-            if (final) return final.locator;
+            if (false) return final.locator;
             return null;
         }

[NoCoverage] BlockStatement
src/smartRow.ts:153:51
     smart.table = table as any;
 
     // Attach Methods
-    smart.getCell = (colName: string): Locator => {
-        const idx = map.get(colName);
-        if (idx === undefined) {
-            throw new Error(buildColumnNotFoundError(colName, Array.from(map.keys())));
-        }
-
-        if (config.strategies.getCellLocator) {
-            return config.strategies.getCellLocator({
-                row: rowLocator,
-                columnName: colName,
-                columnIndex: idx,
-                rowIndex: rowIndex,
-                page: rootLocator.page()
-            });
-        }
-
-        return resolve(config.cellSelector, rowLocator).nth(idx);
-    };
+    smart.getCell = (colName: string): Locator => {};
 
     smart.wasFound = (): boolean => {

[NoCoverage] BlockStatement
src/smartRow.ts:155:32
     // Attach Methods
     smart.getCell = (colName: string): Locator => {
         const idx = map.get(colName);
-        if (idx === undefined) {
-            throw new Error(buildColumnNotFoundError(colName, Array.from(map.keys())));
-        }
+        if (idx === undefined) {}
 
         if (config.strategies.getCellLocator) {

[NoCoverage] ConditionalExpression
src/smartRow.ts:155:13
     // Attach Methods
     smart.getCell = (colName: string): Locator => {
         const idx = map.get(colName);
-        if (idx === undefined) {
+        if (true) {
             throw new Error(buildColumnNotFoundError(colName, Array.from(map.keys())));
         }

[NoCoverage] ConditionalExpression
src/smartRow.ts:159:13
             throw new Error(buildColumnNotFoundError(colName, Array.from(map.keys())));
         }
 
-        if (config.strategies.getCellLocator) {
+        if (true) {
             return config.strategies.getCellLocator({
                 row: rowLocator,

[NoCoverage] ConditionalExpression
src/smartRow.ts:159:13
             throw new Error(buildColumnNotFoundError(colName, Array.from(map.keys())));
         }
 
-        if (config.strategies.getCellLocator) {
+        if (false) {
             return config.strategies.getCellLocator({
                 row: rowLocator,

[NoCoverage] BlockStatement
src/smartRow.ts:172:37
         return resolve(config.cellSelector, rowLocator).nth(idx);
     };
 
-    smart.wasFound = (): boolean => {
-        return !(smart as any)[SENTINEL_ROW];
-    };
+    smart.wasFound = (): boolean => {};
 
     smart.toJSON = async (options?: { columns?: string[] }): Promise<T> => {

[NoCoverage] BooleanLiteral
src/smartRow.ts:173:16
     };
 
     smart.wasFound = (): boolean => {
-        return !(smart as any)[SENTINEL_ROW];
+        return (smart as any)[SENTINEL_ROW];
     };
 

[NoCoverage] OptionalChaining
src/smartRow.ts:182:31
 
         // Build a getHeaderCell helper for the beforeCellRead context.
         // Uses the table reference if available, otherwise falls back to index-based lookup.
-        const getHeaderCell = table?.getHeaderCell
+        const getHeaderCell = table.getHeaderCell
             ? table.getHeaderCell.bind(table)
             : async (colName: string) => {

[NoCoverage] BlockStatement
src/smartRow.ts:184:42
         // Uses the table reference if available, otherwise falls back to index-based lookup.
         const getHeaderCell = table?.getHeaderCell
             ? table.getHeaderCell.bind(table)
-            : async (colName: string) => {
-                const idx = map.get(colName);
-                if (idx === undefined) throw new Error(`Column "${colName}" not found`);
-                return resolve(config.headerSelector as any, rootLocator).nth(idx);
-            };
+            : async (colName: string) => {};
 
         for (const [col, idx] of map.entries()) {

[NoCoverage] ConditionalExpression
src/smartRow.ts:186:21
             ? table.getHeaderCell.bind(table)
             : async (colName: string) => {
                 const idx = map.get(colName);
-                if (idx === undefined) throw new Error(`Column "${colName}" not found`);
+                if (false) throw new Error(`Column "${colName}" not found`);
                 return resolve(config.headerSelector as any, rootLocator).nth(idx);
             };

[NoCoverage] ConditionalExpression
src/smartRow.ts:186:21
             ? table.getHeaderCell.bind(table)
             : async (colName: string) => {
                 const idx = map.get(colName);
-                if (idx === undefined) throw new Error(`Column "${colName}" not found`);
+                if (true) throw new Error(`Column "${colName}" not found`);
                 return resolve(config.headerSelector as any, rootLocator).nth(idx);
             };

[NoCoverage] ConditionalExpression
src/smartRow.ts:191:17
             };
 
         for (const [col, idx] of map.entries()) {
-            if (options?.columns && !options.columns.includes(col)) {
+            if (true) {
                 continue;
             }

[NoCoverage] BlockStatement
src/smartRow.ts:191:69
             };
 
         for (const [col, idx] of map.entries()) {
-            if (options?.columns && !options.columns.includes(col)) {
-                continue;
-            }
+            if (options?.columns && !options.columns.includes(col)) {}
 
             // Check if we have a column override for this column

[NoCoverage] OptionalChaining
src/smartRow.ts:196:36
             }
 
             // Check if we have a column override for this column
-            const columnOverride = config.columnOverrides?.[col as keyof T];
+            const columnOverride = config.columnOverrides[col as keyof T];
             const mapper = columnOverride?.read;
 

[NoCoverage] OptionalChaining
src/smartRow.ts:197:28
 
             // Check if we have a column override for this column
             const columnOverride = config.columnOverrides?.[col as keyof T];
-            const mapper = columnOverride?.read;
+            const mapper = columnOverride.read;
 
             // --- Navigation Logic Start ---

[NoCoverage] ObjectLiteral
src/smartRow.ts:201:52
 
             // --- Navigation Logic Start ---
             const cell = config.strategies.getCellLocator
-                ? config.strategies.getCellLocator({
-                    row: rowLocator,
-                    columnName: col,
-                    columnIndex: idx,
-                    rowIndex: rowIndex,
-                    page: page
-                })
+                ? config.strategies.getCellLocator({})
                 : resolve(config.cellSelector, rowLocator).nth(idx);
 

[NoCoverage] ConditionalExpression
src/smartRow.ts:213:17
             let targetCell = cell;
             const count = await cell.count();
 
-            if (count === 0) {
+            if (false) {
                 // Cell not in DOM (virtualized) - navigate to it
                 const navigatedCell = await _navigateToCell({

[NoCoverage] BlockStatement
src/smartRow.ts:213:30
             let targetCell = cell;
             const count = await cell.count();
 
-            if (count === 0) {
-                // Cell not in DOM (virtualized) - navigate to it
-                const navigatedCell = await _navigateToCell({
-                    config,
-                    rootLocator,
-                    page,
-                    resolve,
-                    column: col,
-                    index: idx,
-                    rowLocator,
-                    rowIndex
-                });
-
-                if (navigatedCell) {
-                    targetCell = navigatedCell;
-                }
-            }
+            if (count === 0) {}
             // --- Navigation Logic End ---
 

[NoCoverage] ConditionalExpression
src/smartRow.ts:226:21
                     rowIndex
                 });
 
-                if (navigatedCell) {
+                if (true) {
                     targetCell = navigatedCell;
                 }

[NoCoverage] BlockStatement
src/smartRow.ts:226:36
                     rowIndex
                 });
 
-                if (navigatedCell) {
-                    targetCell = navigatedCell;
-                }
+                if (navigatedCell) {}
             }
             // --- Navigation Logic End ---

[NoCoverage] ConditionalExpression
src/smartRow.ts:234:17
 
             // Call beforeCellRead hook if configured.
             // Fires for BOTH columnOverrides.read and the default innerText path.
-            if (config.strategies.beforeCellRead) {
+            if (false) {
                 await config.strategies.beforeCellRead({
                     cell: targetCell,

[NoCoverage] ConditionalExpression
src/smartRow.ts:234:17
 
             // Call beforeCellRead hook if configured.
             // Fires for BOTH columnOverrides.read and the default innerText path.
-            if (config.strategies.beforeCellRead) {
+            if (true) {
                 await config.strategies.beforeCellRead({
                     cell: targetCell,

[NoCoverage] ObjectLiteral
src/smartRow.ts:235:56
             // Call beforeCellRead hook if configured.
             // Fires for BOTH columnOverrides.read and the default innerText path.
             if (config.strategies.beforeCellRead) {
-                await config.strategies.beforeCellRead({
-                    cell: targetCell,
-                    columnName: col,
-                    columnIndex: idx,
-                    row: rowLocator,
-                    page,
-                    root: rootLocator,
-                    getHeaderCell,
-                });
+                await config.strategies.beforeCellRead({});
             }
 

[NoCoverage] ConditionalExpression
src/smartRow.ts:246:17
                 });
             }
 
-            if (mapper) {
+            if (true) {
                 // Apply mapper
                 const mappedValue = await mapper(targetCell);

[NoCoverage] BlockStatement
src/smartRow.ts:246:25
                 });
             }
 
-            if (mapper) {
-                // Apply mapper
-                const mappedValue = await mapper(targetCell);
-                result[col] = mappedValue;
-            } else {
+            if (mapper) {} else {
                 // Default string extraction
                 const text = await targetCell.innerText();

[NoCoverage] BlockStatement
src/smartRow.ts:250:20
                 // Apply mapper
                 const mappedValue = await mapper(targetCell);
                 result[col] = mappedValue;
-            } else {
-                // Default string extraction
-                const text = await targetCell.innerText();
-                result[col] = (text || '').trim();
-            }
+            } else {}
         }
         return result as unknown as T;

[NoCoverage] LogicalOperator
src/smartRow.ts:253:32
             } else {
                 // Default string extraction
                 const text = await targetCell.innerText();
-                result[col] = (text || '').trim();
+                result[col] = (text && '').trim();
             }
         }

[NoCoverage] ConditionalExpression
src/smartRow.ts:253:32
             } else {
                 // Default string extraction
                 const text = await targetCell.innerText();
-                result[col] = (text || '').trim();
+                result[col] = (false).trim();
             }
         }

[NoCoverage] StringLiteral
src/smartRow.ts:260:26
     };
 
     smart.smartFill = async (data: Partial<T> | Record<string, any>, fillOptions?: FillOptions): Promise<void> => {
-        logDebug(config, 'info', 'Filling row', data);
+        logDebug(config, "", 'Filling row', data);
 
         for (const [colName, value] of Object.entries(data)) {

[NoCoverage] ConditionalExpression
src/smartRow.ts:263:17
         logDebug(config, 'info', 'Filling row', data);
 
         for (const [colName, value] of Object.entries(data)) {
-            if (value === undefined) continue;
+            if (false) continue;
 
             const colIdx = map.get(colName);

[NoCoverage] EqualityOperator
src/smartRow.ts:263:17
         logDebug(config, 'info', 'Filling row', data);
 
         for (const [colName, value] of Object.entries(data)) {
-            if (value === undefined) continue;
+            if (value !== undefined) continue;
 
             const colIdx = map.get(colName);

[NoCoverage] ConditionalExpression
src/smartRow.ts:266:17
             if (value === undefined) continue;
 
             const colIdx = map.get(colName);
-            if (colIdx === undefined) {
+            if (false) {
                 throw new Error(buildColumnNotFoundError(colName, Array.from(map.keys())));
             }

[NoCoverage] EqualityOperator
src/smartRow.ts:266:17
             if (value === undefined) continue;
 
             const colIdx = map.get(colName);
-            if (colIdx === undefined) {
+            if (colIdx !== undefined) {
                 throw new Error(buildColumnNotFoundError(colName, Array.from(map.keys())));
             }

[NoCoverage] OptionalChaining
src/smartRow.ts:281:36
                 rowIndex
             });
 
-            const columnOverride = config.columnOverrides?.[colName as keyof T];
+            const columnOverride = config.columnOverrides[colName as keyof T];
             if (columnOverride?.write) {
                 const cellLocator = smart.getCell(colName);

[NoCoverage] OptionalChaining
src/smartRow.ts:282:17
             });
 
             const columnOverride = config.columnOverrides?.[colName as keyof T];
-            if (columnOverride?.write) {
+            if (columnOverride.write) {
                 const cellLocator = smart.getCell(colName);
 

[NoCoverage] ConditionalExpression
src/smartRow.ts:282:17
             });
 
             const columnOverride = config.columnOverrides?.[colName as keyof T];
-            if (columnOverride?.write) {
+            if (true) {
                 const cellLocator = smart.getCell(colName);
 

[NoCoverage] ConditionalExpression
src/smartRow.ts:286:21
                 const cellLocator = smart.getCell(colName);
 
                 let currentValue;
-                if (columnOverride.read) {
+                if (false) {
                     currentValue = await columnOverride.read(cellLocator);
                 }

[NoCoverage] BlockStatement
src/smartRow.ts:286:42
                 const cellLocator = smart.getCell(colName);
 
                 let currentValue;
-                if (columnOverride.read) {
-                    currentValue = await columnOverride.read(cellLocator);
-                }
+                if (columnOverride.read) {}
 
                 await columnOverride.write({

[NoCoverage] BlockStatement
src/smartRow.ts:296:20
                     currentValue,
                     row: smart
                 });
-            } else {
-                const strategy = config.strategies.fill || FillStrategies.default;
-
-                logDebug(config, 'verbose', `Filling cell "${colName}" with value`, value);
-
-                await strategy({
-                    row: smart,
-                    columnName: colName,
-                    value,
-                    index: rowIndex ?? -1,
-                    page: rowLocator.page(),
-                    rootLocator,
-                    config,
-                    table: table as TableResult<T>,
-                    fillOptions
-                });
-            }
+            } else {}
 
             // Delay after filling

[NoCoverage] ConditionalExpression
src/smartRow.ts:297:34
                     row: smart
                 });
             } else {
-                const strategy = config.strategies.fill || FillStrategies.default;
+                const strategy = false;
 
                 logDebug(config, 'verbose', `Filling cell "${colName}" with value`, value);
