[NoCoverage] LogicalOperator
src/smartRow.ts:297:34
                     row: smart
                 });
             } else {
-                const strategy = config.strategies.fill || FillStrategies.default;
+                const strategy = config.strategies.fill && FillStrategies.default;
 
                 logDebug(config, 'verbose', `Filling cell "${colName}" with value`, value);

[NoCoverage] ObjectLiteral
src/smartRow.ts:301:32
 
                 logDebug(config, 'verbose', `Filling cell "${colName}" with value`, value);
 
-                await strategy({
-                    row: smart,
-                    columnName: colName,
-                    value,
-                    index: rowIndex ?? -1,
-                    page: rowLocator.page(),
-                    rootLocator,
-                    config,
-                    table: table as TableResult<T>,
-                    fillOptions
-                });
+                await strategy({});
             }
 

[NoCoverage] LogicalOperator
src/smartRow.ts:305:28
                     row: smart,
                     columnName: colName,
                     value,
-                    index: rowIndex ?? -1,
+                    index: rowIndex && -1,
                     page: rowLocator.page(),
                     rootLocator,

[NoCoverage] UnaryOperator
src/smartRow.ts:305:40
                     row: smart,
                     columnName: colName,
                     value,
-                    index: rowIndex ?? -1,
+                    index: rowIndex ?? +1,
                     page: rowLocator.page(),
                     rootLocator,

[NoCoverage] BlockStatement
src/smartRow.ts:322:37
     };
 
     smart.bringIntoView = async (): Promise<void> => {
-        if (rowIndex === undefined) {
-            throw new Error('Cannot bring row into view - row index is unknown. Use getRowByIndex() instead of getRow().');
-        }
+        if (rowIndex === undefined) {}
 
         const parentTable = smart.table as TableResult<T>;

[NoCoverage] ConditionalExpression
src/smartRow.ts:322:13
     };
 
     smart.bringIntoView = async (): Promise<void> => {
-        if (rowIndex === undefined) {
+        if (true) {
             throw new Error('Cannot bring row into view - row index is unknown. Use getRowByIndex() instead of getRow().');
         }

[NoCoverage] ConditionalExpression
src/smartRow.ts:329:13
         const parentTable = smart.table as TableResult<T>;
 
         // Cross-page Navigation: when goToPage exists use retry loop (supports windowed UIs); otherwise use path planner or goToFirst+goNext
-        if (tablePageIndex !== undefined && config.strategies.pagination) {
+        if (false) {
             const primitives = config.strategies.pagination as import('./types').PaginationPrimitives;
             const context = { root: rootLocator, config, page: rootLocator.page(), resolve };

[NoCoverage] ConditionalExpression
src/smartRow.ts:329:13
         const parentTable = smart.table as TableResult<T>;
 
         // Cross-page Navigation: when goToPage exists use retry loop (supports windowed UIs); otherwise use path planner or goToFirst+goNext
-        if (tablePageIndex !== undefined && config.strategies.pagination) {
+        if (true) {
             const primitives = config.strategies.pagination as import('./types').PaginationPrimitives;
             const context = { root: rootLocator, config, page: rootLocator.page(), resolve };

[NoCoverage] ObjectLiteral
src/smartRow.ts:331:29
         // Cross-page Navigation: when goToPage exists use retry loop (supports windowed UIs); otherwise use path planner or goToFirst+goNext
         if (tablePageIndex !== undefined && config.strategies.pagination) {
             const primitives = config.strategies.pagination as import('./types').PaginationPrimitives;
-            const context = { root: rootLocator, config, page: rootLocator.page(), resolve };
+            const context = {};
             const getCurrent = () => parentTable.currentPageIndex;
             const setCurrent = (n: number) => { parentTable.currentPageIndex = n; };

[NoCoverage] ArrowFunction
src/smartRow.ts:332:32
         if (tablePageIndex !== undefined && config.strategies.pagination) {
             const primitives = config.strategies.pagination as import('./types').PaginationPrimitives;
             const context = { root: rootLocator, config, page: rootLocator.page(), resolve };
-            const getCurrent = () => parentTable.currentPageIndex;
+            const getCurrent = () => undefined;
             const setCurrent = (n: number) => { parentTable.currentPageIndex = n; };
 

[NoCoverage] BlockStatement
src/smartRow.ts:333:47
             const primitives = config.strategies.pagination as import('./types').PaginationPrimitives;
             const context = { root: rootLocator, config, page: rootLocator.page(), resolve };
             const getCurrent = () => parentTable.currentPageIndex;
-            const setCurrent = (n: number) => { parentTable.currentPageIndex = n; };
+            const setCurrent = (n: number) => {};
 
             if (primitives.goToPage) {

[NoCoverage] ConditionalExpression
src/smartRow.ts:335:17
             const getCurrent = () => parentTable.currentPageIndex;
             const setCurrent = (n: number) => { parentTable.currentPageIndex = n; };
 
-            if (primitives.goToPage) {
+            if (true) {
                 logDebug(config, 'info', `bringIntoView: Navigating to page ${tablePageIndex} (goToPage retry loop)`);
                 await executeNavigationWithGoToPageRetry(tablePageIndex, primitives, context, getCurrent, setCurrent);

[NoCoverage] BlockStatement
src/smartRow.ts:335:38
             const getCurrent = () => parentTable.currentPageIndex;
             const setCurrent = (n: number) => { parentTable.currentPageIndex = n; };
 
-            if (primitives.goToPage) {
-                logDebug(config, 'info', `bringIntoView: Navigating to page ${tablePageIndex} (goToPage retry loop)`);
-                await executeNavigationWithGoToPageRetry(tablePageIndex, primitives, context, getCurrent, setCurrent);
-            } else {
+            if (primitives.goToPage) {} else {
                 const path = planNavigationPath(getCurrent(), tablePageIndex, primitives);
                 if (path.length > 0) {

[NoCoverage] ConditionalExpression
src/smartRow.ts:340:21
                 await executeNavigationWithGoToPageRetry(tablePageIndex, primitives, context, getCurrent, setCurrent);
             } else {
                 const path = planNavigationPath(getCurrent(), tablePageIndex, primitives);
-                if (path.length > 0) {
+                if (false) {
                     logDebug(config, 'info', `bringIntoView: Executing navigation path to page ${tablePageIndex} (${path.length} step(s))`);
                     await executeNavigationPath(path, primitives, context, getCurrent, setCurrent);

[NoCoverage] ConditionalExpression
src/smartRow.ts:340:21
                 await executeNavigationWithGoToPageRetry(tablePageIndex, primitives, context, getCurrent, setCurrent);
             } else {
                 const path = planNavigationPath(getCurrent(), tablePageIndex, primitives);
-                if (path.length > 0) {
+                if (true) {
                     logDebug(config, 'info', `bringIntoView: Executing navigation path to page ${tablePageIndex} (${path.length} step(s))`);
                     await executeNavigationPath(path, primitives, context, getCurrent, setCurrent);

[NoCoverage] BlockStatement
src/smartRow.ts:343:94
                 if (path.length > 0) {
                     logDebug(config, 'info', `bringIntoView: Executing navigation path to page ${tablePageIndex} (${path.length} step(s))`);
                     await executeNavigationPath(path, primitives, context, getCurrent, setCurrent);
-                } else if (primitives.goToFirst && primitives.goNext && tablePageIndex >= 0) {
-                    logDebug(config, 'info', `bringIntoView: going to first page and looping goNext until we reach page ${tablePageIndex}`);
-                    await primitives.goToFirst(context);
-                    for (let i = 0; i < tablePageIndex; i++) {
-                        const ok = await primitives.goNext(context);
-                        if (!ok) throw new Error(`bringIntoView: goNext failed before reaching page ${tablePageIndex}.`);
-                    }
-                    parentTable.currentPageIndex = tablePageIndex;
-                } else {
+                } else if (primitives.goToFirst && primitives.goNext && tablePageIndex >= 0) {} else {
                     throw new Error(`Cannot bring row on page ${tablePageIndex} into view: Row is on a different page and no backward pagination primitive found.`);

[NoCoverage] LogicalOperator
src/smartRow.ts:343:28
                 if (path.length > 0) {
                     logDebug(config, 'info', `bringIntoView: Executing navigation path to page ${tablePageIndex} (${path.length} step(s))`);
                     await executeNavigationPath(path, primitives, context, getCurrent, setCurrent);
-                } else if (primitives.goToFirst && primitives.goNext && tablePageIndex >= 0) {
+                } else if (primitives.goToFirst && primitives.goNext || tablePageIndex >= 0) {
                     logDebug(config, 'info', `bringIntoView: going to first page and looping goNext until we reach page ${tablePageIndex}`);
                     await primitives.goToFirst(context);

[NoCoverage] StringLiteral
src/smartRow.ts:344:46
                     logDebug(config, 'info', `bringIntoView: Executing navigation path to page ${tablePageIndex} (${path.length} step(s))`);
                     await executeNavigationPath(path, primitives, context, getCurrent, setCurrent);
                 } else if (primitives.goToFirst && primitives.goNext && tablePageIndex >= 0) {
-                    logDebug(config, 'info', `bringIntoView: going to first page and looping goNext until we reach page ${tablePageIndex}`);
+                    logDebug(config, 'info', ``);
                     await primitives.goToFirst(context);
                     for (let i = 0; i < tablePageIndex; i++) {

[NoCoverage] StringLiteral
src/smartRow.ts:344:38
                     logDebug(config, 'info', `bringIntoView: Executing navigation path to page ${tablePageIndex} (${path.length} step(s))`);
                     await executeNavigationPath(path, primitives, context, getCurrent, setCurrent);
                 } else if (primitives.goToFirst && primitives.goNext && tablePageIndex >= 0) {
-                    logDebug(config, 'info', `bringIntoView: going to first page and looping goNext until we reach page ${tablePageIndex}`);
+                    logDebug(config, "", `bringIntoView: going to first page and looping goNext until we reach page ${tablePageIndex}`);
                     await primitives.goToFirst(context);
                     for (let i = 0; i < tablePageIndex; i++) {

[NoCoverage] EqualityOperator
src/smartRow.ts:346:37
                 } else if (primitives.goToFirst && primitives.goNext && tablePageIndex >= 0) {
                     logDebug(config, 'info', `bringIntoView: going to first page and looping goNext until we reach page ${tablePageIndex}`);
                     await primitives.goToFirst(context);
-                    for (let i = 0; i < tablePageIndex; i++) {
+                    for (let i = 0; i >= tablePageIndex; i++) {
                         const ok = await primitives.goNext(context);
                         if (!ok) throw new Error(`bringIntoView: goNext failed before reaching page ${tablePageIndex}.`);

[NoCoverage] UpdateOperator
src/smartRow.ts:346:57
                 } else if (primitives.goToFirst && primitives.goNext && tablePageIndex >= 0) {
                     logDebug(config, 'info', `bringIntoView: going to first page and looping goNext until we reach page ${tablePageIndex}`);
                     await primitives.goToFirst(context);
-                    for (let i = 0; i < tablePageIndex; i++) {
+                    for (let i = 0; i < tablePageIndex; i--) {
                         const ok = await primitives.goNext(context);
                         if (!ok) throw new Error(`bringIntoView: goNext failed before reaching page ${tablePageIndex}.`);

[NoCoverage] ConditionalExpression
src/smartRow.ts:348:29
                     await primitives.goToFirst(context);
                     for (let i = 0; i < tablePageIndex; i++) {
                         const ok = await primitives.goNext(context);
-                        if (!ok) throw new Error(`bringIntoView: goNext failed before reaching page ${tablePageIndex}.`);
+                        if (true) throw new Error(`bringIntoView: goNext failed before reaching page ${tablePageIndex}.`);
                     }
                     parentTable.currentPageIndex = tablePageIndex;

[NoCoverage] BooleanLiteral
src/smartRow.ts:348:29
                     await primitives.goToFirst(context);
                     for (let i = 0; i < tablePageIndex; i++) {
                         const ok = await primitives.goNext(context);
-                        if (!ok) throw new Error(`bringIntoView: goNext failed before reaching page ${tablePageIndex}.`);
+                        if (ok) throw new Error(`bringIntoView: goNext failed before reaching page ${tablePageIndex}.`);
                     }
                     parentTable.currentPageIndex = tablePageIndex;
