[NoCoverage] ObjectLiteral
src/strategies/dedupe.ts:4:33
 
 import { DedupeStrategy } from '../types';
 
-export const DedupeStrategies = {
-    /**
-     * Deduplicates rows based on their vertical position (Y coordinate).
-     * Useful for virtualized tables where row DOM elements are reused but content changes.
-     * @param tolerance Pixel tolerance for position comparison (default: 2)
-     */
-    byTopPosition: (tolerance = 2): DedupeStrategy => async (row) => {
-        const box = await row.boundingBox();
-        if (!box) return 'unknown';
-        // Round to nearest tolerance
-        const y = Math.round(box.y / tolerance) * tolerance;
-        return `pos_${y}`;
-    }
-};
+export const DedupeStrategies = {};
 

[NoCoverage] BlockStatement
src/strategies/dedupe.ts:10:70
      * Useful for virtualized tables where row DOM elements are reused but content changes.
      * @param tolerance Pixel tolerance for position comparison (default: 2)
      */
-    byTopPosition: (tolerance = 2): DedupeStrategy => async (row) => {
-        const box = await row.boundingBox();
-        if (!box) return 'unknown';
-        // Round to nearest tolerance
-        const y = Math.round(box.y / tolerance) * tolerance;
-        return `pos_${y}`;
-    }
+    byTopPosition: (tolerance = 2): DedupeStrategy => async (row) => {}
 };
 

[NoCoverage] ArrowFunction
src/strategies/dedupe.ts:10:20
      * Useful for virtualized tables where row DOM elements are reused but content changes.
      * @param tolerance Pixel tolerance for position comparison (default: 2)
      */
-    byTopPosition: (tolerance = 2): DedupeStrategy => async (row) => {
-        const box = await row.boundingBox();
-        if (!box) return 'unknown';
-        // Round to nearest tolerance
-        const y = Math.round(box.y / tolerance) * tolerance;
-        return `pos_${y}`;
-    }
+    byTopPosition: () => undefined
 };
 

[NoCoverage] ConditionalExpression
src/strategies/dedupe.ts:12:13
      */
     byTopPosition: (tolerance = 2): DedupeStrategy => async (row) => {
         const box = await row.boundingBox();
-        if (!box) return 'unknown';
+        if (true) return 'unknown';
         // Round to nearest tolerance
         const y = Math.round(box.y / tolerance) * tolerance;

[NoCoverage] BooleanLiteral
src/strategies/dedupe.ts:12:13
      */
     byTopPosition: (tolerance = 2): DedupeStrategy => async (row) => {
         const box = await row.boundingBox();
-        if (!box) return 'unknown';
+        if (box) return 'unknown';
         // Round to nearest tolerance
         const y = Math.round(box.y / tolerance) * tolerance;

[NoCoverage] ArithmeticOperator
src/strategies/dedupe.ts:14:30
         const box = await row.boundingBox();
         if (!box) return 'unknown';
         // Round to nearest tolerance
-        const y = Math.round(box.y / tolerance) * tolerance;
+        const y = Math.round(box.y * tolerance) * tolerance;
         return `pos_${y}`;
     }

[NoCoverage] ArithmeticOperator
src/strategies/dedupe.ts:14:19
         const box = await row.boundingBox();
         if (!box) return 'unknown';
         // Round to nearest tolerance
-        const y = Math.round(box.y / tolerance) * tolerance;
+        const y = Math.round(box.y / tolerance) / tolerance;
         return `pos_${y}`;
     }

[NoCoverage] StringLiteral
src/strategies/dedupe.ts:15:16
         if (!box) return 'unknown';
         // Round to nearest tolerance
         const y = Math.round(box.y / tolerance) * tolerance;
-        return `pos_${y}`;
+        return ``;
     }
 };
