[NoCoverage] OptionalChaining
src/strategies/fill.ts:13:32
         const cell = row.getCell(columnName);
 
         // 1. Check for Unified Column Override
-        const columnOverride = config?.columnOverrides?.[columnName as keyof any];
+        const columnOverride = config.columnOverrides?.[columnName as keyof any];
         if (columnOverride?.write) {
             let currentValue;

[NoCoverage] OptionalChaining
src/strategies/fill.ts:13:32
         const cell = row.getCell(columnName);
 
         // 1. Check for Unified Column Override
-        const columnOverride = config?.columnOverrides?.[columnName as keyof any];
+        const columnOverride = config?.columnOverrides[columnName as keyof any];
         if (columnOverride?.write) {
             let currentValue;

[NoCoverage] ConditionalExpression
src/strategies/fill.ts:14:13
 
         // 1. Check for Unified Column Override
         const columnOverride = config?.columnOverrides?.[columnName as keyof any];
-        if (columnOverride?.write) {
+        if (true) {
             let currentValue;
             // Auto-sync: If read exists, fetch current state first

[NoCoverage] ConditionalExpression
src/strategies/fill.ts:14:13
 
         // 1. Check for Unified Column Override
         const columnOverride = config?.columnOverrides?.[columnName as keyof any];
-        if (columnOverride?.write) {
+        if (false) {
             let currentValue;
             // Auto-sync: If read exists, fetch current state first

[NoCoverage] ConditionalExpression
src/strategies/fill.ts:17:17
         if (columnOverride?.write) {
             let currentValue;
             // Auto-sync: If read exists, fetch current state first
-            if (columnOverride.read) {
+            if (false) {
                 currentValue = await columnOverride.read(cell);
             }

[NoCoverage] ConditionalExpression
src/strategies/fill.ts:17:17
         if (columnOverride?.write) {
             let currentValue;
             // Auto-sync: If read exists, fetch current state first
-            if (columnOverride.read) {
+            if (true) {
                 currentValue = await columnOverride.read(cell);
             }

[NoCoverage] ObjectLiteral
src/strategies/fill.ts:20:40
             if (columnOverride.read) {
                 currentValue = await columnOverride.read(cell);
             }
-            await columnOverride.write({
-                cell,
-                targetValue: value,
-                currentValue,
-                row
-            });
+            await columnOverride.write({});
             return;
         }

[NoCoverage] ConditionalExpression
src/strategies/fill.ts:31:13
 
         // Use custom input mapper for this column if provided, otherwise auto-detect
         let inputLocator: Locator;
-        if (fillOptions?.inputMappers?.[columnName]) {
+        if (true) {
             inputLocator = fillOptions.inputMappers[columnName](cell);
         } else {

[NoCoverage] BlockStatement
src/strategies/fill.ts:31:54
 
         // Use custom input mapper for this column if provided, otherwise auto-detect
         let inputLocator: Locator;
-        if (fillOptions?.inputMappers?.[columnName]) {
-            inputLocator = fillOptions.inputMappers[columnName](cell);
-        } else {
+        if (fillOptions?.inputMappers?.[columnName]) {} else {
             // Auto-detect input type
             // Check for text input

[NoCoverage] StringLiteral
src/strategies/fill.ts:36:44
         } else {
             // Auto-detect input type
             // Check for text input
-            const textInput = cell.locator('input[type="text"], input:not([type]), textarea').first();
+            const textInput = cell.locator("").first();
             const textInputCount = await textInput.count().catch(() => 0);
 

[NoCoverage] ArrowFunction
src/strategies/fill.ts:37:66
             // Auto-detect input type
             // Check for text input
             const textInput = cell.locator('input[type="text"], input:not([type]), textarea').first();
-            const textInputCount = await textInput.count().catch(() => 0);
+            const textInputCount = await textInput.count().catch(() => undefined);
 
             // Check for select

[NoCoverage] ArrowFunction
src/strategies/fill.ts:41:60
 
             // Check for select
             const select = cell.locator('select').first();
-            const selectCount = await select.count().catch(() => 0);
+            const selectCount = await select.count().catch(() => undefined);
 
             // Check for checkbox/radio

[NoCoverage] ArrowFunction
src/strategies/fill.ts:45:64
 
             // Check for checkbox/radio
             const checkbox = cell.locator('input[type="checkbox"], input[type="radio"], [role="checkbox"]').first();
-            const checkboxCount = await checkbox.count().catch(() => 0);
+            const checkboxCount = await checkbox.count().catch(() => undefined);
 
             // Check for contenteditable or div-based inputs

[NoCoverage] ArrowFunction
src/strategies/fill.ts:49:78
 
             // Check for contenteditable or div-based inputs
             const contentEditable = cell.locator('[contenteditable="true"]').first();
-            const contentEditableCount = await contentEditable.count().catch(() => 0);
+            const contentEditableCount = await contentEditable.count().catch(() => undefined);
 
             // Determine which input to use (prioritize by commonality)

[NoCoverage] EqualityOperator
src/strategies/fill.ts:52:60
             const contentEditableCount = await contentEditable.count().catch(() => 0);
 
             // Determine which input to use (prioritize by commonality)
-            if (textInputCount > 0 && selectCount === 0 && checkboxCount === 0) {
+            if (textInputCount > 0 && selectCount === 0 && checkboxCount !== 0) {
                 inputLocator = textInput;
             } else if (selectCount > 0) {

[NoCoverage] LogicalOperator
src/strategies/fill.ts:52:17
             const contentEditableCount = await contentEditable.count().catch(() => 0);
 
             // Determine which input to use (prioritize by commonality)
-            if (textInputCount > 0 && selectCount === 0 && checkboxCount === 0) {
+            if (textInputCount > 0 || selectCount === 0 && checkboxCount === 0) {
                 inputLocator = textInput;
             } else if (selectCount > 0) {

[NoCoverage] BlockStatement
src/strategies/fill.ts:54:41
             // Determine which input to use (prioritize by commonality)
             if (textInputCount > 0 && selectCount === 0 && checkboxCount === 0) {
                 inputLocator = textInput;
-            } else if (selectCount > 0) {
-                inputLocator = select;
-            } else if (checkboxCount > 0) {
+            } else if (selectCount > 0) {} else if (checkboxCount > 0) {
                 inputLocator = checkbox;
             } else if (contentEditableCount > 0) {

[NoCoverage] EqualityOperator
src/strategies/fill.ts:54:24
             // Determine which input to use (prioritize by commonality)
             if (textInputCount > 0 && selectCount === 0 && checkboxCount === 0) {
                 inputLocator = textInput;
-            } else if (selectCount > 0) {
+            } else if (selectCount >= 0) {
                 inputLocator = select;
             } else if (checkboxCount > 0) {

[NoCoverage] ConditionalExpression
src/strategies/fill.ts:56:24
                 inputLocator = textInput;
             } else if (selectCount > 0) {
                 inputLocator = select;
-            } else if (checkboxCount > 0) {
+            } else if (false) {
                 inputLocator = checkbox;
             } else if (contentEditableCount > 0) {

[NoCoverage] EqualityOperator
src/strategies/fill.ts:56:24
                 inputLocator = textInput;
             } else if (selectCount > 0) {
                 inputLocator = select;
-            } else if (checkboxCount > 0) {
+            } else if (checkboxCount <= 0) {
                 inputLocator = checkbox;
             } else if (contentEditableCount > 0) {

[NoCoverage] BlockStatement
src/strategies/fill.ts:58:50
                 inputLocator = select;
             } else if (checkboxCount > 0) {
                 inputLocator = checkbox;
-            } else if (contentEditableCount > 0) {
-                inputLocator = contentEditable;
-            } else if (textInputCount > 0) {
+            } else if (contentEditableCount > 0) {} else if (textInputCount > 0) {
                 // Fallback to text input even if others exist
                 inputLocator = textInput;

[NoCoverage] ConditionalExpression
src/strategies/fill.ts:58:24
                 inputLocator = select;
             } else if (checkboxCount > 0) {
                 inputLocator = checkbox;
-            } else if (contentEditableCount > 0) {
+            } else if (false) {
                 inputLocator = contentEditable;
             } else if (textInputCount > 0) {

[NoCoverage] ConditionalExpression
src/strategies/fill.ts:60:24
                 inputLocator = checkbox;
             } else if (contentEditableCount > 0) {
                 inputLocator = contentEditable;
-            } else if (textInputCount > 0) {
+            } else if (true) {
                 // Fallback to text input even if others exist
                 inputLocator = textInput;

[NoCoverage] EqualityOperator
src/strategies/fill.ts:60:24
                 inputLocator = checkbox;
             } else if (contentEditableCount > 0) {
                 inputLocator = contentEditable;
-            } else if (textInputCount > 0) {
+            } else if (textInputCount <= 0) {
                 // Fallback to text input even if others exist
                 inputLocator = textInput;

[NoCoverage] BlockStatement
src/strategies/fill.ts:63:20
             } else if (textInputCount > 0) {
                 // Fallback to text input even if others exist
                 inputLocator = textInput;
-            } else {
-                // No input found - try to click the cell itself (might trigger an editor)
-                inputLocator = cell;
-            }
+            } else {}
         }
 

[NoCoverage] ArrowFunction
src/strategies/fill.ts:70:54
         }
 
         // Fill based on value type and input type
-        const inputTag = await inputLocator.evaluate((el: Element) => el.tagName.toLowerCase()).catch(() => 'unknown');
+        const inputTag = await inputLocator.evaluate(() => undefined).catch(() => 'unknown');
         const inputType = await inputLocator.getAttribute('type').catch(() => null);
         const isContentEditable = await inputLocator.getAttribute('contenteditable').catch(() => null);

[NoCoverage] MethodExpression
src/strategies/fill.ts:70:71
         }
 
         // Fill based on value type and input type
-        const inputTag = await inputLocator.evaluate((el: Element) => el.tagName.toLowerCase()).catch(() => 'unknown');
+        const inputTag = await inputLocator.evaluate((el: Element) => el.tagName.toUpperCase()).catch(() => 'unknown');
         const inputType = await inputLocator.getAttribute('type').catch(() => null);
         const isContentEditable = await inputLocator.getAttribute('contenteditable').catch(() => null);

[NoCoverage] ArrowFunction
src/strategies/fill.ts:71:73
 
         // Fill based on value type and input type
         const inputTag = await inputLocator.evaluate((el: Element) => el.tagName.toLowerCase()).catch(() => 'unknown');
-        const inputType = await inputLocator.getAttribute('type').catch(() => null);
+        const inputType = await inputLocator.getAttribute('type').catch(() => undefined);
         const isContentEditable = await inputLocator.getAttribute('contenteditable').catch(() => null);
 

[NoCoverage] ArrowFunction
src/strategies/fill.ts:72:92
         // Fill based on value type and input type
         const inputTag = await inputLocator.evaluate((el: Element) => el.tagName.toLowerCase()).catch(() => 'unknown');
         const inputType = await inputLocator.getAttribute('type').catch(() => null);
-        const isContentEditable = await inputLocator.getAttribute('contenteditable').catch(() => null);
+        const isContentEditable = await inputLocator.getAttribute('contenteditable').catch(() => undefined);
 
         // console.log(`[SmartTable] Filling "${columnName}" with value "${value}" (input: ${inputTag}, type: ${inputType})`);

[NoCoverage] ConditionalExpression
src/strategies/fill.ts:76:41
 
         // console.log(`[SmartTable] Filling "${columnName}" with value "${value}" (input: ${inputTag}, type: ${inputType})`);
 
-        if (inputType === 'checkbox' || inputType === 'radio') {
+        if (inputType === 'checkbox' || false) {
             // Boolean value for checkbox/radio
             const shouldBeChecked = Boolean(value);

[NoCoverage] ConditionalExpression
src/strategies/fill.ts:76:13
 
         // console.log(`[SmartTable] Filling "${columnName}" with value "${value}" (input: ${inputTag}, type: ${inputType})`);
 
-        if (inputType === 'checkbox' || inputType === 'radio') {
+        if (true) {
             // Boolean value for checkbox/radio
             const shouldBeChecked = Boolean(value);

[NoCoverage] BooleanLiteral
src/strategies/fill.ts:79:74
         if (inputType === 'checkbox' || inputType === 'radio') {
             // Boolean value for checkbox/radio
             const shouldBeChecked = Boolean(value);
-            const isChecked = await inputLocator.isChecked().catch(() => false);
+            const isChecked = await inputLocator.isChecked().catch(() => true);
             if (isChecked !== shouldBeChecked) {
                 await inputLocator.click();

[NoCoverage] ArrowFunction
src/strategies/fill.ts:79:68
         if (inputType === 'checkbox' || inputType === 'radio') {
             // Boolean value for checkbox/radio
             const shouldBeChecked = Boolean(value);
-            const isChecked = await inputLocator.isChecked().catch(() => false);
+            const isChecked = await inputLocator.isChecked().catch(() => undefined);
             if (isChecked !== shouldBeChecked) {
                 await inputLocator.click();

[NoCoverage] ConditionalExpression
src/strategies/fill.ts:80:17
             // Boolean value for checkbox/radio
             const shouldBeChecked = Boolean(value);
             const isChecked = await inputLocator.isChecked().catch(() => false);
-            if (isChecked !== shouldBeChecked) {
+            if (true) {
                 await inputLocator.click();
             }

[NoCoverage] ConditionalExpression
src/strategies/fill.ts:80:17
             // Boolean value for checkbox/radio
             const shouldBeChecked = Boolean(value);
             const isChecked = await inputLocator.isChecked().catch(() => false);
-            if (isChecked !== shouldBeChecked) {
+            if (false) {
                 await inputLocator.click();
             }

[NoCoverage] ConditionalExpression
src/strategies/fill.ts:83:20
             if (isChecked !== shouldBeChecked) {
                 await inputLocator.click();
             }
-        } else if (inputTag === 'select') {
+        } else if (true) {
             // Select dropdown
             await inputLocator.selectOption(String(value));

[NoCoverage] BlockStatement
src/strategies/fill.ts:83:43
             if (isChecked !== shouldBeChecked) {
                 await inputLocator.click();
             }
-        } else if (inputTag === 'select') {
-            // Select dropdown
-            await inputLocator.selectOption(String(value));
-        } else if (isContentEditable === 'true') {
+        } else if (inputTag === 'select') {} else if (isContentEditable === 'true') {
             // Contenteditable div
             await inputLocator.click();

[NoCoverage] EqualityOperator
src/strategies/fill.ts:86:20
         } else if (inputTag === 'select') {
             // Select dropdown
             await inputLocator.selectOption(String(value));
-        } else if (isContentEditable === 'true') {
+        } else if (isContentEditable !== 'true') {
             // Contenteditable div
             await inputLocator.click();

[NoCoverage] ConditionalExpression
src/strategies/fill.ts:86:20
         } else if (inputTag === 'select') {
             // Select dropdown
             await inputLocator.selectOption(String(value));
-        } else if (isContentEditable === 'true') {
+        } else if (false) {
             // Contenteditable div
             await inputLocator.click();

[NoCoverage] BlockStatement
src/strategies/fill.ts:90:16
             // Contenteditable div
             await inputLocator.click();
             await inputLocator.fill(String(value));
-        } else {
-            // Text input, textarea, or generic
-            await inputLocator.fill(String(value));
-        }
+        } else {}
     }
 };
