[Killed] BlockStatement
src/strategies/headers.ts:14:87
      * Default strategy: Returns only the headers currently visible in the DOM.
      * This is fast but won't find virtualized columns off-screen.
      */
-    visible: async ({ config, resolve, root }: StrategyContext): Promise<string[]> => {
-        const headerLoc = resolve(config.headerSelector as Selector, root);
-        try {
-            // Wait for at least one header to be visible
-            await headerLoc.first().waitFor({ state: 'visible', timeout: 3000 });
-        } catch (e) {
-            // Ignore hydration/timeout issues, return what we have
-        }
-
-        const texts = await headerLoc.allInnerTexts();
-        return texts.map(t => t.trim());
-    },
+    visible: async ({ config, resolve, root }: StrategyContext): Promise<string[]> => {},
 
     /**
killedBy: HeaderStrategies.visible returns trimmed header texts when waitFor succeeds
statusReason: expected undefined to deeply equal [ 'A', 'B' ]

[Killed] BlockStatement
src/strategies/headers.ts:16:13
      */
     visible: async ({ config, resolve, root }: StrategyContext): Promise<string[]> => {
         const headerLoc = resolve(config.headerSelector as Selector, root);
-        try {
-            // Wait for at least one header to be visible
-            await headerLoc.first().waitFor({ state: 'visible', timeout: 3000 });
-        } catch (e) {
+        try {} catch (e) {
             // Ignore hydration/timeout issues, return what we have
         }
killedBy: HeaderStrategies.visible returns trimmed header texts when waitFor succeeds
statusReason: expected "vi.fn()" to be called at least once

[NoCoverage] BlockStatement
src/strategies/headers.ts:47:80
             let currentHeaders = await getVisible();
             currentHeaders.forEach(h => collectedHeaders.add(h));
 
-            const scrollerHandle = await root.evaluateHandle((el, selector) => {
-                if (selector && el.matches(selector)) return el;
-                // Try finding common scrollable containers or fallback to root
-                const effectiveSelector = selector || '.dvn-scroller, .rdg-viewport, [role="grid"]';
-                const ancestor = el.closest(effectiveSelector);
-                if (ancestor) return ancestor;
-                const child = el.querySelector(effectiveSelector);
-                if (child) return child;
-                return el;
-            }, options?.selector);
+            const scrollerHandle = await root.evaluateHandle((el, selector) => {}, options?.selector);
 
             const isScrollerFound = await scrollerHandle.evaluate(el => !!el);

[NoCoverage] ConditionalExpression
src/strategies/headers.ts:50:43
             const scrollerHandle = await root.evaluateHandle((el, selector) => {
                 if (selector && el.matches(selector)) return el;
                 // Try finding common scrollable containers or fallback to root
-                const effectiveSelector = selector || '.dvn-scroller, .rdg-viewport, [role="grid"]';
+                const effectiveSelector = false;
                 const ancestor = el.closest(effectiveSelector);
                 if (ancestor) return ancestor;

[NoCoverage] ConditionalExpression
src/strategies/headers.ts:50:43
             const scrollerHandle = await root.evaluateHandle((el, selector) => {
                 if (selector && el.matches(selector)) return el;
                 // Try finding common scrollable containers or fallback to root
-                const effectiveSelector = selector || '.dvn-scroller, .rdg-viewport, [role="grid"]';
+                const effectiveSelector = true;
                 const ancestor = el.closest(effectiveSelector);
                 if (ancestor) return ancestor;

[NoCoverage] ConditionalExpression
src/strategies/headers.ts:54:21
                 const ancestor = el.closest(effectiveSelector);
                 if (ancestor) return ancestor;
                 const child = el.querySelector(effectiveSelector);
-                if (child) return child;
+                if (true) return child;
                 return el;
             }, options?.selector);

[NoCoverage] ConditionalExpression
src/strategies/headers.ts:54:21
                 const ancestor = el.closest(effectiveSelector);
                 if (ancestor) return ancestor;
                 const child = el.querySelector(effectiveSelector);
-                if (child) return child;
+                if (false) return child;
                 return el;
             }, options?.selector);

[NoCoverage] OptionalChaining
src/strategies/headers.ts:56:16
                 const child = el.querySelector(effectiveSelector);
                 if (child) return child;
                 return el;
-            }, options?.selector);
+            }, options.selector);
 
             const isScrollerFound = await scrollerHandle.evaluate(el => !!el);

[NoCoverage] ConditionalExpression
src/strategies/headers.ts:60:17
 
             const isScrollerFound = await scrollerHandle.evaluate(el => !!el);
 
-            if (isScrollerFound) {
+            if (true) {
                 await scrollerHandle.evaluate(el => el!.scrollLeft = 0);
                 await page.waitForTimeout(200);

[NoCoverage] EqualityOperator
src/strategies/headers.ts:64:33
                 await scrollerHandle.evaluate(el => el!.scrollLeft = 0);
                 await page.waitForTimeout(200);
 
-                for (let i = 0; i < limit; i++) {
+                for (let i = 0; i <= limit; i++) {
                     const sizeBefore = collectedHeaders.size;
 

[NoCoverage] BlockStatement
src/strategies/headers.ts:64:49
                 await scrollerHandle.evaluate(el => el!.scrollLeft = 0);
                 await page.waitForTimeout(200);
 
-                for (let i = 0; i < limit; i++) {
-                    const sizeBefore = collectedHeaders.size;
-
-                    await scrollerHandle.evaluate((el, amount) => el!.scrollLeft += amount, scrollAmount);
-                    await page.waitForTimeout(300);
-
-                    const newHeaders = await getVisible();
-                    newHeaders.forEach(h => collectedHeaders.add(h));
-
-                    if (collectedHeaders.size === sizeBefore) {
-                        await scrollerHandle.evaluate((el, amount) => el!.scrollLeft += amount, scrollAmount);
-                        await page.waitForTimeout(300);
-                        const retryHeaders = await getVisible();
-                        retryHeaders.forEach(h => collectedHeaders.add(h));
-                        if (collectedHeaders.size === sizeBefore) break;
-                    }
-                }
+                for (let i = 0; i < limit; i++) {}
             } else {
                 console.warn("HeaderStrategies.horizontalScroll: Could not find scroller. Returning visible headers.");

[NoCoverage] BlockStatement
src/strategies/headers.ts:73:63
                     const newHeaders = await getVisible();
                     newHeaders.forEach(h => collectedHeaders.add(h));
 
-                    if (collectedHeaders.size === sizeBefore) {
-                        await scrollerHandle.evaluate((el, amount) => el!.scrollLeft += amount, scrollAmount);
-                        await page.waitForTimeout(300);
-                        const retryHeaders = await getVisible();
-                        retryHeaders.forEach(h => collectedHeaders.add(h));
-                        if (collectedHeaders.size === sizeBefore) break;
-                    }
+                    if (collectedHeaders.size === sizeBefore) {}
                 }
             } else {

[NoCoverage] ConditionalExpression
src/strategies/headers.ts:78:29
                         await page.waitForTimeout(300);
                         const retryHeaders = await getVisible();
                         retryHeaders.forEach(h => collectedHeaders.add(h));
-                        if (collectedHeaders.size === sizeBefore) break;
+                        if (false) break;
                     }
                 }

[NoCoverage] BlockStatement
src/strategies/headers.ts:81:20
                         if (collectedHeaders.size === sizeBefore) break;
                     }
                 }
-            } else {
-                console.warn("HeaderStrategies.horizontalScroll: Could not find scroller. Returning visible headers.");
-            }
+            } else {}
 
             await scrollerHandle.evaluate(el => el!.scrollLeft = 0);

[NoCoverage] StringLiteral
src/strategies/headers.ts:82:30
                     }
                 }
             } else {
-                console.warn("HeaderStrategies.horizontalScroll: Could not find scroller. Returning visible headers.");
+                console.warn("");
             }
 
