[NoCoverage] ObjectLiteral
src/strategies/loading.ts:11:12
     /**
      * Strategies for detecting if the entire table is loading.
      */
-    Table: {
-        /**
-         * Checks if a global spinner or loading overlay is visible.
-         * @param selector Selector for the loading indicator (e.g. '.loading-spinner')
-         */
-        hasSpinner: (selector: string = '.loading-spinner') => async ({ root }: TableContext): Promise<boolean> => {
-            // Check if spinner exists and is visible within the table wrapper or page
-            const spinner = root.locator(selector).first();
-            try {
-                return await spinner.isVisible();
-            } catch {
-                return false;
-            }
-        },
-
-        /**
-         * Custom function to determine table loading state.
-         */
-        custom: (fn: (context: TableContext) => Promise<boolean>) => fn,
-
-        /**
-         * Assume table is never loading (default).
-         */
-        never: async () => false
-    },
+    Table: {},
 
     /**

[NoCoverage] BlockStatement
src/strategies/loading.ts:16:116
          * Checks if a global spinner or loading overlay is visible.
          * @param selector Selector for the loading indicator (e.g. '.loading-spinner')
          */
-        hasSpinner: (selector: string = '.loading-spinner') => async ({ root }: TableContext): Promise<boolean> => {
-            // Check if spinner exists and is visible within the table wrapper or page
-            const spinner = root.locator(selector).first();
-            try {
-                return await spinner.isVisible();
-            } catch {
-                return false;
-            }
-        },
+        hasSpinner: (selector: string = '.loading-spinner') => async ({ root }: TableContext): Promise<boolean> => {},
 
         /**

[NoCoverage] ArrowFunction
src/strategies/loading.ts:16:21
          * Checks if a global spinner or loading overlay is visible.
          * @param selector Selector for the loading indicator (e.g. '.loading-spinner')
          */
-        hasSpinner: (selector: string = '.loading-spinner') => async ({ root }: TableContext): Promise<boolean> => {
-            // Check if spinner exists and is visible within the table wrapper or page
-            const spinner = root.locator(selector).first();
-            try {
-                return await spinner.isVisible();
-            } catch {
-                return false;
-            }
-        },
+        hasSpinner: () => undefined,
 
         /**

[NoCoverage] BlockStatement
src/strategies/loading.ts:19:17
         hasSpinner: (selector: string = '.loading-spinner') => async ({ root }: TableContext): Promise<boolean> => {
             // Check if spinner exists and is visible within the table wrapper or page
             const spinner = root.locator(selector).first();
-            try {
-                return await spinner.isVisible();
-            } catch {
+            try {} catch {
                 return false;
             }

[NoCoverage] BlockStatement
src/strategies/loading.ts:21:21
             const spinner = root.locator(selector).first();
             try {
                 return await spinner.isVisible();
-            } catch {
-                return false;
-            }
+            } catch {}
         },
 

[NoCoverage] ArrowFunction
src/strategies/loading.ts:29:17
         /**
          * Custom function to determine table loading state.
          */
-        custom: (fn: (context: TableContext) => Promise<boolean>) => fn,
+        custom: () => undefined,
 
         /**

[NoCoverage] ArrowFunction
src/strategies/loading.ts:34:16
         /**
          * Assume table is never loading (default).
          */
-        never: async () => false
+        never: () => undefined
     },
 

[NoCoverage] BooleanLiteral
src/strategies/loading.ts:34:28
         /**
          * Assume table is never loading (default).
          */
-        never: async () => false
+        never: async () => true
     },
 

[NoCoverage] BlockStatement
src/strategies/loading.ts:45:98
          * Checks if the row contains a specific class indicating it's a skeleton/loading row.
          * @param className Class name acting as the loading indicator (default: 'skeleton')
          */
-        hasClass: (className: string = 'skeleton') => async (row: SmartRow): Promise<boolean> => {
-            const cls = await row.getAttribute('class');
-            return cls ? cls.includes(className) : false;
-        },
+        hasClass: (className: string = 'skeleton') => async (row: SmartRow): Promise<boolean> => {},
 
         /**

[NoCoverage] ArrowFunction
src/strategies/loading.ts:45:19
          * Checks if the row contains a specific class indicating it's a skeleton/loading row.
          * @param className Class name acting as the loading indicator (default: 'skeleton')
          */
-        hasClass: (className: string = 'skeleton') => async (row: SmartRow): Promise<boolean> => {
-            const cls = await row.getAttribute('class');
-            return cls ? cls.includes(className) : false;
-        },
+        hasClass: () => undefined,
 
         /**

[NoCoverage] BooleanLiteral
src/strategies/loading.ts:47:52
          */
         hasClass: (className: string = 'skeleton') => async (row: SmartRow): Promise<boolean> => {
             const cls = await row.getAttribute('class');
-            return cls ? cls.includes(className) : false;
+            return cls ? cls.includes(className) : true;
         },
 

[NoCoverage] ArrowFunction
src/strategies/loading.ts:53:18
         /**
          * Checks if the row's text content matches a "Loading..." string or regex.
          */
-        hasText: (text: string | RegExp = 'Loading...') => async (row: SmartRow): Promise<boolean> => {
-            const content = await row.innerText();
-            if (typeof text === 'string') return content.includes(text);
-            return text.test(content);
-        },
+        hasText: () => undefined,
 
         /**

[NoCoverage] BlockStatement
src/strategies/loading.ts:53:103
         /**
          * Checks if the row's text content matches a "Loading..." string or regex.
          */
-        hasText: (text: string | RegExp = 'Loading...') => async (row: SmartRow): Promise<boolean> => {
-            const content = await row.innerText();
-            if (typeof text === 'string') return content.includes(text);
-            return text.test(content);
-        },
+        hasText: (text: string | RegExp = 'Loading...') => async (row: SmartRow): Promise<boolean> => {},
 
         /**

[NoCoverage] ConditionalExpression
src/strategies/loading.ts:55:17
          */
         hasText: (text: string | RegExp = 'Loading...') => async (row: SmartRow): Promise<boolean> => {
             const content = await row.innerText();
-            if (typeof text === 'string') return content.includes(text);
+            if (false) return content.includes(text);
             return text.test(content);
         },

[NoCoverage] EqualityOperator
src/strategies/loading.ts:55:17
          */
         hasText: (text: string | RegExp = 'Loading...') => async (row: SmartRow): Promise<boolean> => {
             const content = await row.innerText();
-            if (typeof text === 'string') return content.includes(text);
+            if (typeof text !== 'string') return content.includes(text);
             return text.test(content);
         },

[NoCoverage] ArrowFunction
src/strategies/loading.ts:63:24
          * Checks if the row has any cell with empty/falsy content (if strict).
          * Useful if rows render with empty cells before populating.
          */
-        hasEmptyCells: () => async (row: SmartRow): Promise<boolean> => {
-            // Logic: Get all cells, check if any are empty.
-            // Note: This might be expensive if done for every row check.
-            // Simplified: check if InnerText is empty or very short?
-            const text = await row.innerText();
-            return !text.trim();
-        },
+        hasEmptyCells: () => undefined,
 
         /**

[NoCoverage] BlockStatement
src/strategies/loading.ts:63:73
          * Checks if the row has any cell with empty/falsy content (if strict).
          * Useful if rows render with empty cells before populating.
          */
-        hasEmptyCells: () => async (row: SmartRow): Promise<boolean> => {
-            // Logic: Get all cells, check if any are empty.
-            // Note: This might be expensive if done for every row check.
-            // Simplified: check if InnerText is empty or very short?
-            const text = await row.innerText();
-            return !text.trim();
-        },
+        hasEmptyCells: () => async (row: SmartRow): Promise<boolean> => {},
 
         /**

[NoCoverage] MethodExpression
src/strategies/loading.ts:68:21
             // Note: This might be expensive if done for every row check.
             // Simplified: check if InnerText is empty or very short?
             const text = await row.innerText();
-            return !text.trim();
+            return !text;
         },
 

[NoCoverage] BooleanLiteral
src/strategies/loading.ts:68:20
             // Note: This might be expensive if done for every row check.
             // Simplified: check if InnerText is empty or very short?
             const text = await row.innerText();
-            return !text.trim();
+            return text.trim();
         },
 

[NoCoverage] BlockStatement
src/strategies/loading.ts:84:96
          * Checks if the headers are stable (count and text) for a specified duration.
          * @param duration Duration in ms for headers to remain unchanged to be considered stable (default: 200).
          */
-        stable: (duration: number = 200) => async (context: TableContext): Promise<boolean> => {
-            const { config, resolve, root } = context;
-            const getHeaderTexts = async () => {
-                const headers = await resolve(config.headerSelector as Selector, root).all();
-                return Promise.all(headers.map(h => h.innerText()));
-            };
-
-            const initial = await getHeaderTexts();
-            // Wait for duration
-            await context.page.waitForTimeout(duration);
-            const current = await getHeaderTexts();
-
-            if (initial.length !== current.length) return true; // Count changed, still loading
-            for (let i = 0; i < initial.length; i++) {
-                if (initial[i] !== current[i]) return true; // Content changed, still loading
-            }
-            return false; // Stable
-        },
+        stable: (duration: number = 200) => async (context: TableContext): Promise<boolean> => {},
 
         /**

[NoCoverage] ArrowFunction
src/strategies/loading.ts:84:17
          * Checks if the headers are stable (count and text) for a specified duration.
          * @param duration Duration in ms for headers to remain unchanged to be considered stable (default: 200).
          */
-        stable: (duration: number = 200) => async (context: TableContext): Promise<boolean> => {
-            const { config, resolve, root } = context;
-            const getHeaderTexts = async () => {
-                const headers = await resolve(config.headerSelector as Selector, root).all();
-                return Promise.all(headers.map(h => h.innerText()));
-            };
-
-            const initial = await getHeaderTexts();
-            // Wait for duration
-            await context.page.waitForTimeout(duration);
-            const current = await getHeaderTexts();
-
-            if (initial.length !== current.length) return true; // Count changed, still loading
-            for (let i = 0; i < initial.length; i++) {
-                if (initial[i] !== current[i]) return true; // Content changed, still loading
-            }
-            return false; // Stable
-        },
+        stable: () => undefined,
 
         /**

[NoCoverage] BlockStatement
src/strategies/loading.ts:86:48
          */
         stable: (duration: number = 200) => async (context: TableContext): Promise<boolean> => {
             const { config, resolve, root } = context;
-            const getHeaderTexts = async () => {
-                const headers = await resolve(config.headerSelector as Selector, root).all();
-                return Promise.all(headers.map(h => h.innerText()));
-            };
+            const getHeaderTexts = async () => {};
 
             const initial = await getHeaderTexts();

[NoCoverage] ArrowFunction
src/strategies/loading.ts:88:48
             const { config, resolve, root } = context;
             const getHeaderTexts = async () => {
                 const headers = await resolve(config.headerSelector as Selector, root).all();
-                return Promise.all(headers.map(h => h.innerText()));
+                return Promise.all(headers.map(() => undefined));
             };
 

[NoCoverage] ConditionalExpression
src/strategies/loading.ts:96:17
             await context.page.waitForTimeout(duration);
             const current = await getHeaderTexts();
 
-            if (initial.length !== current.length) return true; // Count changed, still loading
+            if (false) return true; // Count changed, still loading
             for (let i = 0; i < initial.length; i++) {
                 if (initial[i] !== current[i]) return true; // Content changed, still loading

[NoCoverage] EqualityOperator
src/strategies/loading.ts:96:17
             await context.page.waitForTimeout(duration);
             const current = await getHeaderTexts();
 
-            if (initial.length !== current.length) return true; // Count changed, still loading
+            if (initial.length === current.length) return true; // Count changed, still loading
             for (let i = 0; i < initial.length; i++) {
                 if (initial[i] !== current[i]) return true; // Content changed, still loading

[NoCoverage] EqualityOperator
src/strategies/loading.ts:97:29
             const current = await getHeaderTexts();
 
             if (initial.length !== current.length) return true; // Count changed, still loading
-            for (let i = 0; i < initial.length; i++) {
+            for (let i = 0; i >= initial.length; i++) {
                 if (initial[i] !== current[i]) return true; // Content changed, still loading
             }

[NoCoverage] EqualityOperator
src/strategies/loading.ts:97:29
             const current = await getHeaderTexts();
 
             if (initial.length !== current.length) return true; // Count changed, still loading
-            for (let i = 0; i < initial.length; i++) {
+            for (let i = 0; i <= initial.length; i++) {
                 if (initial[i] !== current[i]) return true; // Content changed, still loading
             }

[NoCoverage] ConditionalExpression
src/strategies/loading.ts:98:21
 
             if (initial.length !== current.length) return true; // Count changed, still loading
             for (let i = 0; i < initial.length; i++) {
-                if (initial[i] !== current[i]) return true; // Content changed, still loading
+                if (false) return true; // Content changed, still loading
             }
             return false; // Stable

[NoCoverage] EqualityOperator
src/strategies/loading.ts:98:21
 
             if (initial.length !== current.length) return true; // Count changed, still loading
             for (let i = 0; i < initial.length; i++) {
-                if (initial[i] !== current[i]) return true; // Content changed, still loading
+                if (initial[i] === current[i]) return true; // Content changed, still loading
             }
             return false; // Stable

[NoCoverage] BooleanLiteral
src/strategies/loading.ts:100:20
             for (let i = 0; i < initial.length; i++) {
                 if (initial[i] !== current[i]) return true; // Content changed, still loading
             }
-            return false; // Stable
+            return true; // Stable
         },
 
