[NoCoverage] LogicalOperator
src/strategies/pagination.ts:28:30
     stabilization?: StabilizationStrategy,
     timeout?: number
   } = {}): PaginationStrategy => {
-    const defaultStabilize = options.stabilization ?? StabilizationStrategies.contentChanged({ scope: 'first', timeout: options.timeout });
+    const defaultStabilize = options.stabilization && StabilizationStrategies.contentChanged({
+  scope: 'first',
+  timeout: options.timeout
+});
 
     const createClicker = (selector?: Selector, returnVal: boolean | number = true) => {

[NoCoverage] StringLiteral
src/strategies/pagination.ts:28:103
     stabilization?: StabilizationStrategy,
     timeout?: number
   } = {}): PaginationStrategy => {
-    const defaultStabilize = options.stabilization ?? StabilizationStrategies.contentChanged({ scope: 'first', timeout: options.timeout });
+    const defaultStabilize = options.stabilization ?? StabilizationStrategies.contentChanged({ scope: "", timeout: options.timeout });
 
     const createClicker = (selector?: Selector, returnVal: boolean | number = true) => {

[NoCoverage] BlockStatement
src/strategies/pagination.ts:30:88
   } = {}): PaginationStrategy => {
     const defaultStabilize = options.stabilization ?? StabilizationStrategies.contentChanged({ scope: 'first', timeout: options.timeout });
 
-    const createClicker = (selector?: Selector, returnVal: boolean | number = true) => {
-      if (!selector) return undefined;
-      return async (context: TableContext): Promise<any> => {
-        const { root, resolve } = context;
-        const btn = resolve(selector, root).first();
-
-        if (!btn || !await btn.isVisible() || !await btn.isEnabled()) {
-          return false;
-        }
-
-        return await defaultStabilize(context, async () => {
-          await btn.click({ timeout: 2000 }).catch(() => { });
-        }).then(stabilized => stabilized ? returnVal : false);
-      };
-    };
+    const createClicker = (selector?: Selector, returnVal: boolean | number = true) => {};
 
     const nextBulk = options.nextBulkPages ?? 10;

[NoCoverage] BooleanLiteral
src/strategies/pagination.ts:30:79
   } = {}): PaginationStrategy => {
     const defaultStabilize = options.stabilization ?? StabilizationStrategies.contentChanged({ scope: 'first', timeout: options.timeout });
 
-    const createClicker = (selector?: Selector, returnVal: boolean | number = true) => {
+    const createClicker = (selector?: Selector, returnVal: boolean | number = false) => {
       if (!selector) return undefined;
       return async (context: TableContext): Promise<any> => {

[NoCoverage] BooleanLiteral
src/strategies/pagination.ts:31:11
     const defaultStabilize = options.stabilization ?? StabilizationStrategies.contentChanged({ scope: 'first', timeout: options.timeout });
 
     const createClicker = (selector?: Selector, returnVal: boolean | number = true) => {
-      if (!selector) return undefined;
+      if (selector) return undefined;
       return async (context: TableContext): Promise<any> => {
         const { root, resolve } = context;

[NoCoverage] ConditionalExpression
src/strategies/pagination.ts:31:11
     const defaultStabilize = options.stabilization ?? StabilizationStrategies.contentChanged({ scope: 'first', timeout: options.timeout });
 
     const createClicker = (selector?: Selector, returnVal: boolean | number = true) => {
-      if (!selector) return undefined;
+      if (true) return undefined;
       return async (context: TableContext): Promise<any> => {
         const { root, resolve } = context;

[NoCoverage] BlockStatement
src/strategies/pagination.ts:32:61
 
     const createClicker = (selector?: Selector, returnVal: boolean | number = true) => {
       if (!selector) return undefined;
-      return async (context: TableContext): Promise<any> => {
-        const { root, resolve } = context;
-        const btn = resolve(selector, root).first();
-
-        if (!btn || !await btn.isVisible() || !await btn.isEnabled()) {
-          return false;
-        }
-
-        return await defaultStabilize(context, async () => {
-          await btn.click({ timeout: 2000 }).catch(() => { });
-        }).then(stabilized => stabilized ? returnVal : false);
-      };
+      return async (context: TableContext): Promise<any> => {};
     };
 

[NoCoverage] ConditionalExpression
src/strategies/pagination.ts:36:13
         const { root, resolve } = context;
         const btn = resolve(selector, root).first();
 
-        if (!btn || !await btn.isVisible() || !await btn.isEnabled()) {
+        if (true) {
           return false;
         }

[NoCoverage] BooleanLiteral
src/strategies/pagination.ts:36:47
         const { root, resolve } = context;
         const btn = resolve(selector, root).first();
 
-        if (!btn || !await btn.isVisible() || !await btn.isEnabled()) {
+        if (!btn || !await btn.isVisible() || await btn.isEnabled()) {
           return false;
         }

[NoCoverage] BooleanLiteral
src/strategies/pagination.ts:37:18
         const btn = resolve(selector, root).first();
 
         if (!btn || !await btn.isVisible() || !await btn.isEnabled()) {
-          return false;
+          return true;
         }
 

[NoCoverage] BlockStatement
src/strategies/pagination.ts:40:60
           return false;
         }
 
-        return await defaultStabilize(context, async () => {
-          await btn.click({ timeout: 2000 }).catch(() => { });
-        }).then(stabilized => stabilized ? returnVal : false);
+        return await defaultStabilize(context, async () => {}).then(stabilized => stabilized ? returnVal : false);
       };
     };

[NoCoverage] ArrowFunction
src/strategies/pagination.ts:42:17
 
         return await defaultStabilize(context, async () => {
           await btn.click({ timeout: 2000 }).catch(() => { });
-        }).then(stabilized => stabilized ? returnVal : false);
+        }).then(() => undefined);
       };
     };

[NoCoverage] BooleanLiteral
src/strategies/pagination.ts:42:56
 
         return await defaultStabilize(context, async () => {
           await btn.click({ timeout: 2000 }).catch(() => { });
-        }).then(stabilized => stabilized ? returnVal : false);
+        }).then(stabilized => stabilized ? returnVal : true);
       };
     };

[NoCoverage] LogicalOperator
src/strategies/pagination.ts:46:22
       };
     };
 
-    const nextBulk = options.nextBulkPages ?? 10;
+    const nextBulk = options.nextBulkPages && 10;
     const prevBulk = options.previousBulkPages ?? 10;
     return {

[NoCoverage] LogicalOperator
src/strategies/pagination.ts:47:22
     };
 
     const nextBulk = options.nextBulkPages ?? 10;
-    const prevBulk = options.previousBulkPages ?? 10;
+    const prevBulk = options.previousBulkPages && 10;
     return {
       goNext: createClicker(selectors.next),

[NoCoverage] LogicalOperator
src/strategies/pagination.ts:79:27
   } = {}): PaginationStrategy => {
 
     // Default stabilization: Wait for row count to increase (Append mode)
-    const stabilization = options.stabilization ??
-      StabilizationStrategies.rowCountIncreased({ timeout: options.timeout });
+    const stabilization = options.stabilization && StabilizationStrategies.rowCountIncreased({
+  timeout: options.timeout
+});
     const amount = options.scrollAmount ?? 500;
 

[NoCoverage] LogicalOperator
src/strategies/pagination.ts:81:20
     // Default stabilization: Wait for row count to increase (Append mode)
     const stabilization = options.stabilization ??
       StabilizationStrategies.rowCountIncreased({ timeout: options.timeout });
-    const amount = options.scrollAmount ?? 500;
+    const amount = options.scrollAmount && 500;
 
     const createScroller = (directionMultiplier: 1 | -1) => {

[NoCoverage] BlockStatement
src/strategies/pagination.ts:84:47
     const amount = options.scrollAmount ?? 500;
 
     const createScroller = (directionMultiplier: 1 | -1) => {
-      return async (context: TableContext) => {
-        const { root, resolve, page } = context;
-        const scrollTarget = options.scrollTarget
-          ? resolve(options.scrollTarget, root)
-          : root;
-
-        const doScroll = async () => {
-          const box = await scrollTarget.boundingBox();
-          const scrollValue = amount * directionMultiplier;
-
-          // Action: Scroll
-          if (options.action === 'js-scroll' || !box) {
-            await scrollTarget.evaluate((el: HTMLElement, y: number) => {
-              el.scrollTop += y;
-            }, scrollValue);
-          } else {
-            // Mouse Wheel
-            await page.mouse.move(box.x + box.width / 2, box.y + box.height / 2);
-            await page.mouse.wheel(0, scrollValue);
-          }
-        };
-
-        // Stabilization: Wait
-        return await stabilization(context, doScroll);
-      };
+      return async (context: TableContext) => {};
     };
 

[NoCoverage] BlockStatement
src/strategies/pagination.ts:90:38
           ? resolve(options.scrollTarget, root)
           : root;
 
-        const doScroll = async () => {
-          const box = await scrollTarget.boundingBox();
-          const scrollValue = amount * directionMultiplier;
-
-          // Action: Scroll
-          if (options.action === 'js-scroll' || !box) {
-            await scrollTarget.evaluate((el: HTMLElement, y: number) => {
-              el.scrollTop += y;
-            }, scrollValue);
-          } else {
-            // Mouse Wheel
-            await page.mouse.move(box.x + box.width / 2, box.y + box.height / 2);
-            await page.mouse.wheel(0, scrollValue);
-          }
-        };
+        const doScroll = async () => {};
 
         // Stabilization: Wait

[NoCoverage] ArithmeticOperator
src/strategies/pagination.ts:92:31
 
         const doScroll = async () => {
           const box = await scrollTarget.boundingBox();
-          const scrollValue = amount * directionMultiplier;
+          const scrollValue = amount / directionMultiplier;
 
           // Action: Scroll

[NoCoverage] ConditionalExpression
src/strategies/pagination.ts:95:15
           const scrollValue = amount * directionMultiplier;
 
           // Action: Scroll
-          if (options.action === 'js-scroll' || !box) {
+          if (false) {
             await scrollTarget.evaluate((el: HTMLElement, y: number) => {
               el.scrollTop += y;

[NoCoverage] ConditionalExpression
src/strategies/pagination.ts:95:15
           const scrollValue = amount * directionMultiplier;
 
           // Action: Scroll
-          if (options.action === 'js-scroll' || !box) {
+          if (false || !box) {
             await scrollTarget.evaluate((el: HTMLElement, y: number) => {
               el.scrollTop += y;

[NoCoverage] BlockStatement
src/strategies/pagination.ts:96:73
 
           // Action: Scroll
           if (options.action === 'js-scroll' || !box) {
-            await scrollTarget.evaluate((el: HTMLElement, y: number) => {
-              el.scrollTop += y;
-            }, scrollValue);
+            await scrollTarget.evaluate((el: HTMLElement, y: number) => {}, scrollValue);
           } else {
             // Mouse Wheel

[NoCoverage] AssignmentOperator
src/strategies/pagination.ts:97:15
           // Action: Scroll
           if (options.action === 'js-scroll' || !box) {
             await scrollTarget.evaluate((el: HTMLElement, y: number) => {
-              el.scrollTop += y;
+              el.scrollTop -= y;
             }, scrollValue);
           } else {

[NoCoverage] BlockStatement
src/strategies/pagination.ts:99:18
             await scrollTarget.evaluate((el: HTMLElement, y: number) => {
               el.scrollTop += y;
             }, scrollValue);
-          } else {
-            // Mouse Wheel
-            await page.mouse.move(box.x + box.width / 2, box.y + box.height / 2);
-            await page.mouse.wheel(0, scrollValue);
-          }
+          } else {}
         };
 

[NoCoverage] ArithmeticOperator
src/strategies/pagination.ts:101:35
             }, scrollValue);
           } else {
             // Mouse Wheel
-            await page.mouse.move(box.x + box.width / 2, box.y + box.height / 2);
+            await page.mouse.move(box.x - box.width / 2, box.y + box.height / 2);
             await page.mouse.wheel(0, scrollValue);
           }

[NoCoverage] ArithmeticOperator
src/strategies/pagination.ts:101:58
             }, scrollValue);
           } else {
             // Mouse Wheel
-            await page.mouse.move(box.x + box.width / 2, box.y + box.height / 2);
+            await page.mouse.move(box.x + box.width / 2, box.y - box.height / 2);
             await page.mouse.wheel(0, scrollValue);
           }

[NoCoverage] BlockStatement
src/strategies/pagination.ts:111:35
       };
     };
 
-    const createGoToFirst = () => {
-      return async (context: TableContext) => {
-        const { root, resolve } = context;
-        const scrollTarget = options.scrollTarget
-          ? resolve(options.scrollTarget, root)
-          : root;
-
-        const doScroll = async () => {
-          await scrollTarget.evaluate((el: HTMLElement) => {
-            el.scrollTop = 0;
-            el.scrollLeft = 0;
-          });
-        };
-
-        // Stabilization: Wait for content to reset
-        return await stabilization(context, doScroll);
-      };
-    };
+    const createGoToFirst = () => {};
 
     return {

[NoCoverage] BlockStatement
src/strategies/pagination.ts:112:47
     };
 
     const createGoToFirst = () => {
-      return async (context: TableContext) => {
-        const { root, resolve } = context;
-        const scrollTarget = options.scrollTarget
-          ? resolve(options.scrollTarget, root)
-          : root;
-
-        const doScroll = async () => {
-          await scrollTarget.evaluate((el: HTMLElement) => {
-            el.scrollTop = 0;
-            el.scrollLeft = 0;
-          });
-        };
-
-        // Stabilization: Wait for content to reset
-        return await stabilization(context, doScroll);
-      };
+      return async (context: TableContext) => {};
     };
 

[NoCoverage] BlockStatement
src/strategies/pagination.ts:118:38
           ? resolve(options.scrollTarget, root)
           : root;
 
-        const doScroll = async () => {
-          await scrollTarget.evaluate((el: HTMLElement) => {
-            el.scrollTop = 0;
-            el.scrollLeft = 0;
-          });
-        };
+        const doScroll = async () => {};
 
         // Stabilization: Wait for content to reset

[NoCoverage] BlockStatement
src/strategies/pagination.ts:119:60
           : root;
 
         const doScroll = async () => {
-          await scrollTarget.evaluate((el: HTMLElement) => {
-            el.scrollTop = 0;
-            el.scrollLeft = 0;
-          });
+          await scrollTarget.evaluate((el: HTMLElement) => {});
         };
 

[NoCoverage] UnaryOperator
src/strategies/pagination.ts:132:34
 
     return {
       goNext: createScroller(1),
-      goPrevious: createScroller(-1),
+      goPrevious: createScroller(+1),
       goToFirst: createGoToFirst()
     };
