[NoCoverage] BlockStatement
src/strategies/sorting.ts:12:36
    * - `doSort`: Clicks the header repeatedly until the desired `aria-sort` state is achieved.
    * - `getSortState`: Reads the `aria-sort` attribute from the header.
    */
-  AriaSort: (): SortingStrategy => {
-    return {
-      async doSort({ columnName, direction, context }) {
-        // getHeaderCell is always present on TableContext after table is initialized
-        const targetHeader = await context.getHeaderCell!(columnName);
-        // The table engine handles verify-and-retry. We only provide the trigger here.
-        await targetHeader.click();
-      },
-      async getSortState({ columnName, context }) {
-        try {
-          const targetHeader = await context.getHeaderCell!(columnName);
-          const ariaSort = await targetHeader.getAttribute('aria-sort');
-          if (ariaSort === 'ascending') return 'asc';
-          if (ariaSort === 'descending') return 'desc';
-          return 'none';
-        } catch {
-          return 'none'; // Header not found, treat as unsorted
-        }
-      },
-    };
-  },
+  AriaSort: (): SortingStrategy => {},
 };
 

[NoCoverage] ObjectLiteral
src/strategies/sorting.ts:13:12
    * - `getSortState`: Reads the `aria-sort` attribute from the header.
    */
   AriaSort: (): SortingStrategy => {
-    return {
-      async doSort({ columnName, direction, context }) {
-        // getHeaderCell is always present on TableContext after table is initialized
-        const targetHeader = await context.getHeaderCell!(columnName);
-        // The table engine handles verify-and-retry. We only provide the trigger here.
-        await targetHeader.click();
-      },
-      async getSortState({ columnName, context }) {
-        try {
-          const targetHeader = await context.getHeaderCell!(columnName);
-          const ariaSort = await targetHeader.getAttribute('aria-sort');
-          if (ariaSort === 'ascending') return 'asc';
-          if (ariaSort === 'descending') return 'desc';
-          return 'none';
-        } catch {
-          return 'none'; // Header not found, treat as unsorted
-        }
-      },
-    };
+    return {};
   },
 };

[NoCoverage] BlockStatement
src/strategies/sorting.ts:14:56
    */
   AriaSort: (): SortingStrategy => {
     return {
-      async doSort({ columnName, direction, context }) {
-        // getHeaderCell is always present on TableContext after table is initialized
-        const targetHeader = await context.getHeaderCell!(columnName);
-        // The table engine handles verify-and-retry. We only provide the trigger here.
-        await targetHeader.click();
-      },
+      async doSort({ columnName, direction, context }) {},
       async getSortState({ columnName, context }) {
         try {

[NoCoverage] BlockStatement
src/strategies/sorting.ts:20:51
         // The table engine handles verify-and-retry. We only provide the trigger here.
         await targetHeader.click();
       },
-      async getSortState({ columnName, context }) {
-        try {
-          const targetHeader = await context.getHeaderCell!(columnName);
-          const ariaSort = await targetHeader.getAttribute('aria-sort');
-          if (ariaSort === 'ascending') return 'asc';
-          if (ariaSort === 'descending') return 'desc';
-          return 'none';
-        } catch {
-          return 'none'; // Header not found, treat as unsorted
-        }
-      },
+      async getSortState({ columnName, context }) {},
     };
   },

[NoCoverage] BlockStatement
src/strategies/sorting.ts:21:13
         await targetHeader.click();
       },
       async getSortState({ columnName, context }) {
-        try {
-          const targetHeader = await context.getHeaderCell!(columnName);
-          const ariaSort = await targetHeader.getAttribute('aria-sort');
-          if (ariaSort === 'ascending') return 'asc';
-          if (ariaSort === 'descending') return 'desc';
-          return 'none';
-        } catch {
+        try {} catch {
           return 'none'; // Header not found, treat as unsorted
         }

[NoCoverage] ConditionalExpression
src/strategies/sorting.ts:24:15
         try {
           const targetHeader = await context.getHeaderCell!(columnName);
           const ariaSort = await targetHeader.getAttribute('aria-sort');
-          if (ariaSort === 'ascending') return 'asc';
+          if (true) return 'asc';
           if (ariaSort === 'descending') return 'desc';
           return 'none';

[NoCoverage] EqualityOperator
src/strategies/sorting.ts:24:15
         try {
           const targetHeader = await context.getHeaderCell!(columnName);
           const ariaSort = await targetHeader.getAttribute('aria-sort');
-          if (ariaSort === 'ascending') return 'asc';
+          if (ariaSort !== 'ascending') return 'asc';
           if (ariaSort === 'descending') return 'desc';
           return 'none';

[NoCoverage] ConditionalExpression
src/strategies/sorting.ts:25:15
           const targetHeader = await context.getHeaderCell!(columnName);
           const ariaSort = await targetHeader.getAttribute('aria-sort');
           if (ariaSort === 'ascending') return 'asc';
-          if (ariaSort === 'descending') return 'desc';
+          if (false) return 'desc';
           return 'none';
         } catch {

[NoCoverage] EqualityOperator
src/strategies/sorting.ts:25:15
           const targetHeader = await context.getHeaderCell!(columnName);
           const ariaSort = await targetHeader.getAttribute('aria-sort');
           if (ariaSort === 'ascending') return 'asc';
-          if (ariaSort === 'descending') return 'desc';
+          if (ariaSort !== 'descending') return 'desc';
           return 'none';
         } catch {

[NoCoverage] BlockStatement
src/strategies/sorting.ts:27:17
           if (ariaSort === 'ascending') return 'asc';
           if (ariaSort === 'descending') return 'desc';
           return 'none';
-        } catch {
-          return 'none'; // Header not found, treat as unsorted
-        }
+        } catch {}
       },
     };

[NoCoverage] StringLiteral
src/strategies/sorting.ts:28:18
           if (ariaSort === 'descending') return 'desc';
           return 'none';
         } catch {
-          return 'none'; // Header not found, treat as unsorted
+          return ""; // Header not found, treat as unsorted
         }
       },
