[NoCoverage] LogicalOperator
src/strategies/stabilization.ts:16:29
     contentChanged: (options: { scope?: 'all' | 'first', timeout?: number } = {}): StabilizationStrategy => {
         return async ({ root, config, resolve, page }, action) => {
             const rows = resolve(config.rowSelector, root);
-            const timeout = options.timeout ?? 5000;
+            const timeout = options.timeout && 5000;
             const scope = options.scope ?? 'all';
 

[NoCoverage] LogicalOperator
src/strategies/stabilization.ts:17:27
         return async ({ root, config, resolve, page }, action) => {
             const rows = resolve(config.rowSelector, root);
             const timeout = options.timeout ?? 5000;
-            const scope = options.scope ?? 'all';
+            const scope = options.scope && 'all';
 
             // Helper to get fingerprint

[NoCoverage] BlockStatement
src/strategies/stabilization.ts:20:48
             const scope = options.scope ?? 'all';
 
             // Helper to get fingerprint
-            const getFingerprint = async () => {
-                if (scope === 'first') {
-                    return await rows.first().innerText().catch(() => '');
-                }
-                const allText = await rows.allInnerTexts();
-                return allText.join('|');
-            };
+            const getFingerprint = async () => {};
 
             // 1. Capture Before

[NoCoverage] BlockStatement
src/strategies/stabilization.ts:21:40
 
             // Helper to get fingerprint
             const getFingerprint = async () => {
-                if (scope === 'first') {
-                    return await rows.first().innerText().catch(() => '');
-                }
+                if (scope === 'first') {}
                 const allText = await rows.allInnerTexts();
                 return allText.join('|');

[NoCoverage] ConditionalExpression
src/strategies/stabilization.ts:21:21
 
             // Helper to get fingerprint
             const getFingerprint = async () => {
-                if (scope === 'first') {
+                if (false) {
                     return await rows.first().innerText().catch(() => '');
                 }

[NoCoverage] ArrowFunction
src/strategies/stabilization.ts:22:65
             // Helper to get fingerprint
             const getFingerprint = async () => {
                 if (scope === 'first') {
-                    return await rows.first().innerText().catch(() => '');
+                    return await rows.first().innerText().catch(() => undefined);
                 }
                 const allText = await rows.allInnerTexts();

[NoCoverage] StringLiteral
src/strategies/stabilization.ts:22:71
             // Helper to get fingerprint
             const getFingerprint = async () => {
                 if (scope === 'first') {
-                    return await rows.first().innerText().catch(() => '');
+                    return await rows.first().innerText().catch(() => "Stryker was here!");
                 }
                 const allText = await rows.allInnerTexts();

[NoCoverage] StringLiteral
src/strategies/stabilization.ts:25:37
                     return await rows.first().innerText().catch(() => '');
                 }
                 const allText = await rows.allInnerTexts();
-                return allText.join('|');
+                return allText.join("");
             };
 

[NoCoverage] ArithmeticOperator
src/strategies/stabilization.ts:36:20
 
             // 3. Wait for Change
             const startTime = Date.now();
-            while (Date.now() - startTime < timeout) {
+            while (Date.now() + startTime < timeout) {
                 const afterFingerprint = await getFingerprint();
                 if (afterFingerprint !== beforeFingerprint) {

[NoCoverage] ConditionalExpression
src/strategies/stabilization.ts:38:21
             const startTime = Date.now();
             while (Date.now() - startTime < timeout) {
                 const afterFingerprint = await getFingerprint();
-                if (afterFingerprint !== beforeFingerprint) {
+                if (true) {
                     return true;
                 }

[NoCoverage] BlockStatement
src/strategies/stabilization.ts:38:61
             const startTime = Date.now();
             while (Date.now() - startTime < timeout) {
                 const afterFingerprint = await getFingerprint();
-                if (afterFingerprint !== beforeFingerprint) {
-                    return true;
-                }
+                if (afterFingerprint !== beforeFingerprint) {}
                 await page.waitForTimeout(100);
             }

[NoCoverage] BooleanLiteral
src/strategies/stabilization.ts:39:28
             while (Date.now() - startTime < timeout) {
                 const afterFingerprint = await getFingerprint();
                 if (afterFingerprint !== beforeFingerprint) {
-                    return true;
+                    return false;
                 }
                 await page.waitForTimeout(100);

[NoCoverage] BlockStatement
src/strategies/stabilization.ts:51:87
     /**
      * Waits for the total number of rows to strictly increase.
      */
-    rowCountIncreased: (options: { timeout?: number } = {}): StabilizationStrategy => {
-        return async ({ root, config, resolve, page }, action) => {
-            const rows = resolve(config.rowSelector, root);
-            const timeout = options.timeout ?? 5000;
-
-            const beforeCount = await rows.count();
-
-            await action();
-
-            const startTime = Date.now();
-            while (Date.now() - startTime < timeout) {
-                const afterCount = await rows.count();
-                if (afterCount > beforeCount) {
-                    return true;
-                }
-                await page.waitForTimeout(100);
-            }
-
-            return false;
-        };
-    },
+    rowCountIncreased: (options: { timeout?: number } = {}): StabilizationStrategy => {},
 
 

[NoCoverage] BlockStatement
src/strategies/stabilization.ts:52:67
      * Waits for the total number of rows to strictly increase.
      */
     rowCountIncreased: (options: { timeout?: number } = {}): StabilizationStrategy => {
-        return async ({ root, config, resolve, page }, action) => {
-            const rows = resolve(config.rowSelector, root);
-            const timeout = options.timeout ?? 5000;
-
-            const beforeCount = await rows.count();
-
-            await action();
-
-            const startTime = Date.now();
-            while (Date.now() - startTime < timeout) {
-                const afterCount = await rows.count();
-                if (afterCount > beforeCount) {
-                    return true;
-                }
-                await page.waitForTimeout(100);
-            }
-
-            return false;
-        };
+        return async ({ root, config, resolve, page }, action) => {};
     },
 

[NoCoverage] ConditionalExpression
src/strategies/stabilization.ts:61:20
             await action();
 
             const startTime = Date.now();
-            while (Date.now() - startTime < timeout) {
+            while (false) {
                 const afterCount = await rows.count();
                 if (afterCount > beforeCount) {

[NoCoverage] EqualityOperator
src/strategies/stabilization.ts:63:21
             const startTime = Date.now();
             while (Date.now() - startTime < timeout) {
                 const afterCount = await rows.count();
-                if (afterCount > beforeCount) {
+                if (afterCount >= beforeCount) {
                     return true;
                 }

[NoCoverage] ConditionalExpression
src/strategies/stabilization.ts:63:21
             const startTime = Date.now();
             while (Date.now() - startTime < timeout) {
                 const afterCount = await rows.count();
-                if (afterCount > beforeCount) {
+                if (false) {
                     return true;
                 }

[NoCoverage] BooleanLiteral
src/strategies/stabilization.ts:64:28
             while (Date.now() - startTime < timeout) {
                 const afterCount = await rows.count();
                 if (afterCount > beforeCount) {
-                    return true;
+                    return false;
                 }
                 await page.waitForTimeout(100);

[NoCoverage] BlockStatement
src/strategies/stabilization.ts:78:107
      * Waits for a specific network condition or spinner to disappear.
      * Useful for tables that have explicit loading states but might not change content immediately.
      */
-    networkIdle: (options: { spinnerSelector?: string, timeout?: number } = {}): StabilizationStrategy => {
-        return async ({ root, page, resolve }) => {
-            const timeout = options.timeout ?? 5000;
-            if (options.spinnerSelector) {
-                const spinner = resolve(options.spinnerSelector, root);
-                try {
-                    await spinner.waitFor({ state: 'detached', timeout });
-                    return true;
-                } catch {
-                    return false;
-                }
-            }
-            // Fallback to simple wait if no selector
-            await page.waitForTimeout(500);
-            return true;
-        }
-    }
+    networkIdle: (options: { spinnerSelector?: string, timeout?: number } = {}): StabilizationStrategy => {}
 };
 

[NoCoverage] BlockStatement
src/strategies/stabilization.ts:79:51
      * Useful for tables that have explicit loading states but might not change content immediately.
      */
     networkIdle: (options: { spinnerSelector?: string, timeout?: number } = {}): StabilizationStrategy => {
-        return async ({ root, page, resolve }) => {
-            const timeout = options.timeout ?? 5000;
-            if (options.spinnerSelector) {
-                const spinner = resolve(options.spinnerSelector, root);
-                try {
-                    await spinner.waitFor({ state: 'detached', timeout });
-                    return true;
-                } catch {
-                    return false;
-                }
-            }
-            // Fallback to simple wait if no selector
-            await page.waitForTimeout(500);
-            return true;
-        }
+        return async ({ root, page, resolve }) => {}
     }
 };

[NoCoverage] LogicalOperator
src/strategies/stabilization.ts:80:29
      */
     networkIdle: (options: { spinnerSelector?: string, timeout?: number } = {}): StabilizationStrategy => {
         return async ({ root, page, resolve }) => {
-            const timeout = options.timeout ?? 5000;
+            const timeout = options.timeout && 5000;
             if (options.spinnerSelector) {
                 const spinner = resolve(options.spinnerSelector, root);

[NoCoverage] ConditionalExpression
src/strategies/stabilization.ts:81:17
     networkIdle: (options: { spinnerSelector?: string, timeout?: number } = {}): StabilizationStrategy => {
         return async ({ root, page, resolve }) => {
             const timeout = options.timeout ?? 5000;
-            if (options.spinnerSelector) {
+            if (true) {
                 const spinner = resolve(options.spinnerSelector, root);
                 try {

[NoCoverage] BlockStatement
src/strategies/stabilization.ts:81:42
     networkIdle: (options: { spinnerSelector?: string, timeout?: number } = {}): StabilizationStrategy => {
         return async ({ root, page, resolve }) => {
             const timeout = options.timeout ?? 5000;
-            if (options.spinnerSelector) {
-                const spinner = resolve(options.spinnerSelector, root);
-                try {
-                    await spinner.waitFor({ state: 'detached', timeout });
-                    return true;
-                } catch {
-                    return false;
-                }
-            }
+            if (options.spinnerSelector) {}
             // Fallback to simple wait if no selector
             await page.waitForTimeout(500);

[NoCoverage] BlockStatement
src/strategies/stabilization.ts:83:21
             const timeout = options.timeout ?? 5000;
             if (options.spinnerSelector) {
                 const spinner = resolve(options.spinnerSelector, root);
-                try {
-                    await spinner.waitFor({ state: 'detached', timeout });
-                    return true;
-                } catch {
+                try {} catch {
                     return false;
                 }

[NoCoverage] BooleanLiteral
src/strategies/stabilization.ts:85:28
                 const spinner = resolve(options.spinnerSelector, root);
                 try {
                     await spinner.waitFor({ state: 'detached', timeout });
-                    return true;
+                    return false;
                 } catch {
                     return false;

[NoCoverage] BooleanLiteral
src/strategies/stabilization.ts:92:20
             }
             // Fallback to simple wait if no selector
             await page.waitForTimeout(500);
-            return true;
+            return false;
         }
     }
