[NoCoverage] ConditionalExpression
src/useTable.ts:29:33
  */
 export const useTable = <T = any>(rootLocator: Locator, configOptions: TableConfig<T> = {}): TableResult<T> => {
   // Store whether pagination was explicitly provided in config
-  const hasPaginationInConfig = configOptions.strategies?.pagination !== undefined;
+  const hasPaginationInConfig = false;
 
   // Default strategies

[NoCoverage] EqualityOperator
src/useTable.ts:29:33
  */
 export const useTable = <T = any>(rootLocator: Locator, configOptions: TableConfig<T> = {}): TableResult<T> => {
   // Store whether pagination was explicitly provided in config
-  const hasPaginationInConfig = configOptions.strategies?.pagination !== undefined;
+  const hasPaginationInConfig = configOptions.strategies?.pagination === undefined;
 
   // Default strategies

[NoCoverage] StringLiteral
src/useTable.ts:44:21
 
   const config: FinalTableConfig<T> = {
     rowSelector: "tbody tr",
-    headerSelector: "thead th",
+    headerSelector: "",
     cellSelector: "td",
     maxPages: 1,

[NoCoverage] StringLiteral
src/useTable.ts:45:19
   const config: FinalTableConfig<T> = {
     rowSelector: "tbody tr",
     headerSelector: "thead th",
-    cellSelector: "td",
+    cellSelector: "",
     maxPages: 1,
     headerTransformer: ({ text }) => text,

[NoCoverage] ArrowFunction
src/useTable.ts:47:24
     headerSelector: "thead th",
     cellSelector: "td",
     maxPages: 1,
-    headerTransformer: ({ text }) => text,
+    headerTransformer: () => undefined,
     autoScroll: true,
     onReset: async () => { /* no-op default */ },

[NoCoverage] BooleanLiteral
src/useTable.ts:48:17
     cellSelector: "td",
     maxPages: 1,
     headerTransformer: ({ text }) => text,
-    autoScroll: true,
+    autoScroll: false,
     onReset: async () => { /* no-op default */ },
     ...configOptions,

[NoCoverage] ObjectLiteral
src/useTable.ts:51:17
     autoScroll: true,
     onReset: async () => { /* no-op default */ },
     ...configOptions,
-    strategies: {
-      ...defaultStrategies,
-      ...configOptions.strategies,
-    }
+    strategies: {}
   };
 

[NoCoverage] BlockStatement
src/useTable.ts:57:72
     }
   };
 
-  const resolve = (item: Selector, parent: Locator | Page): Locator => {
-    if (typeof item === 'string') return parent.locator(item);
-    if (typeof item === 'function') return (item as any)(parent);
-    return item;
-  };
+  const resolve = (item: Selector, parent: Locator | Page): Locator => {};
 
   // Internal State

[NoCoverage] EqualityOperator
src/useTable.ts:58:9
   };
 
   const resolve = (item: Selector, parent: Locator | Page): Locator => {
-    if (typeof item === 'string') return parent.locator(item);
+    if (typeof item !== 'string') return parent.locator(item);
     if (typeof item === 'function') return (item as any)(parent);
     return item;

[NoCoverage] ConditionalExpression
src/useTable.ts:58:9
   };
 
   const resolve = (item: Selector, parent: Locator | Page): Locator => {
-    if (typeof item === 'string') return parent.locator(item);
+    if (false) return parent.locator(item);
     if (typeof item === 'function') return (item as any)(parent);
     return item;

[NoCoverage] EqualityOperator
src/useTable.ts:59:9
 
   const resolve = (item: Selector, parent: Locator | Page): Locator => {
     if (typeof item === 'string') return parent.locator(item);
-    if (typeof item === 'function') return (item as any)(parent);
+    if (typeof item !== 'function') return (item as any)(parent);
     return item;
   };

[NoCoverage] ConditionalExpression
src/useTable.ts:59:9
 
   const resolve = (item: Selector, parent: Locator | Page): Locator => {
     if (typeof item === 'string') return parent.locator(item);
-    if (typeof item === 'function') return (item as any)(parent);
+    if (true) return (item as any)(parent);
     return item;
   };

[NoCoverage] BooleanLiteral
src/useTable.ts:64:23
   };
 
   // Internal State
-  let _hasPaginated = false;
+  let _hasPaginated = true;
 
   // Helpers

[NoCoverage] BlockStatement
src/useTable.ts:67:32
   let _hasPaginated = false;
 
   // Helpers
-  const log = (msg: string) => {
-    logDebug(config, 'verbose', msg);
-  };
+  const log = (msg: string) => {};
 
   const _createColumnError = (colName: string, map: Map<string, number>, context?: string): Error => {

[NoCoverage] BlockStatement
src/useTable.ts:71:102
     logDebug(config, 'verbose', msg);
   };
 
-  const _createColumnError = (colName: string, map: Map<string, number>, context?: string): Error => {
-    const availableColumns = Array.from(map.keys());
-    const lowerCol = colName.toLowerCase();
-    const suggestions = availableColumns.filter(col =>
-      col.toLowerCase().includes(lowerCol) ||
-      lowerCol.includes(col.toLowerCase()) ||
-      col.toLowerCase().replace(/\s+/g, '') === lowerCol.replace(/\s+/g, '')
-    );
-    let suggestion = '.';
-    if (suggestions.length > 0 && suggestions[0] !== colName) {
-      suggestion = `. Did you mean "${suggestions[0]}"?`;
-    } else if (availableColumns.length > 0 && availableColumns.length <= 10) {
-      suggestion = `. Available columns: ${availableColumns.map(c => `"${c}"`).join(', ')}`;
-    } else if (availableColumns.length > 0) {
-      suggestion = `. Available columns (first 10 of ${availableColumns.length}): ${availableColumns.slice(0, 10).map(c => `"${c}"`).join(', ')}, ...`;
-    }
-
-    const contextMsg = context ? ` (${context})` : '';
-    return new Error(`Column "${colName}" not found${contextMsg}${suggestion}`);
-  };
+  const _createColumnError = (colName: string, map: Map<string, number>, context?: string): Error => {};
 
   // Engines

[NoCoverage] MethodExpression
src/useTable.ts:73:22
 
   const _createColumnError = (colName: string, map: Map<string, number>, context?: string): Error => {
     const availableColumns = Array.from(map.keys());
-    const lowerCol = colName.toLowerCase();
+    const lowerCol = colName.toUpperCase();
     const suggestions = availableColumns.filter(col =>
       col.toLowerCase().includes(lowerCol) ||

[NoCoverage] MethodExpression
src/useTable.ts:74:25
   const _createColumnError = (colName: string, map: Map<string, number>, context?: string): Error => {
     const availableColumns = Array.from(map.keys());
     const lowerCol = colName.toLowerCase();
-    const suggestions = availableColumns.filter(col =>
-      col.toLowerCase().includes(lowerCol) ||
-      lowerCol.includes(col.toLowerCase()) ||
-      col.toLowerCase().replace(/\s+/g, '') === lowerCol.replace(/\s+/g, '')
-    );
+    const suggestions = availableColumns;
     let suggestion = '.';
     if (suggestions.length > 0 && suggestions[0] !== colName) {

[NoCoverage] ArrowFunction
src/useTable.ts:74:49
   const _createColumnError = (colName: string, map: Map<string, number>, context?: string): Error => {
     const availableColumns = Array.from(map.keys());
     const lowerCol = colName.toLowerCase();
-    const suggestions = availableColumns.filter(col =>
-      col.toLowerCase().includes(lowerCol) ||
-      lowerCol.includes(col.toLowerCase()) ||
-      col.toLowerCase().replace(/\s+/g, '') === lowerCol.replace(/\s+/g, '')
+    const suggestions = availableColumns.filter(() => undefined
     );
     let suggestion = '.';

[NoCoverage] ConditionalExpression
src/useTable.ts:75:7
     const availableColumns = Array.from(map.keys());
     const lowerCol = colName.toLowerCase();
     const suggestions = availableColumns.filter(col =>
-      col.toLowerCase().includes(lowerCol) ||
-      lowerCol.includes(col.toLowerCase()) ||
-      col.toLowerCase().replace(/\s+/g, '') === lowerCol.replace(/\s+/g, '')
+      false
     );
     let suggestion = '.';

[NoCoverage] ConditionalExpression
src/useTable.ts:75:7
     const availableColumns = Array.from(map.keys());
     const lowerCol = colName.toLowerCase();
     const suggestions = availableColumns.filter(col =>
-      col.toLowerCase().includes(lowerCol) ||
-      lowerCol.includes(col.toLowerCase()) ||
+      false ||
       col.toLowerCase().replace(/\s+/g, '') === lowerCol.replace(/\s+/g, '')
     );

[NoCoverage] MethodExpression
src/useTable.ts:76:25
     const lowerCol = colName.toLowerCase();
     const suggestions = availableColumns.filter(col =>
       col.toLowerCase().includes(lowerCol) ||
-      lowerCol.includes(col.toLowerCase()) ||
+      lowerCol.includes(col.toUpperCase()) ||
       col.toLowerCase().replace(/\s+/g, '') === lowerCol.replace(/\s+/g, '')
     );

[NoCoverage] ConditionalExpression
src/useTable.ts:77:7
     const suggestions = availableColumns.filter(col =>
       col.toLowerCase().includes(lowerCol) ||
       lowerCol.includes(col.toLowerCase()) ||
-      col.toLowerCase().replace(/\s+/g, '') === lowerCol.replace(/\s+/g, '')
+      false
     );
     let suggestion = '.';

[NoCoverage] MethodExpression
src/useTable.ts:77:7
     const suggestions = availableColumns.filter(col =>
       col.toLowerCase().includes(lowerCol) ||
       lowerCol.includes(col.toLowerCase()) ||
-      col.toLowerCase().replace(/\s+/g, '') === lowerCol.replace(/\s+/g, '')
+      col.toUpperCase().replace(/\s+/g, '') === lowerCol.replace(/\s+/g, '')
     );
     let suggestion = '.';

[NoCoverage] StringLiteral
src/useTable.ts:79:22
       lowerCol.includes(col.toLowerCase()) ||
       col.toLowerCase().replace(/\s+/g, '') === lowerCol.replace(/\s+/g, '')
     );
-    let suggestion = '.';
+    let suggestion = "";
     if (suggestions.length > 0 && suggestions[0] !== colName) {
       suggestion = `. Did you mean "${suggestions[0]}"?`;

[NoCoverage] EqualityOperator
src/useTable.ts:80:9
       col.toLowerCase().replace(/\s+/g, '') === lowerCol.replace(/\s+/g, '')
     );
     let suggestion = '.';
-    if (suggestions.length > 0 && suggestions[0] !== colName) {
+    if (suggestions.length >= 0 && suggestions[0] !== colName) {
       suggestion = `. Did you mean "${suggestions[0]}"?`;
     } else if (availableColumns.length > 0 && availableColumns.length <= 10) {

[NoCoverage] ConditionalExpression
src/useTable.ts:80:9
       col.toLowerCase().replace(/\s+/g, '') === lowerCol.replace(/\s+/g, '')
     );
     let suggestion = '.';
-    if (suggestions.length > 0 && suggestions[0] !== colName) {
+    if (true) {
       suggestion = `. Did you mean "${suggestions[0]}"?`;
     } else if (availableColumns.length > 0 && availableColumns.length <= 10) {

[NoCoverage] EqualityOperator
src/useTable.ts:82:47
     let suggestion = '.';
     if (suggestions.length > 0 && suggestions[0] !== colName) {
       suggestion = `. Did you mean "${suggestions[0]}"?`;
-    } else if (availableColumns.length > 0 && availableColumns.length <= 10) {
+    } else if (availableColumns.length > 0 && availableColumns.length < 10) {
       suggestion = `. Available columns: ${availableColumns.map(c => `"${c}"`).join(', ')}`;
     } else if (availableColumns.length > 0) {

[NoCoverage] BlockStatement
src/useTable.ts:82:78
     let suggestion = '.';
     if (suggestions.length > 0 && suggestions[0] !== colName) {
       suggestion = `. Did you mean "${suggestions[0]}"?`;
-    } else if (availableColumns.length > 0 && availableColumns.length <= 10) {
-      suggestion = `. Available columns: ${availableColumns.map(c => `"${c}"`).join(', ')}`;
-    } else if (availableColumns.length > 0) {
+    } else if (availableColumns.length > 0 && availableColumns.length <= 10) {} else if (availableColumns.length > 0) {
       suggestion = `. Available columns (first 10 of ${availableColumns.length}): ${availableColumns.slice(0, 10).map(c => `"${c}"`).join(', ')}, ...`;
     }

[NoCoverage] ArrowFunction
src/useTable.ts:83:65
     if (suggestions.length > 0 && suggestions[0] !== colName) {
       suggestion = `. Did you mean "${suggestions[0]}"?`;
     } else if (availableColumns.length > 0 && availableColumns.length <= 10) {
-      suggestion = `. Available columns: ${availableColumns.map(c => `"${c}"`).join(', ')}`;
+      suggestion = `. Available columns: ${availableColumns.map(() => undefined).join(', ')}`;
     } else if (availableColumns.length > 0) {
       suggestion = `. Available columns (first 10 of ${availableColumns.length}): ${availableColumns.slice(0, 10).map(c => `"${c}"`).join(', ')}, ...`;

[NoCoverage] StringLiteral
src/useTable.ts:83:85
     if (suggestions.length > 0 && suggestions[0] !== colName) {
       suggestion = `. Did you mean "${suggestions[0]}"?`;
     } else if (availableColumns.length > 0 && availableColumns.length <= 10) {
-      suggestion = `. Available columns: ${availableColumns.map(c => `"${c}"`).join(', ')}`;
+      suggestion = `. Available columns: ${availableColumns.map(c => `"${c}"`).join("")}`;
     } else if (availableColumns.length > 0) {
       suggestion = `. Available columns (first 10 of ${availableColumns.length}): ${availableColumns.slice(0, 10).map(c => `"${c}"`).join(', ')}, ...`;

[NoCoverage] EqualityOperator
src/useTable.ts:84:16
       suggestion = `. Did you mean "${suggestions[0]}"?`;
     } else if (availableColumns.length > 0 && availableColumns.length <= 10) {
       suggestion = `. Available columns: ${availableColumns.map(c => `"${c}"`).join(', ')}`;
-    } else if (availableColumns.length > 0) {
+    } else if (availableColumns.length <= 0) {
       suggestion = `. Available columns (first 10 of ${availableColumns.length}): ${availableColumns.slice(0, 10).map(c => `"${c}"`).join(', ')}, ...`;
     }

[NoCoverage] ConditionalExpression
src/useTable.ts:84:16
       suggestion = `. Did you mean "${suggestions[0]}"?`;
     } else if (availableColumns.length > 0 && availableColumns.length <= 10) {
       suggestion = `. Available columns: ${availableColumns.map(c => `"${c}"`).join(', ')}`;
-    } else if (availableColumns.length > 0) {
+    } else if (false) {
       suggestion = `. Available columns (first 10 of ${availableColumns.length}): ${availableColumns.slice(0, 10).map(c => `"${c}"`).join(', ')}, ...`;
     }

[NoCoverage] ArrowFunction
src/useTable.ts:85:119
     } else if (availableColumns.length > 0 && availableColumns.length <= 10) {
       suggestion = `. Available columns: ${availableColumns.map(c => `"${c}"`).join(', ')}`;
     } else if (availableColumns.length > 0) {
-      suggestion = `. Available columns (first 10 of ${availableColumns.length}): ${availableColumns.slice(0, 10).map(c => `"${c}"`).join(', ')}, ...`;
+      suggestion = `. Available columns (first 10 of ${availableColumns.length}): ${availableColumns.slice(0, 10).map(() => undefined).join(', ')}, ...`;
     }
 

[NoCoverage] MethodExpression
src/useTable.ts:85:85
     } else if (availableColumns.length > 0 && availableColumns.length <= 10) {
       suggestion = `. Available columns: ${availableColumns.map(c => `"${c}"`).join(', ')}`;
     } else if (availableColumns.length > 0) {
-      suggestion = `. Available columns (first 10 of ${availableColumns.length}): ${availableColumns.slice(0, 10).map(c => `"${c}"`).join(', ')}, ...`;
+      suggestion = `. Available columns (first 10 of ${availableColumns.length}): ${availableColumns.map(c => `"${c}"`).join(', ')}, ...`;
     }
 

[NoCoverage] BlockStatement
src/useTable.ts:100:131
   let finalTable: TableResult<T> = null as unknown as TableResult<T>;
 
   // Helper factory
-  const _makeSmart = (rowLocator: Locator, map: Map<string, number>, rowIndex?: number, tablePageIndex?: number): SmartRowType => {
-    return createSmartRow<T>(rowLocator, map, rowIndex, config, rootLocator, resolve, finalTable, tablePageIndex);
-  };
+  const _makeSmart = (rowLocator: Locator, map: Map<string, number>, rowIndex?: number, tablePageIndex?: number): SmartRowType => {};
 
   const tableState = { currentPageIndex: 0 };

[NoCoverage] ArrowFunction
src/useTable.ts:108:51
   const rowFinder = new RowFinder<T>(rootLocator, config, resolve, filterEngine, tableMapper, _makeSmart, tableState);
 
   /** Builds a full TableContext/StrategyContext with getHeaderCell, getHeaders, scrollToColumn. Set after result is created. */
-  let createStrategyContext: () => TableContext = () => ({ root: rootLocator, config, page: rootLocator.page(), resolve });
+  let createStrategyContext: () => TableContext = () => undefined;
 
   const _getCleanHtml = async (loc: Locator): Promise<string> => {

[NoCoverage] BlockStatement
src/useTable.ts:110:66
   /** Builds a full TableContext/StrategyContext with getHeaderCell, getHeaders, scrollToColumn. Set after result is created. */
   let createStrategyContext: () => TableContext = () => ({ root: rootLocator, config, page: rootLocator.page(), resolve });
 
-  const _getCleanHtml = async (loc: Locator): Promise<string> => {
-    return loc.evaluate((el) => {
-      const clone = el.cloneNode(true) as Element;
-      const removeSelectors = 'script, style, svg, path, circle, rect, noscript, [hidden]';
-      clone.querySelectorAll(removeSelectors).forEach(n => n.remove());
-      const walker = document.createTreeWalker(clone, NodeFilter.SHOW_ELEMENT);
-      let currentNode = walker.currentNode as Element;
-      while (currentNode) {
-        currentNode.removeAttribute('style');
-        currentNode.removeAttribute('data-reactid');
-        const cls = currentNode.getAttribute('class');
-        if (cls && cls.length > 80) {
-          const tokens = cls.split(' ');
-          if (tokens.length > 5) {
-            currentNode.setAttribute('class', tokens.slice(0, 4).join(' ') + ' ...');
-          }
-        }
-        currentNode = walker.nextNode() as Element;
-      }
-      return clone.outerHTML;
-    });
-  };
+  const _getCleanHtml = async (loc: Locator): Promise<string> => {};
 
   const _handlePrompt = async (promptName: string, content: string) => {

[NoCoverage] BlockStatement
src/useTable.ts:111:33
   let createStrategyContext: () => TableContext = () => ({ root: rootLocator, config, page: rootLocator.page(), resolve });
 
   const _getCleanHtml = async (loc: Locator): Promise<string> => {
-    return loc.evaluate((el) => {
-      const clone = el.cloneNode(true) as Element;
-      const removeSelectors = 'script, style, svg, path, circle, rect, noscript, [hidden]';
-      clone.querySelectorAll(removeSelectors).forEach(n => n.remove());
-      const walker = document.createTreeWalker(clone, NodeFilter.SHOW_ELEMENT);
-      let currentNode = walker.currentNode as Element;
-      while (currentNode) {
-        currentNode.removeAttribute('style');
-        currentNode.removeAttribute('data-reactid');
-        const cls = currentNode.getAttribute('class');
-        if (cls && cls.length > 80) {
-          const tokens = cls.split(' ');
-          if (tokens.length > 5) {
-            currentNode.setAttribute('class', tokens.slice(0, 4).join(' ') + ' ...');
-          }
-        }
-        currentNode = walker.nextNode() as Element;
-      }
-      return clone.outerHTML;
-    });
+    return loc.evaluate((el) => {});
   };
 

[NoCoverage] ArrowFunction
src/useTable.ts:114:55
     return loc.evaluate((el) => {
       const clone = el.cloneNode(true) as Element;
       const removeSelectors = 'script, style, svg, path, circle, rect, noscript, [hidden]';
-      clone.querySelectorAll(removeSelectors).forEach(n => n.remove());
+      clone.querySelectorAll(removeSelectors).forEach(() => undefined);
       const walker = document.createTreeWalker(clone, NodeFilter.SHOW_ELEMENT);
       let currentNode = walker.currentNode as Element;

[NoCoverage] ConditionalExpression
src/useTable.ts:117:14
       clone.querySelectorAll(removeSelectors).forEach(n => n.remove());
       const walker = document.createTreeWalker(clone, NodeFilter.SHOW_ELEMENT);
       let currentNode = walker.currentNode as Element;
-      while (currentNode) {
+      while (false) {
         currentNode.removeAttribute('style');
         currentNode.removeAttribute('data-reactid');

[NoCoverage] BlockStatement
src/useTable.ts:117:27
       clone.querySelectorAll(removeSelectors).forEach(n => n.remove());
       const walker = document.createTreeWalker(clone, NodeFilter.SHOW_ELEMENT);
       let currentNode = walker.currentNode as Element;
-      while (currentNode) {
-        currentNode.removeAttribute('style');
-        currentNode.removeAttribute('data-reactid');
-        const cls = currentNode.getAttribute('class');
-        if (cls && cls.length > 80) {
-          const tokens = cls.split(' ');
-          if (tokens.length > 5) {
-            currentNode.setAttribute('class', tokens.slice(0, 4).join(' ') + ' ...');
-          }
-        }
-        currentNode = walker.nextNode() as Element;
-      }
+      while (currentNode) {}
       return clone.outerHTML;
     });

[NoCoverage] StringLiteral
src/useTable.ts:119:37
       let currentNode = walker.currentNode as Element;
       while (currentNode) {
         currentNode.removeAttribute('style');
-        currentNode.removeAttribute('data-reactid');
+        currentNode.removeAttribute("");
         const cls = currentNode.getAttribute('class');
         if (cls && cls.length > 80) {

[NoCoverage] ConditionalExpression
src/useTable.ts:121:20
         currentNode.removeAttribute('style');
         currentNode.removeAttribute('data-reactid');
         const cls = currentNode.getAttribute('class');
-        if (cls && cls.length > 80) {
+        if (cls && true) {
           const tokens = cls.split(' ');
           if (tokens.length > 5) {

[NoCoverage] EqualityOperator
src/useTable.ts:121:20
         currentNode.removeAttribute('style');
         currentNode.removeAttribute('data-reactid');
         const cls = currentNode.getAttribute('class');
-        if (cls && cls.length > 80) {
+        if (cls && cls.length <= 80) {
           const tokens = cls.split(' ');
           if (tokens.length > 5) {

[NoCoverage] EqualityOperator
src/useTable.ts:123:15
         const cls = currentNode.getAttribute('class');
         if (cls && cls.length > 80) {
           const tokens = cls.split(' ');
-          if (tokens.length > 5) {
+          if (tokens.length <= 5) {
             currentNode.setAttribute('class', tokens.slice(0, 4).join(' ') + ' ...');
           }

[NoCoverage] EqualityOperator
src/useTable.ts:123:15
         const cls = currentNode.getAttribute('class');
         if (cls && cls.length > 80) {
           const tokens = cls.split(' ');
-          if (tokens.length > 5) {
+          if (tokens.length >= 5) {
             currentNode.setAttribute('class', tokens.slice(0, 4).join(' ') + ' ...');
           }

[NoCoverage] MethodExpression
src/useTable.ts:124:47
         if (cls && cls.length > 80) {
           const tokens = cls.split(' ');
           if (tokens.length > 5) {
-            currentNode.setAttribute('class', tokens.slice(0, 4).join(' ') + ' ...');
+            currentNode.setAttribute('class', tokens.join(' ') + ' ...');
           }
         }

[NoCoverage] StringLiteral
src/useTable.ts:124:38
         if (cls && cls.length > 80) {
           const tokens = cls.split(' ');
           if (tokens.length > 5) {
-            currentNode.setAttribute('class', tokens.slice(0, 4).join(' ') + ' ...');
+            currentNode.setAttribute("", tokens.slice(0, 4).join(' ') + ' ...');
           }
         }

[NoCoverage] BlockStatement
src/useTable.ts:133:72
     });
   };
 
-  const _handlePrompt = async (promptName: string, content: string) => {
-    let finalPrompt = content;
-    finalPrompt += `\n\n👇 Useful TypeScript Definitions 👇\n\`\`\`typescript\n${MINIMAL_CONFIG_CONTEXT}\n\`\`\`\n`;
-
-    console.log(`⚠️ Throwing error to display [${promptName}] cleanly...`);
-    throw new Error(finalPrompt);
-  };
+  const _handlePrompt = async (promptName: string, content: string) => {};
 
   const _autoInit = async () => {

[NoCoverage] StringLiteral
src/useTable.ts:137:17
     let finalPrompt = content;
     finalPrompt += `\n\n👇 Useful TypeScript Definitions 👇\n\`\`\`typescript\n${MINIMAL_CONFIG_CONTEXT}\n\`\`\`\n`;
 
-    console.log(`⚠️ Throwing error to display [${promptName}] cleanly...`);
+    console.log(``);
     throw new Error(finalPrompt);
   };

[NoCoverage] BlockStatement
src/useTable.ts:141:33
     throw new Error(finalPrompt);
   };
 
-  const _autoInit = async () => {
-    await tableMapper.getMap();
-  };
+  const _autoInit = async () => {};
 
   // Default: goNext (one page). Pass useBulk true to prefer goNextBulk. "How far" uses numeric return when strategy provides it.

[NoCoverage] BooleanLiteral
src/useTable.ts:146:50
   };
 
   // Default: goNext (one page). Pass useBulk true to prefer goNextBulk. "How far" uses numeric return when strategy provides it.
-  const _advancePage = async (useBulk: boolean = false): Promise<boolean> => {
+  const _advancePage = async (useBulk: boolean = true): Promise<boolean> => {
     const context = createStrategyContext();
     const pagination = config.strategies.pagination;

[NoCoverage] ConditionalExpression
src/useTable.ts:151:9
     const pagination = config.strategies.pagination;
     let rawResult: boolean | number | undefined;
     let primitive: string;
-    if (useBulk && pagination?.goNextBulk) {
+    if (false) {
       primitive = 'goNextBulk';
       rawResult = await pagination.goNextBulk(context);

[NoCoverage] ConditionalExpression
src/useTable.ts:151:9
     const pagination = config.strategies.pagination;
     let rawResult: boolean | number | undefined;
     let primitive: string;
-    if (useBulk && pagination?.goNextBulk) {
+    if (true) {
       primitive = 'goNextBulk';
       rawResult = await pagination.goNextBulk(context);

[NoCoverage] StringLiteral
src/useTable.ts:152:19
     let rawResult: boolean | number | undefined;
     let primitive: string;
     if (useBulk && pagination?.goNextBulk) {
-      primitive = 'goNextBulk';
+      primitive = "";
       rawResult = await pagination.goNextBulk(context);
     } else if (pagination?.goNext) {

[NoCoverage] BlockStatement
src/useTable.ts:154:36
     if (useBulk && pagination?.goNextBulk) {
       primitive = 'goNextBulk';
       rawResult = await pagination.goNextBulk(context);
-    } else if (pagination?.goNext) {
-      primitive = 'goNext';
-      rawResult = await pagination.goNext(context);
-    } else if (pagination?.goNextBulk) {
+    } else if (pagination?.goNext) {} else if (pagination?.goNextBulk) {
       primitive = 'goNextBulk (fallback)';
       rawResult = await pagination.goNextBulk(context);

[NoCoverage] ConditionalExpression
src/useTable.ts:154:16
     if (useBulk && pagination?.goNextBulk) {
       primitive = 'goNextBulk';
       rawResult = await pagination.goNextBulk(context);
-    } else if (pagination?.goNext) {
+    } else if (true) {
       primitive = 'goNext';
       rawResult = await pagination.goNext(context);

[NoCoverage] StringLiteral
src/useTable.ts:155:19
       primitive = 'goNextBulk';
       rawResult = await pagination.goNextBulk(context);
     } else if (pagination?.goNext) {
-      primitive = 'goNext';
+      primitive = "";
       rawResult = await pagination.goNext(context);
     } else if (pagination?.goNextBulk) {

[NoCoverage] OptionalChaining
src/useTable.ts:157:16
     } else if (pagination?.goNext) {
       primitive = 'goNext';
       rawResult = await pagination.goNext(context);
-    } else if (pagination?.goNextBulk) {
+    } else if (pagination.goNextBulk) {
       primitive = 'goNextBulk (fallback)';
       rawResult = await pagination.goNextBulk(context);

[NoCoverage] BlockStatement
src/useTable.ts:157:40
     } else if (pagination?.goNext) {
       primitive = 'goNext';
       rawResult = await pagination.goNext(context);
-    } else if (pagination?.goNextBulk) {
-      primitive = 'goNextBulk (fallback)';
-      rawResult = await pagination.goNextBulk(context);
-    } else {
+    } else if (pagination?.goNextBulk) {} else {
       log('_advancePage: no pagination primitive available — returning false');
       return false;

[NoCoverage] BlockStatement
src/useTable.ts:160:12
     } else if (pagination?.goNextBulk) {
       primitive = 'goNextBulk (fallback)';
       rawResult = await pagination.goNextBulk(context);
-    } else {
-      log('_advancePage: no pagination primitive available — returning false');
-      return false;
-    }
+    } else {}
     const didAdvance = rawResult !== undefined && validatePaginationResult(rawResult, 'Pagination Strategy');
     const pagesJumped = typeof rawResult === 'number' ? rawResult : (didAdvance ? 1 : 0);

[NoCoverage] BooleanLiteral
src/useTable.ts:162:14
       rawResult = await pagination.goNextBulk(context);
     } else {
       log('_advancePage: no pagination primitive available — returning false');
-      return false;
+      return true;
     }
     const didAdvance = rawResult !== undefined && validatePaginationResult(rawResult, 'Pagination Strategy');

[NoCoverage] LogicalOperator
src/useTable.ts:164:24
       log('_advancePage: no pagination primitive available — returning false');
       return false;
     }
-    const didAdvance = rawResult !== undefined && validatePaginationResult(rawResult, 'Pagination Strategy');
+    const didAdvance = rawResult !== undefined || validatePaginationResult(rawResult, 'Pagination Strategy');
     const pagesJumped = typeof rawResult === 'number' ? rawResult : (didAdvance ? 1 : 0);
     if (pagesJumped > 0) {

[NoCoverage] ConditionalExpression
src/useTable.ts:164:24
       log('_advancePage: no pagination primitive available — returning false');
       return false;
     }
-    const didAdvance = rawResult !== undefined && validatePaginationResult(rawResult, 'Pagination Strategy');
+    const didAdvance = false;
     const pagesJumped = typeof rawResult === 'number' ? rawResult : (didAdvance ? 1 : 0);
     if (pagesJumped > 0) {
