[NoCoverage] EqualityOperator
src/useTable.ts:165:25
       return false;
     }
     const didAdvance = rawResult !== undefined && validatePaginationResult(rawResult, 'Pagination Strategy');
-    const pagesJumped = typeof rawResult === 'number' ? rawResult : (didAdvance ? 1 : 0);
+    const pagesJumped = typeof rawResult !== 'number' ? rawResult : (didAdvance ? 1 : 0);
     if (pagesJumped > 0) {
       tableState.currentPageIndex += pagesJumped;

[NoCoverage] ConditionalExpression
src/useTable.ts:165:25
       return false;
     }
     const didAdvance = rawResult !== undefined && validatePaginationResult(rawResult, 'Pagination Strategy');
-    const pagesJumped = typeof rawResult === 'number' ? rawResult : (didAdvance ? 1 : 0);
+    const pagesJumped = false ? rawResult : (didAdvance ? 1 : 0);
     if (pagesJumped > 0) {
       tableState.currentPageIndex += pagesJumped;

[NoCoverage] BlockStatement
src/useTable.ts:166:26
     }
     const didAdvance = rawResult !== undefined && validatePaginationResult(rawResult, 'Pagination Strategy');
     const pagesJumped = typeof rawResult === 'number' ? rawResult : (didAdvance ? 1 : 0);
-    if (pagesJumped > 0) {
-      tableState.currentPageIndex += pagesJumped;
-      log(`_advancePage: ${primitive} advanced ${pagesJumped} page(s) — now at page ${tableState.currentPageIndex}`);
-    } else {
+    if (pagesJumped > 0) {} else {
       log(`_advancePage: ${primitive} returned false — end of data`);
     }

[NoCoverage] ConditionalExpression
src/useTable.ts:166:9
     }
     const didAdvance = rawResult !== undefined && validatePaginationResult(rawResult, 'Pagination Strategy');
     const pagesJumped = typeof rawResult === 'number' ? rawResult : (didAdvance ? 1 : 0);
-    if (pagesJumped > 0) {
+    if (false) {
       tableState.currentPageIndex += pagesJumped;
       log(`_advancePage: ${primitive} advanced ${pagesJumped} page(s) — now at page ${tableState.currentPageIndex}`);

[NoCoverage] AssignmentOperator
src/useTable.ts:167:7
     const didAdvance = rawResult !== undefined && validatePaginationResult(rawResult, 'Pagination Strategy');
     const pagesJumped = typeof rawResult === 'number' ? rawResult : (didAdvance ? 1 : 0);
     if (pagesJumped > 0) {
-      tableState.currentPageIndex += pagesJumped;
+      tableState.currentPageIndex -= pagesJumped;
       log(`_advancePage: ${primitive} advanced ${pagesJumped} page(s) — now at page ${tableState.currentPageIndex}`);
     } else {

[NoCoverage] StringLiteral
src/useTable.ts:168:11
     const pagesJumped = typeof rawResult === 'number' ? rawResult : (didAdvance ? 1 : 0);
     if (pagesJumped > 0) {
       tableState.currentPageIndex += pagesJumped;
-      log(`_advancePage: ${primitive} advanced ${pagesJumped} page(s) — now at page ${tableState.currentPageIndex}`);
+      log(``);
     } else {
       log(`_advancePage: ${primitive} returned false — end of data`);

[NoCoverage] BlockStatement
src/useTable.ts:169:12
     if (pagesJumped > 0) {
       tableState.currentPageIndex += pagesJumped;
       log(`_advancePage: ${primitive} advanced ${pagesJumped} page(s) — now at page ${tableState.currentPageIndex}`);
-    } else {
-      log(`_advancePage: ${primitive} returned false — end of data`);
-    }
+    } else {}
     return didAdvance;
   };

[NoCoverage] BlockStatement
src/useTable.ts:176:28
   };
 
   const result: TableResult<T> = {
-    get currentPageIndex() { return tableState.currentPageIndex; },
+    get currentPageIndex() {},
     set currentPageIndex(v: number) { tableState.currentPageIndex = v; },
     init: async (options?: { timeout?: number }): Promise<TableResult<T>> => {

[NoCoverage] BlockStatement
src/useTable.ts:177:37
 
   const result: TableResult<T> = {
     get currentPageIndex() { return tableState.currentPageIndex; },
-    set currentPageIndex(v: number) { tableState.currentPageIndex = v; },
+    set currentPageIndex(v: number) {},
     init: async (options?: { timeout?: number }): Promise<TableResult<T>> => {
       if (tableMapper.isInitialized()) return result;

[NoCoverage] BlockStatement
src/useTable.ts:178:78
   const result: TableResult<T> = {
     get currentPageIndex() { return tableState.currentPageIndex; },
     set currentPageIndex(v: number) { tableState.currentPageIndex = v; },
-    init: async (options?: { timeout?: number }): Promise<TableResult<T>> => {
-      if (tableMapper.isInitialized()) return result;
-
-      warnIfDebugInCI(config);
-      logDebug(config, 'info', 'Initializing table');
-
-      const map = await tableMapper.getMap(options?.timeout);
-
-      logDebug(config, 'info', `Table initialized with ${map.size} columns`, Array.from(map.keys()));
-      await debugDelay(config, 'default');
-      return result;
-    },
+    init: async (options?: { timeout?: number }): Promise<TableResult<T>> => {},
 
     scrollToColumn: async (columnName: string) => {

[NoCoverage] ConditionalExpression
src/useTable.ts:179:11
     get currentPageIndex() { return tableState.currentPageIndex; },
     set currentPageIndex(v: number) { tableState.currentPageIndex = v; },
     init: async (options?: { timeout?: number }): Promise<TableResult<T>> => {
-      if (tableMapper.isInitialized()) return result;
+      if (false) return result;
 
       warnIfDebugInCI(config);

[NoCoverage] ConditionalExpression
src/useTable.ts:179:11
     get currentPageIndex() { return tableState.currentPageIndex; },
     set currentPageIndex(v: number) { tableState.currentPageIndex = v; },
     init: async (options?: { timeout?: number }): Promise<TableResult<T>> => {
-      if (tableMapper.isInitialized()) return result;
+      if (true) return result;
 
       warnIfDebugInCI(config);

[NoCoverage] StringLiteral
src/useTable.ts:182:24
       if (tableMapper.isInitialized()) return result;
 
       warnIfDebugInCI(config);
-      logDebug(config, 'info', 'Initializing table');
+      logDebug(config, "", 'Initializing table');
 
       const map = await tableMapper.getMap(options?.timeout);

[NoCoverage] OptionalChaining
src/useTable.ts:184:44
       warnIfDebugInCI(config);
       logDebug(config, 'info', 'Initializing table');
 
-      const map = await tableMapper.getMap(options?.timeout);
+      const map = await tableMapper.getMap(options.timeout);
 
       logDebug(config, 'info', `Table initialized with ${map.size} columns`, Array.from(map.keys()));

[NoCoverage] StringLiteral
src/useTable.ts:186:24
 
       const map = await tableMapper.getMap(options?.timeout);
 
-      logDebug(config, 'info', `Table initialized with ${map.size} columns`, Array.from(map.keys()));
+      logDebug(config, "", `Table initialized with ${map.size} columns`, Array.from(map.keys()));
       await debugDelay(config, 'default');
       return result;

[NoCoverage] StringLiteral
src/useTable.ts:186:32
 
       const map = await tableMapper.getMap(options?.timeout);
 
-      logDebug(config, 'info', `Table initialized with ${map.size} columns`, Array.from(map.keys()));
+      logDebug(config, 'info', ``, Array.from(map.keys()));
       await debugDelay(config, 'default');
       return result;

[NoCoverage] BlockStatement
src/useTable.ts:191:51
       return result;
     },
 
-    scrollToColumn: async (columnName: string) => {
-      const map = await tableMapper.getMap();
-      const idx = map.get(columnName);
-      if (idx === undefined) throw _createColumnError(columnName, map);
-
-      // Use header cell for scrolling
-      const headerCell = resolve(config.headerSelector as Selector, rootLocator).nth(idx);
-      await headerCell.scrollIntoViewIfNeeded();
-    },
+    scrollToColumn: async (columnName: string) => {},
 
     getHeaders: async () => {

[NoCoverage] ConditionalExpression
src/useTable.ts:194:11
     scrollToColumn: async (columnName: string) => {
       const map = await tableMapper.getMap();
       const idx = map.get(columnName);
-      if (idx === undefined) throw _createColumnError(columnName, map);
+      if (true) throw _createColumnError(columnName, map);
 
       // Use header cell for scrolling

[NoCoverage] ConditionalExpression
src/useTable.ts:194:11
     scrollToColumn: async (columnName: string) => {
       const map = await tableMapper.getMap();
       const idx = map.get(columnName);
-      if (idx === undefined) throw _createColumnError(columnName, map);
+      if (false) throw _createColumnError(columnName, map);
 
       // Use header cell for scrolling

[NoCoverage] BlockStatement
src/useTable.ts:201:29
       await headerCell.scrollIntoViewIfNeeded();
     },
 
-    getHeaders: async () => {
-      const map = await tableMapper.getMap();
-      return Array.from(map.keys());
-    },
+    getHeaders: async () => {},
 
     getHeaderCell: async (columnName: string) => {

[NoCoverage] BlockStatement
src/useTable.ts:206:50
       return Array.from(map.keys());
     },
 
-    getHeaderCell: async (columnName: string) => {
-      const map = await tableMapper.getMap();
-      const idx = map.get(columnName);
-      if (idx === undefined) throw _createColumnError(columnName, map, 'header cell');
-      return resolve(config.headerSelector as Selector, rootLocator).nth(idx);
-    },
+    getHeaderCell: async (columnName: string) => {},
 
     reset: async () => {

[NoCoverage] EqualityOperator
src/useTable.ts:209:11
     getHeaderCell: async (columnName: string) => {
       const map = await tableMapper.getMap();
       const idx = map.get(columnName);
-      if (idx === undefined) throw _createColumnError(columnName, map, 'header cell');
+      if (idx !== undefined) throw _createColumnError(columnName, map, 'header cell');
       return resolve(config.headerSelector as Selector, rootLocator).nth(idx);
     },

[NoCoverage] ConditionalExpression
src/useTable.ts:209:11
     getHeaderCell: async (columnName: string) => {
       const map = await tableMapper.getMap();
       const idx = map.get(columnName);
-      if (idx === undefined) throw _createColumnError(columnName, map, 'header cell');
+      if (true) throw _createColumnError(columnName, map, 'header cell');
       return resolve(config.headerSelector as Selector, rootLocator).nth(idx);
     },

[NoCoverage] BlockStatement
src/useTable.ts:213:24
       return resolve(config.headerSelector as Selector, rootLocator).nth(idx);
     },
 
-    reset: async () => {
-      log("Resetting table...");
-      await config.onReset(createStrategyContext());
-
-      if (config.strategies.pagination?.goToFirst) {
-        log("Auto-navigating to first page...");
-        await config.strategies.pagination.goToFirst(createStrategyContext());
-      } else if (hasPaginationInConfig) {
-        log("No goToFirst strategy configured. Table may not be on page 1.");
-      }
-
-      _hasPaginated = false;
-      tableState.currentPageIndex = 0;
-      tableMapper.clear();
-      log("Table reset complete. Calling autoInit to restore state.");
-      await _autoInit();
-    },
+    reset: async () => {},
 
     revalidate: async () => {

[NoCoverage] StringLiteral
src/useTable.ts:214:11
     },
 
     reset: async () => {
-      log("Resetting table...");
+      log("");
       await config.onReset(createStrategyContext());
 

[NoCoverage] ConditionalExpression
src/useTable.ts:217:11
       log("Resetting table...");
       await config.onReset(createStrategyContext());
 
-      if (config.strategies.pagination?.goToFirst) {
+      if (true) {
         log("Auto-navigating to first page...");
         await config.strategies.pagination.goToFirst(createStrategyContext());

[NoCoverage] ConditionalExpression
src/useTable.ts:217:11
       log("Resetting table...");
       await config.onReset(createStrategyContext());
 
-      if (config.strategies.pagination?.goToFirst) {
+      if (false) {
         log("Auto-navigating to first page...");
         await config.strategies.pagination.goToFirst(createStrategyContext());

[NoCoverage] StringLiteral
src/useTable.ts:218:13
       await config.onReset(createStrategyContext());
 
       if (config.strategies.pagination?.goToFirst) {
-        log("Auto-navigating to first page...");
+        log("");
         await config.strategies.pagination.goToFirst(createStrategyContext());
       } else if (hasPaginationInConfig) {

[NoCoverage] BlockStatement
src/useTable.ts:220:41
       if (config.strategies.pagination?.goToFirst) {
         log("Auto-navigating to first page...");
         await config.strategies.pagination.goToFirst(createStrategyContext());
-      } else if (hasPaginationInConfig) {
-        log("No goToFirst strategy configured. Table may not be on page 1.");
-      }
+      } else if (hasPaginationInConfig) {}
 
       _hasPaginated = false;

[NoCoverage] ConditionalExpression
src/useTable.ts:220:18
       if (config.strategies.pagination?.goToFirst) {
         log("Auto-navigating to first page...");
         await config.strategies.pagination.goToFirst(createStrategyContext());
-      } else if (hasPaginationInConfig) {
+      } else if (true) {
         log("No goToFirst strategy configured. Table may not be on page 1.");
       }

[NoCoverage] StringLiteral
src/useTable.ts:221:13
         log("Auto-navigating to first page...");
         await config.strategies.pagination.goToFirst(createStrategyContext());
       } else if (hasPaginationInConfig) {
-        log("No goToFirst strategy configured. Table may not be on page 1.");
+        log("");
       }
 

[NoCoverage] BooleanLiteral
src/useTable.ts:224:23
         log("No goToFirst strategy configured. Table may not be on page 1.");
       }
 
-      _hasPaginated = false;
+      _hasPaginated = true;
       tableState.currentPageIndex = 0;
       tableMapper.clear();

[NoCoverage] StringLiteral
src/useTable.ts:227:11
       _hasPaginated = false;
       tableState.currentPageIndex = 0;
       tableMapper.clear();
-      log("Table reset complete. Calling autoInit to restore state.");
+      log("");
       await _autoInit();
     },

[NoCoverage] BlockStatement
src/useTable.ts:231:29
       await _autoInit();
     },
 
-    revalidate: async () => {
-      log("Revalidating table structure...");
-      await tableMapper.remapHeaders();
-      log("Table revalidated.");
-    },
+    revalidate: async () => {},
 
 

[NoCoverage] BooleanLiteral
src/useTable.ts:239:105
 
 
 
-    getRow: (filters: Partial<T> | Record<string, FilterValue>, options: { exact?: boolean } = { exact: false }): SmartRowType<T> => {
+    getRow: (filters: Partial<T> | Record<string, FilterValue>, options: { exact?: boolean } = { exact: true }): SmartRowType<T> => {
       const map = tableMapper.getMapSync();
       if (!map) throw new Error('Table not initialized. Call await table.init() first, or use async methods like table.findRow() or table.findRows() which auto-initialize.');

[NoCoverage] BlockStatement
src/useTable.ts:239:134
 
 
 
-    getRow: (filters: Partial<T> | Record<string, FilterValue>, options: { exact?: boolean } = { exact: false }): SmartRowType<T> => {
-      const map = tableMapper.getMapSync();
-      if (!map) throw new Error('Table not initialized. Call await table.init() first, or use async methods like table.findRow() or table.findRows() which auto-initialize.');
-
-      const allRows = resolve(config.rowSelector, rootLocator);
-      const matchedRows = filterEngine.applyFilters(
-        allRows,
-        filters as Record<string, FilterValue>,
-        map,
-        options.exact || false,
-        rootLocator.page(),
-        rootLocator
-      );
-      const rowLocator = matchedRows.first();
-      return _makeSmart(rowLocator, map, 0); // fallback index 0
-    },
+    getRow: (filters: Partial<T> | Record<string, FilterValue>, options: { exact?: boolean } = { exact: false }): SmartRowType<T> => {},
 
     getRowByIndex: (index: number): SmartRowType<T> => {

[NoCoverage] BooleanLiteral
src/useTable.ts:241:11
 
     getRow: (filters: Partial<T> | Record<string, FilterValue>, options: { exact?: boolean } = { exact: false }): SmartRowType<T> => {
       const map = tableMapper.getMapSync();
-      if (!map) throw new Error('Table not initialized. Call await table.init() first, or use async methods like table.findRow() or table.findRows() which auto-initialize.');
+      if (map) throw new Error('Table not initialized. Call await table.init() first, or use async methods like table.findRow() or table.findRows() which auto-initialize.');
 
       const allRows = resolve(config.rowSelector, rootLocator);

[NoCoverage] ConditionalExpression
src/useTable.ts:241:11
 
     getRow: (filters: Partial<T> | Record<string, FilterValue>, options: { exact?: boolean } = { exact: false }): SmartRowType<T> => {
       const map = tableMapper.getMapSync();
-      if (!map) throw new Error('Table not initialized. Call await table.init() first, or use async methods like table.findRow() or table.findRows() which auto-initialize.');
+      if (true) throw new Error('Table not initialized. Call await table.init() first, or use async methods like table.findRow() or table.findRows() which auto-initialize.');
 
       const allRows = resolve(config.rowSelector, rootLocator);

[NoCoverage] ConditionalExpression
src/useTable.ts:248:9
         allRows,
         filters as Record<string, FilterValue>,
         map,
-        options.exact || false,
+        true,
         rootLocator.page(),
         rootLocator

[NoCoverage] ConditionalExpression
src/useTable.ts:248:9
         allRows,
         filters as Record<string, FilterValue>,
         map,
-        options.exact || false,
+        false,
         rootLocator.page(),
         rootLocator

[NoCoverage] BlockStatement
src/useTable.ts:256:56
       return _makeSmart(rowLocator, map, 0); // fallback index 0
     },
 
-    getRowByIndex: (index: number): SmartRowType<T> => {
-      const map = tableMapper.getMapSync();
-      if (!map) throw new Error('Table not initialized. Call await table.init() first, or use async methods like table.findRow() or table.findRows() which auto-initialize.');
-
-      const rowLocator = resolve(config.rowSelector, rootLocator).nth(index);
-      return _makeSmart(rowLocator, map, index);
-    },
+    getRowByIndex: (index: number): SmartRowType<T> => {},
 
     findRow: async (filters: Record<string, FilterValue>, options?: { exact?: boolean, maxPages?: number }): Promise<SmartRowType<T>> => {

[NoCoverage] ConditionalExpression
src/useTable.ts:258:11
 
     getRowByIndex: (index: number): SmartRowType<T> => {
       const map = tableMapper.getMapSync();
-      if (!map) throw new Error('Table not initialized. Call await table.init() first, or use async methods like table.findRow() or table.findRows() which auto-initialize.');
+      if (false) throw new Error('Table not initialized. Call await table.init() first, or use async methods like table.findRow() or table.findRows() which auto-initialize.');
 
       const rowLocator = resolve(config.rowSelector, rootLocator).nth(index);

[NoCoverage] BlockStatement
src/useTable.ts:264:138
       return _makeSmart(rowLocator, map, index);
     },
 
-    findRow: async (filters: Record<string, FilterValue>, options?: { exact?: boolean, maxPages?: number }): Promise<SmartRowType<T>> => {
-      return rowFinder.findRow(filters, options);
-    },
+    findRow: async (filters: Record<string, FilterValue>, options?: { exact?: boolean, maxPages?: number }): Promise<SmartRowType<T>> => {},
 
 

[NoCoverage] BlockStatement
src/useTable.ts:270:141
 
 
 
-    findRows: async (filters?: Record<string, FilterValue>, options?: { exact?: boolean, maxPages?: number }): Promise<SmartRowArray<T>> => {
-      return rowFinder.findRows(filters ?? {}, options);
-    },
+    findRows: async (filters?: Record<string, FilterValue>, options?: { exact?: boolean, maxPages?: number }): Promise<SmartRowArray<T>> => {},
 
     isInitialized: (): boolean => {

[NoCoverage] LogicalOperator
src/useTable.ts:271:33
 
 
     findRows: async (filters?: Record<string, FilterValue>, options?: { exact?: boolean, maxPages?: number }): Promise<SmartRowArray<T>> => {
-      return rowFinder.findRows(filters ?? {}, options);
+      return rowFinder.findRows(filters && {}, options);
     },
 

[NoCoverage] BlockStatement
src/useTable.ts:274:35
       return rowFinder.findRows(filters ?? {}, options);
     },
 
-    isInitialized: (): boolean => {
-      return tableMapper.isInitialized();
-    },
+    isInitialized: (): boolean => {},
 
     sorting: {

[NoCoverage] BooleanLiteral
src/useTable.ts:281:13
     sorting: {
       apply: async (columnName: string, direction: 'asc' | 'desc'): Promise<void> => {
         await _autoInit();
-        if (!config.strategies.sorting) throw new Error('No sorting strategy has been configured.');
+        if (config.strategies.sorting) throw new Error('No sorting strategy has been configured.');
         log(`Applying sort for column "${columnName}" (${direction})`);
         const context: StrategyContext = { ...createStrategyContext(), getHeaderCell: result.getHeaderCell };

[NoCoverage] ConditionalExpression
src/useTable.ts:281:13
     sorting: {
       apply: async (columnName: string, direction: 'asc' | 'desc'): Promise<void> => {
         await _autoInit();
-        if (!config.strategies.sorting) throw new Error('No sorting strategy has been configured.');
+        if (true) throw new Error('No sorting strategy has been configured.');
         log(`Applying sort for column "${columnName}" (${direction})`);
         const context: StrategyContext = { ...createStrategyContext(), getHeaderCell: result.getHeaderCell };

[NoCoverage] ObjectLiteral
src/useTable.ts:283:42
         await _autoInit();
         if (!config.strategies.sorting) throw new Error('No sorting strategy has been configured.');
         log(`Applying sort for column "${columnName}" (${direction})`);
-        const context: StrategyContext = { ...createStrategyContext(), getHeaderCell: result.getHeaderCell };
+        const context: StrategyContext = {};
 
         const maxRetries = 3;

[NoCoverage] EqualityOperator
src/useTable.ts:286:25
         const context: StrategyContext = { ...createStrategyContext(), getHeaderCell: result.getHeaderCell };
 
         const maxRetries = 3;
-        for (let i = 0; i < maxRetries; i++) {
+        for (let i = 0; i >= maxRetries; i++) {
           const currentState = await config.strategies.sorting.getSortState({ columnName, context });
           if (currentState === direction) {

[NoCoverage] EqualityOperator
src/useTable.ts:286:25
         const context: StrategyContext = { ...createStrategyContext(), getHeaderCell: result.getHeaderCell };
 
         const maxRetries = 3;
-        for (let i = 0; i < maxRetries; i++) {
+        for (let i = 0; i <= maxRetries; i++) {
           const currentState = await config.strategies.sorting.getSortState({ columnName, context });
           if (currentState === direction) {

[NoCoverage] ObjectLiteral
src/useTable.ts:287:77
 
         const maxRetries = 3;
         for (let i = 0; i < maxRetries; i++) {
-          const currentState = await config.strategies.sorting.getSortState({ columnName, context });
+          const currentState = await config.strategies.sorting.getSortState({});
           if (currentState === direction) {
             log(`Sort for "${columnName}" is already "${direction}".`);

[NoCoverage] ConditionalExpression
src/useTable.ts:288:15
         const maxRetries = 3;
         for (let i = 0; i < maxRetries; i++) {
           const currentState = await config.strategies.sorting.getSortState({ columnName, context });
-          if (currentState === direction) {
+          if (true) {
             log(`Sort for "${columnName}" is already "${direction}".`);
             return;

[NoCoverage] ConditionalExpression
src/useTable.ts:288:15
         const maxRetries = 3;
         for (let i = 0; i < maxRetries; i++) {
           const currentState = await config.strategies.sorting.getSortState({ columnName, context });
-          if (currentState === direction) {
+          if (false) {
             log(`Sort for "${columnName}" is already "${direction}".`);
             return;

[NoCoverage] StringLiteral
src/useTable.ts:289:17
         for (let i = 0; i < maxRetries; i++) {
           const currentState = await config.strategies.sorting.getSortState({ columnName, context });
           if (currentState === direction) {
-            log(`Sort for "${columnName}" is already "${direction}".`);
+            log(``);
             return;
           }

[NoCoverage] ConditionalExpression
src/useTable.ts:294:15
           }
           await config.strategies.sorting.doSort({ columnName, direction, context });
 
-          if (config.strategies.loading?.isTableLoading) {
+          if (false) {
             await config.strategies.loading.isTableLoading(context);
           } else {

[NoCoverage] OptionalChaining
src/useTable.ts:294:15
           }
           await config.strategies.sorting.doSort({ columnName, direction, context });
 
-          if (config.strategies.loading?.isTableLoading) {
+          if (config.strategies.loading.isTableLoading) {
             await config.strategies.loading.isTableLoading(context);
           } else {

[NoCoverage] BlockStatement
src/useTable.ts:296:18
 
           if (config.strategies.loading?.isTableLoading) {
             await config.strategies.loading.isTableLoading(context);
-          } else {
-            await rootLocator.page().waitForTimeout(200);
-          }
+          } else {}
           await debugDelay(config, 'default');
 

[NoCoverage] ObjectLiteral
src/useTable.ts:301:73
           }
           await debugDelay(config, 'default');
 
-          const newState = await config.strategies.sorting.getSortState({ columnName, context });
+          const newState = await config.strategies.sorting.getSortState({});
           if (newState === direction) {
             log(`Successfully sorted "${columnName}" to "${direction}".`);

[NoCoverage] BlockStatement
src/useTable.ts:302:39
           await debugDelay(config, 'default');
 
           const newState = await config.strategies.sorting.getSortState({ columnName, context });
-          if (newState === direction) {
-            log(`Successfully sorted "${columnName}" to "${direction}".`);
-            return;
-          }
+          if (newState === direction) {}
         }
         throw new Error(`Failed to sort column "${columnName}" to "${direction}" after ${maxRetries} attempts.`);

[NoCoverage] ConditionalExpression
src/useTable.ts:302:15
           await debugDelay(config, 'default');
 
           const newState = await config.strategies.sorting.getSortState({ columnName, context });
-          if (newState === direction) {
+          if (false) {
             log(`Successfully sorted "${columnName}" to "${direction}".`);
             return;

[NoCoverage] StringLiteral
src/useTable.ts:307:25
             return;
           }
         }
-        throw new Error(`Failed to sort column "${columnName}" to "${direction}" after ${maxRetries} attempts.`);
+        throw new Error(``);
       },
       getState: async (columnName: string): Promise<'asc' | 'desc' | 'none'> => {

[NoCoverage] BlockStatement
src/useTable.ts:309:81
         }
         throw new Error(`Failed to sort column "${columnName}" to "${direction}" after ${maxRetries} attempts.`);
       },
-      getState: async (columnName: string): Promise<'asc' | 'desc' | 'none'> => {
-        await _autoInit();
-        if (!config.strategies.sorting) throw new Error('No sorting strategy has been configured.');
-        const context: StrategyContext = { ...createStrategyContext(), getHeaderCell: result.getHeaderCell };
-        return config.strategies.sorting.getSortState({ columnName, context });
-      }
+      getState: async (columnName: string): Promise<'asc' | 'desc' | 'none'> => {}
     },
 

[NoCoverage] ConditionalExpression
src/useTable.ts:311:13
       },
       getState: async (columnName: string): Promise<'asc' | 'desc' | 'none'> => {
         await _autoInit();
-        if (!config.strategies.sorting) throw new Error('No sorting strategy has been configured.');
+        if (false) throw new Error('No sorting strategy has been configured.');
         const context: StrategyContext = { ...createStrategyContext(), getHeaderCell: result.getHeaderCell };
         return config.strategies.sorting.getSortState({ columnName, context });

[NoCoverage] BooleanLiteral
src/useTable.ts:324:23
       const map = tableMapper.getMapSync()!;
       const effectiveMaxPages = config.maxPages;
       const tracker = new ElementTracker('iterator');
-      const useBulk = false; // iterator has no options; default goNext
+      const useBulk = true; // iterator has no options; default goNext
 
       try {

[NoCoverage] BlockStatement
src/useTable.ts:326:11
       const tracker = new ElementTracker('iterator');
       const useBulk = false; // iterator has no options; default goNext
 
-      try {
-        let rowIndex = 0;
-        let pagesScanned = 1;
-
-        while (true) {
-          const rowLocators = resolve(config.rowSelector, rootLocator);
-          const newIndices = await tracker.getUnseenIndices(rowLocators);
-          const pageRows = await rowLocators.all();
-
-          for (const idx of newIndices) {
-            yield { row: _makeSmart(pageRows[idx], map, rowIndex), rowIndex };
-            rowIndex++;
-          }
-
-          if (pagesScanned >= effectiveMaxPages) break;
-          if (!await _advancePage(useBulk)) break;
-          pagesScanned++;
-        }
-      } finally {
+      try {} finally {
         await tracker.cleanup(rootLocator.page());
       }
