[NoCoverage] BlockStatement
src/useTable.ts:335:41
           const newIndices = await tracker.getUnseenIndices(rowLocators);
           const pageRows = await rowLocators.all();
 
-          for (const idx of newIndices) {
-            yield { row: _makeSmart(pageRows[idx], map, rowIndex), rowIndex };
-            rowIndex++;
-          }
+          for (const idx of newIndices) {}
 
           if (pagesScanned >= effectiveMaxPages) break;

[NoCoverage] UpdateOperator
src/useTable.ts:337:13
 
           for (const idx of newIndices) {
             yield { row: _makeSmart(pageRows[idx], map, rowIndex), rowIndex };
-            rowIndex++;
+            rowIndex--;
           }
 

[NoCoverage] ConditionalExpression
src/useTable.ts:340:15
             rowIndex++;
           }
 
-          if (pagesScanned >= effectiveMaxPages) break;
+          if (false) break;
           if (!await _advancePage(useBulk)) break;
           pagesScanned++;

[NoCoverage] ConditionalExpression
src/useTable.ts:340:15
             rowIndex++;
           }
 
-          if (pagesScanned >= effectiveMaxPages) break;
+          if (true) break;
           if (!await _advancePage(useBulk)) break;
           pagesScanned++;

[NoCoverage] ConditionalExpression
src/useTable.ts:341:15
           }
 
           if (pagesScanned >= effectiveMaxPages) break;
-          if (!await _advancePage(useBulk)) break;
+          if (false) break;
           pagesScanned++;
         }

[NoCoverage] ConditionalExpression
src/useTable.ts:341:15
           }
 
           if (pagesScanned >= effectiveMaxPages) break;
-          if (!await _advancePage(useBulk)) break;
+          if (true) break;
           pagesScanned++;
         }

[NoCoverage] UpdateOperator
src/useTable.ts:342:11
 
           if (pagesScanned >= effectiveMaxPages) break;
           if (!await _advancePage(useBulk)) break;
-          pagesScanned++;
+          pagesScanned--;
         }
       } finally {

[NoCoverage] BlockStatement
src/useTable.ts:344:17
           if (!await _advancePage(useBulk)) break;
           pagesScanned++;
         }
-      } finally {
-        await tracker.cleanup(rootLocator.page());
-      }
+      } finally {}
     },
 

[NoCoverage] BlockStatement
src/useTable.ts:351:48
 
     // ─── Row iteration (delegated to engine/tableIteration) ──────────────────
 
-    forEach: async (callback, options = {}) => {
-      await _autoInit();
-      await runForEach(
-        {
-          getRowLocators: () => resolve(config.rowSelector, rootLocator),
-          getMap: () => tableMapper.getMapSync()!,
-          advancePage: _advancePage,
-          makeSmartRow: (loc, map, idx, pageIdx) => _makeSmart(loc, map, idx, pageIdx),
-          createSmartRowArray,
-          config,
-          getPage: () => rootLocator.page(),
-        },
-        callback,
-        options
-      );
-    },
+    forEach: async (callback, options = {}) => {},
 
     map: async <R>(callback: (ctx: import('./types').RowIterationContext<T>) => R | Promise<R>, options: import('./types').RowIterationOptions = {}): Promise<R[]> => {

[NoCoverage] ArrowFunction
src/useTable.ts:355:27
       await _autoInit();
       await runForEach(
         {
-          getRowLocators: () => resolve(config.rowSelector, rootLocator),
+          getRowLocators: () => undefined,
           getMap: () => tableMapper.getMapSync()!,
           advancePage: _advancePage,

[NoCoverage] ArrowFunction
src/useTable.ts:356:19
       await runForEach(
         {
           getRowLocators: () => resolve(config.rowSelector, rootLocator),
-          getMap: () => tableMapper.getMapSync()!,
+          getMap: () => undefined,
           advancePage: _advancePage,
           makeSmartRow: (loc, map, idx, pageIdx) => _makeSmart(loc, map, idx, pageIdx),

[NoCoverage] ArrowFunction
src/useTable.ts:358:25
           getRowLocators: () => resolve(config.rowSelector, rootLocator),
           getMap: () => tableMapper.getMapSync()!,
           advancePage: _advancePage,
-          makeSmartRow: (loc, map, idx, pageIdx) => _makeSmart(loc, map, idx, pageIdx),
+          makeSmartRow: () => undefined,
           createSmartRowArray,
           config,

[NoCoverage] ArrowFunction
src/useTable.ts:361:20
           makeSmartRow: (loc, map, idx, pageIdx) => _makeSmart(loc, map, idx, pageIdx),
           createSmartRowArray,
           config,
-          getPage: () => rootLocator.page(),
+          getPage: () => undefined,
         },
         callback,

[NoCoverage] BlockStatement
src/useTable.ts:368:167
       );
     },
 
-    map: async <R>(callback: (ctx: import('./types').RowIterationContext<T>) => R | Promise<R>, options: import('./types').RowIterationOptions = {}): Promise<R[]> => {
-      await _autoInit();
-      return runMap(
-        {
-          getRowLocators: () => resolve(config.rowSelector, rootLocator),
-          getMap: () => tableMapper.getMapSync()!,
-          advancePage: _advancePage,
-          makeSmartRow: (loc, map, idx, pageIdx) => _makeSmart(loc, map, idx, pageIdx),
-          createSmartRowArray,
-          config,
-          getPage: () => rootLocator.page(),
-        },
-        callback,
-        options
-      );
-    },
+    map: async <R>(callback: (ctx: import('./types').RowIterationContext<T>) => R | Promise<R>, options: import('./types').RowIterationOptions = {}): Promise<R[]> => {},
 
     filter: async (predicate, options = {}) => {

[NoCoverage] BlockStatement
src/useTable.ts:385:48
       );
     },
 
-    filter: async (predicate, options = {}) => {
-      await _autoInit();
-      return runFilter(
-        {
-          getRowLocators: () => resolve(config.rowSelector, rootLocator),
-          getMap: () => tableMapper.getMapSync()!,
-          advancePage: _advancePage,
-          makeSmartRow: (loc, map, idx, pageIdx) => _makeSmart(loc, map, idx, pageIdx),
-          createSmartRowArray,
-          config,
-          getPage: () => rootLocator.page(),
-        },
-        predicate,
-        options
-      );
-    },
+    filter: async (predicate, options = {}) => {},
 
 

[NoCoverage] StringLiteral
src/useTable.ts:408:27
       const html = await _getCleanHtml(rootLocator);
       const separator = "=".repeat(50);
-      await _handlePrompt('Smart Table Config', content);
+      await _handlePrompt("", content);
     },
 

[NoCoverage] BlockStatement
src/useTable.ts:411:39
       await _handlePrompt('Smart Table Config', content);
     },
 
-    generateConfigPrompt: async () => {
-      console.warn('⚠️ [playwright-smart-table] generateConfigPrompt() is deprecated and will be removed in v7.0.0. Please use generateConfig() instead.');
-      return result.generateConfig();
-    },
+    generateConfigPrompt: async () => {},
   };
 

[NoCoverage] StringLiteral
src/useTable.ts:412:20
     },
 
     generateConfigPrompt: async () => {
-      console.warn('⚠️ [playwright-smart-table] generateConfigPrompt() is deprecated and will be removed in v7.0.0. Please use generateConfig() instead.');
+      console.warn("");
       return result.generateConfig();
     },

[NoCoverage] ArrowFunction
src/useTable.ts:417:27
     },
   };
 
-  createStrategyContext = () => ({
-    root: rootLocator,
-    config,
-    page: rootLocator.page(),
-    resolve,
-    getHeaderCell: result.getHeaderCell,
-    getHeaders: result.getHeaders,
-    scrollToColumn: result.scrollToColumn,
-  });
+  createStrategyContext = () => undefined;
 
   finalTable = result;
