[Killed] BlockStatement
src/utils/debugUtils.ts:10:11
 export function getDebugDelay(
     config: FinalTableConfig,
     actionType: 'pagination' | 'getCell' | 'findRow' | 'default'
-): number {
-    if (!config.debug?.slow) return 0;
-
-    if (typeof config.debug.slow === 'number') {
-        return config.debug.slow;
-    }
-
-    return config.debug.slow[actionType] ?? config.debug.slow.default ?? 0;
-}
+): number {}
 
 /**
killedBy: debugUtils (merged) getDebugDelay returns correct values for various configs
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BooleanLiteral
src/utils/debugUtils.ts:11:9
     config: FinalTableConfig,
     actionType: 'pagination' | 'getCell' | 'findRow' | 'default'
 ): number {
-    if (!config.debug?.slow) return 0;
+    if (config.debug?.slow) return 0;
 
     if (typeof config.debug.slow === 'number') {
killedBy: debugUtils (merged) getDebugDelay returns correct values for various configs
statusReason: Cannot read properties of undefined (reading 'slow')

[Killed] OptionalChaining
src/utils/debugUtils.ts:11:10
     config: FinalTableConfig,
     actionType: 'pagination' | 'getCell' | 'findRow' | 'default'
 ): number {
-    if (!config.debug?.slow) return 0;
+    if (!config.debug.slow) return 0;
 
     if (typeof config.debug.slow === 'number') {
killedBy: debugUtils (merged) getDebugDelay returns correct values for various configs
statusReason: Cannot read properties of undefined (reading 'slow')

[Killed] BlockStatement
src/utils/debugUtils.ts:13:48
 ): number {
     if (!config.debug?.slow) return 0;
 
-    if (typeof config.debug.slow === 'number') {
-        return config.debug.slow;
-    }
+    if (typeof config.debug.slow === 'number') {}
 
     return config.debug.slow[actionType] ?? config.debug.slow.default ?? 0;
killedBy: debugUtils (merged) getDebugDelay returns correct values for various configs
statusReason: expected +0 to be 100 // Object.is equality

[Killed] EqualityOperator
src/utils/debugUtils.ts:13:9
 ): number {
     if (!config.debug?.slow) return 0;
 
-    if (typeof config.debug.slow === 'number') {
+    if (typeof config.debug.slow !== 'number') {
         return config.debug.slow;
     }
killedBy: debugUtils (merged) getDebugDelay returns correct values for various configs
statusReason: expected +0 to be 100 // Object.is equality

[Killed] LogicalOperator
src/utils/debugUtils.ts:17:12
         return config.debug.slow;
     }
 
-    return config.debug.slow[actionType] ?? config.debug.slow.default ?? 0;
+    return config.debug.slow[actionType] && config.debug.slow.default ?? 0;
 }
 
killedBy: debugUtils (merged) getDebugDelay returns correct values for various configs
statusReason: expected 5 to be 50 // Object.is equality

[Killed] LogicalOperator
src/utils/debugUtils.ts:17:12
         return config.debug.slow;
     }
 
-    return config.debug.slow[actionType] ?? config.debug.slow.default ?? 0;
+    return (config.debug.slow[actionType] ?? config.debug.slow.default) && 0;
 }
 
killedBy: debugUtils (merged) getDebugDelay returns correct values for various configs
statusReason: expected +0 to be 50 // Object.is equality

[Survived] BlockStatement
src/utils/debugUtils.ts:26:3
 export async function debugDelay(
     config: FinalTableConfig,
     actionType: 'pagination' | 'getCell' | 'findRow' | 'default'
-) {
-    const delay = getDebugDelay(config, actionType);
-    if (delay > 0) {
-        await new Promise(resolve => setTimeout(resolve, delay));
-    }
-}
+) {}
 
 /**

[Survived] ConditionalExpression
src/utils/debugUtils.ts:28:9
     actionType: 'pagination' | 'getCell' | 'findRow' | 'default'
 ) {
     const delay = getDebugDelay(config, actionType);
-    if (delay > 0) {
+    if (true) {
         await new Promise(resolve => setTimeout(resolve, delay));
     }

[Survived] EqualityOperator
src/utils/debugUtils.ts:28:9
     actionType: 'pagination' | 'getCell' | 'findRow' | 'default'
 ) {
     const delay = getDebugDelay(config, actionType);
-    if (delay > 0) {
+    if (delay <= 0) {
         await new Promise(resolve => setTimeout(resolve, delay));
     }

[Killed] ArrowFunction
src/utils/debugUtils.ts:29:27
 ) {
     const delay = getDebugDelay(config, actionType);
     if (delay > 0) {
-        await new Promise(resolve => setTimeout(resolve, delay));
+        await new Promise(() => undefined);
     }
 }
killedBy: debugUtils (merged) debugDelay waits when delay > 0 (deterministic via fake timers)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/utils/debugUtils.ts:41:3
     level: 'error' | 'info' | 'verbose',
     message: string,
     data?: any
-) {
-    const logLevel = config.debug?.logLevel ?? 'none';
-    const levels = { none: 0, error: 1, info: 2, verbose: 3 };
-
-    if (levels[logLevel] >= levels[level]) {
-        const prefix = level === 'error' ? '❌' : level === 'info' ? 'ℹ️' : '🔍';
-        const timestamp = new Date().toISOString().split('T')[1].split('.')[0];
-        console.log(`${prefix} [${timestamp}] [SmartTable] ${message}`, data ?? '');
-    }
-}
+) {}
 
 /**
killedBy: debugUtils (merged) logDebug respects logLevel and prints messages
statusReason: expected "log" to be called at least once

[Killed] OptionalChaining
src/utils/debugUtils.ts:42:22
     message: string,
     data?: any
 ) {
-    const logLevel = config.debug?.logLevel ?? 'none';
+    const logLevel = config.debug.logLevel ?? 'none';
     const levels = { none: 0, error: 1, info: 2, verbose: 3 };
 
killedBy: TableMapper.processHeaders/getMap maps headers and applies headerTransformer
statusReason: Cannot read properties of undefined (reading 'logLevel')

[Killed] LogicalOperator
src/utils/debugUtils.ts:42:22
     message: string,
     data?: any
 ) {
-    const logLevel = config.debug?.logLevel ?? 'none';
+    const logLevel = config.debug?.logLevel && 'none';
     const levels = { none: 0, error: 1, info: 2, verbose: 3 };
 
killedBy: debugUtils (merged) logDebug respects logLevel and prints messages
statusReason: expected "log" to be called at least once

[Killed] ConditionalExpression
src/utils/debugUtils.ts:45:9
     const logLevel = config.debug?.logLevel ?? 'none';
     const levels = { none: 0, error: 1, info: 2, verbose: 3 };
 
-    if (levels[logLevel] >= levels[level]) {
+    if (false) {
         const prefix = level === 'error' ? '❌' : level === 'info' ? 'ℹ️' : '🔍';
         const timestamp = new Date().toISOString().split('T')[1].split('.')[0];
killedBy: debugUtils (merged) logDebug respects logLevel and prints messages
statusReason: expected "log" to be called at least once

[Killed] EqualityOperator
src/utils/debugUtils.ts:45:9
     const logLevel = config.debug?.logLevel ?? 'none';
     const levels = { none: 0, error: 1, info: 2, verbose: 3 };
 
-    if (levels[logLevel] >= levels[level]) {
+    if (levels[logLevel] < levels[level]) {
         const prefix = level === 'error' ? '❌' : level === 'info' ? 'ℹ️' : '🔍';
         const timestamp = new Date().toISOString().split('T')[1].split('.')[0];
killedBy: debugUtils (merged) logDebug respects logLevel and prints messages
statusReason: expected "log" to be called at least once

[Survived] EqualityOperator
src/utils/debugUtils.ts:46:50
     const levels = { none: 0, error: 1, info: 2, verbose: 3 };
 
     if (levels[logLevel] >= levels[level]) {
-        const prefix = level === 'error' ? '❌' : level === 'info' ? 'ℹ️' : '🔍';
+        const prefix = level === 'error' ? '❌' : level !== 'info' ? 'ℹ️' : '🔍';
         const timestamp = new Date().toISOString().split('T')[1].split('.')[0];
         console.log(`${prefix} [${timestamp}] [SmartTable] ${message}`, data ?? '');

[Survived] ConditionalExpression
src/utils/debugUtils.ts:46:24
     const levels = { none: 0, error: 1, info: 2, verbose: 3 };
 
     if (levels[logLevel] >= levels[level]) {
-        const prefix = level === 'error' ? '❌' : level === 'info' ? 'ℹ️' : '🔍';
+        const prefix = true ? '❌' : level === 'info' ? 'ℹ️' : '🔍';
         const timestamp = new Date().toISOString().split('T')[1].split('.')[0];
         console.log(`${prefix} [${timestamp}] [SmartTable] ${message}`, data ?? '');

[Survived] LogicalOperator
src/utils/debugUtils.ts:48:73
     if (levels[logLevel] >= levels[level]) {
         const prefix = level === 'error' ? '❌' : level === 'info' ? 'ℹ️' : '🔍';
         const timestamp = new Date().toISOString().split('T')[1].split('.')[0];
-        console.log(`${prefix} [${timestamp}] [SmartTable] ${message}`, data ?? '');
+        console.log(`${prefix} [${timestamp}] [SmartTable] ${message}`, data && '');
     }
 }

[Killed] StringLiteral
src/utils/debugUtils.ts:48:21
     if (levels[logLevel] >= levels[level]) {
         const prefix = level === 'error' ? '❌' : level === 'info' ? 'ℹ️' : '🔍';
         const timestamp = new Date().toISOString().split('T')[1].split('.')[0];
-        console.log(`${prefix} [${timestamp}] [SmartTable] ${message}`, data ?? '');
+        console.log(``, data ?? '');
     }
 }
killedBy: Iteration engine verbose logging runMap emits "map: starting" under verbose
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/debugUtils.ts:55:59
 /**
  * Warn if debug.slow is enabled in CI environment
  */
-export function warnIfDebugInCI(config: FinalTableConfig) {
-    if (process.env.CI === 'true' && config.debug?.slow) {
-        console.warn(
-            '⚠️  [SmartTable] Warning: debug.slow is enabled in CI environment.\n' +
-            '   This will significantly slow down test execution.\n' +
-            '   Consider disabling debug mode in CI.'
-        );
-    }
-}
+export function warnIfDebugInCI(config: FinalTableConfig) {}
 
killedBy: debugUtils (merged) warnIfDebugInCI warns when CI=true and slow is set
statusReason: expected "warn" to be called at least once

[Killed] ConditionalExpression
src/utils/debugUtils.ts:56:9
  * Warn if debug.slow is enabled in CI environment
  */
 export function warnIfDebugInCI(config: FinalTableConfig) {
-    if (process.env.CI === 'true' && config.debug?.slow) {
+    if (false) {
         console.warn(
             '⚠️  [SmartTable] Warning: debug.slow is enabled in CI environment.\n' +
killedBy: debugUtils (merged) warnIfDebugInCI warns when CI=true and slow is set
statusReason: expected "warn" to be called at least once

[Killed] BlockStatement
src/utils/debugUtils.ts:56:58
  * Warn if debug.slow is enabled in CI environment
  */
 export function warnIfDebugInCI(config: FinalTableConfig) {
-    if (process.env.CI === 'true' && config.debug?.slow) {
-        console.warn(
-            '⚠️  [SmartTable] Warning: debug.slow is enabled in CI environment.\n' +
-            '   This will significantly slow down test execution.\n' +
-            '   Consider disabling debug mode in CI.'
-        );
-    }
+    if (process.env.CI === 'true' && config.debug?.slow) {}
 }
 
killedBy: debugUtils (merged) warnIfDebugInCI warns when CI=true and slow is set
statusReason: expected "warn" to be called at least once

[Survived] StringLiteral
src/utils/debugUtils.ts:58:13
 export function warnIfDebugInCI(config: FinalTableConfig) {
     if (process.env.CI === 'true' && config.debug?.slow) {
         console.warn(
-            '⚠️  [SmartTable] Warning: debug.slow is enabled in CI environment.\n' +
+            "" +
             '   This will significantly slow down test execution.\n' +
             '   Consider disabling debug mode in CI.'

[Survived] StringLiteral
src/utils/debugUtils.ts:60:13
         console.warn(
             '⚠️  [SmartTable] Warning: debug.slow is enabled in CI environment.\n' +
             '   This will significantly slow down test execution.\n' +
-            '   Consider disabling debug mode in CI.'
+            ""
         );
     }
