[NoCoverage] BlockStatement
src/utils/elementTracker.ts:6:37
 export class ElementTracker {
     public readonly id: string;
 
-    constructor(prefix = 'tracker') {
-        this.id = `__smartTable_${prefix}_${Date.now()}_${Math.random().toString(36).substring(2, 9)}`;
-    }
+    constructor(prefix = 'tracker') {}
 
     /**

[NoCoverage] StringLiteral
src/utils/elementTracker.ts:6:26
 export class ElementTracker {
     public readonly id: string;
 
-    constructor(prefix = 'tracker') {
+    constructor(prefix = "") {
         this.id = `__smartTable_${prefix}_${Date.now()}_${Math.random().toString(36).substring(2, 9)}`;
     }

[NoCoverage] MethodExpression
src/utils/elementTracker.ts:7:59
     public readonly id: string;
 
     constructor(prefix = 'tracker') {
-        this.id = `__smartTable_${prefix}_${Date.now()}_${Math.random().toString(36).substring(2, 9)}`;
+        this.id = `__smartTable_${prefix}_${Date.now()}_${Math.random().toString(36)}`;
     }
 

[NoCoverage] BlockStatement
src/utils/elementTracker.ts:15:73
      * in a WeakMap. This gracefully handles both append-only DOMs (by identity) and 
      * virtualized DOMs (by text signature if nodes are recycled).
      */
-    public async getUnseenIndices(locators: Locator): Promise<number[]> {
-        return await locators.evaluateAll((elements, trackerId) => {
-            const win = window as any;
-            if (!win[trackerId]) {
-                win[trackerId] = new WeakMap<Element, string>();
-            }
-            const seenMap = win[trackerId] as WeakMap<Element, string>;
-            const newIndices: number[] = [];
-
-            elements.forEach((el, index) => {
-                // Determine a lightweight signature for the row (textContent strips HTML, fast)
-                const signature = el.textContent || '';
-
-                // If it's a new element, OR a recycled element with new data
-                if (seenMap.get(el) !== signature) {
-                    seenMap.set(el, signature);
-                    newIndices.push(index);
-                }
-            });
-
-            return newIndices;
-        }, this.id);
-    }
+    public async getUnseenIndices(locators: Locator): Promise<number[]> {}
 
     /**

[NoCoverage] BlockStatement
src/utils/elementTracker.ts:16:68
      * virtualized DOMs (by text signature if nodes are recycled).
      */
     public async getUnseenIndices(locators: Locator): Promise<number[]> {
-        return await locators.evaluateAll((elements, trackerId) => {
-            const win = window as any;
-            if (!win[trackerId]) {
-                win[trackerId] = new WeakMap<Element, string>();
-            }
-            const seenMap = win[trackerId] as WeakMap<Element, string>;
-            const newIndices: number[] = [];
-
-            elements.forEach((el, index) => {
-                // Determine a lightweight signature for the row (textContent strips HTML, fast)
-                const signature = el.textContent || '';
-
-                // If it's a new element, OR a recycled element with new data
-                if (seenMap.get(el) !== signature) {
-                    seenMap.set(el, signature);
-                    newIndices.push(index);
-                }
-            });
-
-            return newIndices;
-        }, this.id);
+        return await locators.evaluateAll((elements, trackerId) => {}, this.id);
     }
 

[NoCoverage] ConditionalExpression
src/utils/elementTracker.ts:18:17
     public async getUnseenIndices(locators: Locator): Promise<number[]> {
         return await locators.evaluateAll((elements, trackerId) => {
             const win = window as any;
-            if (!win[trackerId]) {
+            if (false) {
                 win[trackerId] = new WeakMap<Element, string>();
             }

[NoCoverage] BlockStatement
src/utils/elementTracker.ts:18:34
     public async getUnseenIndices(locators: Locator): Promise<number[]> {
         return await locators.evaluateAll((elements, trackerId) => {
             const win = window as any;
-            if (!win[trackerId]) {
-                win[trackerId] = new WeakMap<Element, string>();
-            }
+            if (!win[trackerId]) {}
             const seenMap = win[trackerId] as WeakMap<Element, string>;
             const newIndices: number[] = [];

[NoCoverage] BlockStatement
src/utils/elementTracker.ts:24:45
             const seenMap = win[trackerId] as WeakMap<Element, string>;
             const newIndices: number[] = [];
 
-            elements.forEach((el, index) => {
-                // Determine a lightweight signature for the row (textContent strips HTML, fast)
-                const signature = el.textContent || '';
-
-                // If it's a new element, OR a recycled element with new data
-                if (seenMap.get(el) !== signature) {
-                    seenMap.set(el, signature);
-                    newIndices.push(index);
-                }
-            });
+            elements.forEach((el, index) => {});
 
             return newIndices;

[NoCoverage] ConditionalExpression
src/utils/elementTracker.ts:26:35
 
             elements.forEach((el, index) => {
                 // Determine a lightweight signature for the row (textContent strips HTML, fast)
-                const signature = el.textContent || '';
+                const signature = true;
 
                 // If it's a new element, OR a recycled element with new data

[NoCoverage] ConditionalExpression
src/utils/elementTracker.ts:26:35
 
             elements.forEach((el, index) => {
                 // Determine a lightweight signature for the row (textContent strips HTML, fast)
-                const signature = el.textContent || '';
+                const signature = false;
 
                 // If it's a new element, OR a recycled element with new data

[NoCoverage] BlockStatement
src/utils/elementTracker.ts:29:52
                 const signature = el.textContent || '';
 
                 // If it's a new element, OR a recycled element with new data
-                if (seenMap.get(el) !== signature) {
-                    seenMap.set(el, signature);
-                    newIndices.push(index);
-                }
+                if (seenMap.get(el) !== signature) {}
             });
 

[NoCoverage] ConditionalExpression
src/utils/elementTracker.ts:29:21
                 const signature = el.textContent || '';
 
                 // If it's a new element, OR a recycled element with new data
-                if (seenMap.get(el) !== signature) {
+                if (false) {
                     seenMap.set(el, signature);
                     newIndices.push(index);

[NoCoverage] BlockStatement
src/utils/elementTracker.ts:42:52
     /**
      * Cleans up the tracking map from the browser window object.
      */
-    public async cleanup(page: any): Promise<void> {
-        try {
-            await page.evaluate((trackerId: string) => {
-                delete (window as any)[trackerId];
-            }, this.id);
-        } catch (e) {
-            // Ignore context destroyed errors during cleanup
-        }
-    }
+    public async cleanup(page: any): Promise<void> {}
 }
 

[NoCoverage] BlockStatement
src/utils/elementTracker.ts:43:13
      * Cleans up the tracking map from the browser window object.
      */
     public async cleanup(page: any): Promise<void> {
-        try {
-            await page.evaluate((trackerId: string) => {
-                delete (window as any)[trackerId];
-            }, this.id);
-        } catch (e) {
+        try {} catch (e) {
             // Ignore context destroyed errors during cleanup
         }

[NoCoverage] BlockStatement
src/utils/elementTracker.ts:44:56
      */
     public async cleanup(page: any): Promise<void> {
         try {
-            await page.evaluate((trackerId: string) => {
-                delete (window as any)[trackerId];
-            }, this.id);
+            await page.evaluate((trackerId: string) => {}, this.id);
         } catch (e) {
             // Ignore context destroyed errors during cleanup
