[Killed] ConditionalExpression
src/utils/paginationPath.ts:22:7
   targetPageIndex: number,
   primitives: PaginationPrimitives
 ): NavigationStep[] {
-  if (currentPageIndex === targetPageIndex) return [];
+  if (false) return [];
 
   if (primitives.goToPage) {
killedBy: planNavigationPath same page returns empty path when current equals target
statusReason: expected [ { type: 'goPrevious', count: +0 } ] to deeply equal []

[Killed] ConditionalExpression
src/utils/paginationPath.ts:22:7
   targetPageIndex: number,
   primitives: PaginationPrimitives
 ): NavigationStep[] {
-  if (currentPageIndex === targetPageIndex) return [];
+  if (true) return [];
 
   if (primitives.goToPage) {
killedBy: planNavigationPath when goToPage is present returns single goToPage step
statusReason: expected [] to deeply equal [ { type: 'goToPage', pageIndex: 38 } ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:24:7
 ): NavigationStep[] {
   if (currentPageIndex === targetPageIndex) return [];
 
-  if (primitives.goToPage) {
+  if (false) {
     return [{ type: 'goToPage', pageIndex: targetPageIndex }];
   }
killedBy: planNavigationPath when goToPage is present returns single goToPage step
statusReason: expected [ { type: 'goNext', count: 38 } ] to deeply equal [ { type: 'goToPage', pageIndex: 38 } ]

[Killed] StringLiteral
src/utils/paginationPath.ts:25:21
   if (currentPageIndex === targetPageIndex) return [];
 
   if (primitives.goToPage) {
-    return [{ type: 'goToPage', pageIndex: targetPageIndex }];
+    return [{ type: "", pageIndex: targetPageIndex }];
   }
 
killedBy: planNavigationPath when goToPage is present returns single goToPage step
statusReason: expected [ { type: '', pageIndex: 38 } ] to deeply equal [ { type: 'goToPage', pageIndex: 38 } ]

[Killed] ArrayDeclaration
src/utils/paginationPath.ts:25:12
   if (currentPageIndex === targetPageIndex) return [];
 
   if (primitives.goToPage) {
-    return [{ type: 'goToPage', pageIndex: targetPageIndex }];
+    return [];
   }
 
killedBy: planNavigationPath when goToPage is present returns single goToPage step
statusReason: expected [] to deeply equal [ { type: 'goToPage', pageIndex: 38 } ]

[Killed] LogicalOperator
src/utils/paginationPath.ts:28:24
     return [{ type: 'goToPage', pageIndex: targetPageIndex }];
   }
 
-  const nextBulkSize = primitives.nextBulkPages ?? 1;
+  const nextBulkSize = primitives.nextBulkPages && 1;
   const prevBulkSize = primitives.previousBulkPages ?? 1;
 
killedBy: planNavigationPath forward (target > current) uses goNext only when bulk would overshoot and no goPrevious (3→12, bulk 10)
statusReason: expected [ { type: 'goNextBulk', count: 9 } ] to deeply equal [ { type: 'goNext', count: 9 } ]

[Killed] LogicalOperator
src/utils/paginationPath.ts:29:24
   }
 
   const nextBulkSize = primitives.nextBulkPages ?? 1;
-  const prevBulkSize = primitives.previousBulkPages ?? 1;
+  const prevBulkSize = primitives.previousBulkPages && 1;
 
   if (targetPageIndex > currentPageIndex) {
killedBy: planNavigationPath backward (target < current) uses goPrevious only when bulk would overshoot and no goNext (12→3, bulk 10)
statusReason: expected [ Array(1) ] to deeply equal [ { type: 'goPrevious', count: 9 } ]

[Killed] EqualityOperator
src/utils/paginationPath.ts:31:7
   const nextBulkSize = primitives.nextBulkPages ?? 1;
   const prevBulkSize = primitives.previousBulkPages ?? 1;
 
-  if (targetPageIndex > currentPageIndex) {
+  if (targetPageIndex <= currentPageIndex) {
     // Forward: current → target
     const stepsForward = targetPageIndex - currentPageIndex;
killedBy: planNavigationPath forward (target > current) uses only goNext when no bulk
statusReason: expected [] to deeply equal [ { type: 'goNext', count: 5 } ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:31:7
   const nextBulkSize = primitives.nextBulkPages ?? 1;
   const prevBulkSize = primitives.previousBulkPages ?? 1;
 
-  if (targetPageIndex > currentPageIndex) {
+  if (true) {
     // Forward: current → target
     const stepsForward = targetPageIndex - currentPageIndex;
killedBy: planNavigationPath backward (target < current) uses only goPrevious when no bulk
statusReason: expected [] to deeply equal [ { type: 'goPrevious', count: 5 } ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:33:26
 
   if (targetPageIndex > currentPageIndex) {
     // Forward: current → target
-    const stepsForward = targetPageIndex - currentPageIndex;
+    const stepsForward = targetPageIndex + currentPageIndex;
     const hasBulk = !!(primitives.goNextBulk && nextBulkSize > 0);
     const hasPrev = !!primitives.goPrevious;
killedBy: planNavigationPath forward (target > current) uses goNext only when bulk would overshoot and no goPrevious (3→12, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ { type: 'goNext', count: 9 } ]

[Killed] BooleanLiteral
src/utils/paginationPath.ts:34:21
   if (targetPageIndex > currentPageIndex) {
     // Forward: current → target
     const stepsForward = targetPageIndex - currentPageIndex;
-    const hasBulk = !!(primitives.goNextBulk && nextBulkSize > 0);
+    const hasBulk = !(primitives.goNextBulk && nextBulkSize > 0);
     const hasPrev = !!primitives.goPrevious;
 
killedBy: planNavigationPath forward (target > current) uses only goNext when no bulk
statusReason: expected [ { type: 'goNextBulk', count: 5 } ] to deeply equal [ { type: 'goNext', count: 5 } ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:34:24
   if (targetPageIndex > currentPageIndex) {
     // Forward: current → target
     const stepsForward = targetPageIndex - currentPageIndex;
-    const hasBulk = !!(primitives.goNextBulk && nextBulkSize > 0);
+    const hasBulk = !!(false);
     const hasPrev = !!primitives.goPrevious;
 
killedBy: planNavigationPath forward (target > current) uses goNextBulk + goPrevious when overshoot is cheaper and goPrevious exists (3→12, bulk 10)
statusReason: expected [ { type: 'goNext', count: 9 } ] to deeply equal [ …(2) ]

[Killed] BooleanLiteral
src/utils/paginationPath.ts:35:22
     // Forward: current → target
     const stepsForward = targetPageIndex - currentPageIndex;
     const hasBulk = !!(primitives.goNextBulk && nextBulkSize > 0);
-    const hasPrev = !!primitives.goPrevious;
+    const hasPrev = !primitives.goPrevious;
 
     if (!hasBulk || nextBulkSize <= 0) {
killedBy: planNavigationPath forward (target > current) uses goNextBulk + goPrevious when overshoot is cheaper and goPrevious exists (3→12, bulk 10)
statusReason: expected [ { type: 'goNext', count: 9 } ] to deeply equal [ …(2) ]

[Killed] EqualityOperator
src/utils/paginationPath.ts:37:21
     const hasBulk = !!(primitives.goNextBulk && nextBulkSize > 0);
     const hasPrev = !!primitives.goPrevious;
 
-    if (!hasBulk || nextBulkSize <= 0) {
+    if (!hasBulk || nextBulkSize > 0) {
       if (primitives.goNext) {
         return [{ type: 'goNext', count: stepsForward }];
killedBy: planNavigationPath forward (target > current) uses goNextBulk + goPrevious when overshoot is cheaper and goPrevious exists (3→12, bulk 10)
statusReason: expected [ { type: 'goNext', count: 9 } ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:37:9
     const hasBulk = !!(primitives.goNextBulk && nextBulkSize > 0);
     const hasPrev = !!primitives.goPrevious;
 
-    if (!hasBulk || nextBulkSize <= 0) {
+    if (true) {
       if (primitives.goNext) {
         return [{ type: 'goNext', count: stepsForward }];
killedBy: planNavigationPath forward (target > current) uses goNextBulk + goPrevious when overshoot is cheaper and goPrevious exists (3→12, bulk 10)
statusReason: expected [ { type: 'goNext', count: 9 } ] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/utils/paginationPath.ts:38:30
     const hasPrev = !!primitives.goPrevious;
 
     if (!hasBulk || nextBulkSize <= 0) {
-      if (primitives.goNext) {
-        return [{ type: 'goNext', count: stepsForward }];
-      }
+      if (primitives.goNext) {}
       return [];
     }
killedBy: planNavigationPath forward (target > current) uses only goNext when no bulk
statusReason: expected [] to deeply equal [ { type: 'goNext', count: 5 } ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:38:11
     const hasPrev = !!primitives.goPrevious;
 
     if (!hasBulk || nextBulkSize <= 0) {
-      if (primitives.goNext) {
+      if (false) {
         return [{ type: 'goNext', count: stepsForward }];
       }
killedBy: planNavigationPath forward (target > current) uses only goNext when no bulk
statusReason: expected [] to deeply equal [ { type: 'goNext', count: 5 } ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:44:35
       return [];
     }
 
-    const bulkCountA = Math.floor(stepsForward / nextBulkSize);
+    const bulkCountA = Math.floor(stepsForward * nextBulkSize);
     const remA = stepsForward % nextBulkSize;
     const totalA = bulkCountA + remA;
killedBy: planNavigationPath forward (target > current) uses goNext only when bulk would overshoot and no goPrevious (3→12, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ { type: 'goNext', count: 9 } ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:45:18
     }
 
     const bulkCountA = Math.floor(stepsForward / nextBulkSize);
-    const remA = stepsForward % nextBulkSize;
+    const remA = stepsForward * nextBulkSize;
     const totalA = bulkCountA + remA;
 
killedBy: planNavigationPath forward (target > current) uses goNext only when bulk would overshoot and no goPrevious (3→12, bulk 10)
statusReason: expected [ { type: 'goNext', count: 90 } ] to deeply equal [ { type: 'goNext', count: 9 } ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:46:20
 
     const bulkCountA = Math.floor(stepsForward / nextBulkSize);
     const remA = stepsForward % nextBulkSize;
-    const totalA = bulkCountA + remA;
+    const totalA = bulkCountA - remA;
 
     let totalB = Infinity;
killedBy: planNavigationPath forward (target > current) uses goNextBulk + goPrevious when overshoot is cheaper and goPrevious exists (3→12, bulk 10)
statusReason: expected [ { type: 'goNext', count: 9 } ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:51:9
     let totalB = Infinity;
     let bulkCountB = 0;
     let overB = 0;
-    if (hasPrev && primitives.goPreviousBulk && prevBulkSize > 0) {
+    if (false) {
       bulkCountB = Math.ceil(stepsForward / nextBulkSize);
       overB = bulkCountB * nextBulkSize - stepsForward;
killedBy: planNavigationPath forward (target > current) uses goNextBulk + goPrevious when overshoot is cheaper and goPrevious exists (3→12, bulk 10)
statusReason: expected [ { type: 'goNext', count: 9 } ] to deeply equal [ …(2) ]

[Killed] EqualityOperator
src/utils/paginationPath.ts:51:49
     let totalB = Infinity;
     let bulkCountB = 0;
     let overB = 0;
-    if (hasPrev && primitives.goPreviousBulk && prevBulkSize > 0) {
+    if (hasPrev && primitives.goPreviousBulk && prevBulkSize <= 0) {
       bulkCountB = Math.ceil(stepsForward / nextBulkSize);
       overB = bulkCountB * nextBulkSize - stepsForward;
killedBy: planNavigationPath forward (target > current) uses goNextBulk + goPrevious when overshoot is cheaper and goPrevious exists (3→12, bulk 10)
statusReason: expected [ { type: 'goNext', count: 9 } ] to deeply equal [ …(2) ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:52:30
     let bulkCountB = 0;
     let overB = 0;
     if (hasPrev && primitives.goPreviousBulk && prevBulkSize > 0) {
-      bulkCountB = Math.ceil(stepsForward / nextBulkSize);
+      bulkCountB = Math.ceil(stepsForward * nextBulkSize);
       overB = bulkCountB * nextBulkSize - stepsForward;
       totalB = bulkCountB + overB;
killedBy: planNavigationPath forward (target > current) uses goNextBulk + goPrevious when overshoot is cheaper and goPrevious exists (3→12, bulk 10)
statusReason: expected [ { type: 'goNext', count: 9 } ] to deeply equal [ …(2) ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:53:15
     let overB = 0;
     if (hasPrev && primitives.goPreviousBulk && prevBulkSize > 0) {
       bulkCountB = Math.ceil(stepsForward / nextBulkSize);
-      overB = bulkCountB * nextBulkSize - stepsForward;
+      overB = bulkCountB / nextBulkSize - stepsForward;
       totalB = bulkCountB + overB;
     }
killedBy: planNavigationPath forward (target > current) uses goNextBulk + goPrevious when overshoot is cheaper and goPrevious exists (3→12, bulk 10)
statusReason: expected [ { type: 'goNextBulk', count: 1 } ] to deeply equal [ …(2) ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:53:15
     let overB = 0;
     if (hasPrev && primitives.goPreviousBulk && prevBulkSize > 0) {
       bulkCountB = Math.ceil(stepsForward / nextBulkSize);
-      overB = bulkCountB * nextBulkSize - stepsForward;
+      overB = bulkCountB * nextBulkSize + stepsForward;
       totalB = bulkCountB + overB;
     }
killedBy: planNavigationPath forward (target > current) uses goNextBulk + goPrevious when overshoot is cheaper and goPrevious exists (3→12, bulk 10)
statusReason: expected [ { type: 'goNext', count: 9 } ] to deeply equal [ …(2) ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:54:16
     if (hasPrev && primitives.goPreviousBulk && prevBulkSize > 0) {
       bulkCountB = Math.ceil(stepsForward / nextBulkSize);
       overB = bulkCountB * nextBulkSize - stepsForward;
-      totalB = bulkCountB + overB;
+      totalB = bulkCountB - overB;
     }
 
killedBy: planNavigationPath forward (target > current) uses goNextBulk then goNext for exact remainder (3→35, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:57:9
       totalB = bulkCountB + overB;
     }
 
-    if (totalB < totalA) {
+    if (true) {
       const path: NavigationStep[] = [];
       if (bulkCountB > 0) path.push({ type: 'goNextBulk', count: bulkCountB });
killedBy: planNavigationPath forward (target > current) uses goNext only when bulk would overshoot and no goPrevious (3→12, bulk 10)
statusReason: expected [] to deeply equal [ { type: 'goNext', count: 9 } ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:57:9
       totalB = bulkCountB + overB;
     }
 
-    if (totalB < totalA) {
+    if (false) {
       const path: NavigationStep[] = [];
       if (bulkCountB > 0) path.push({ type: 'goNextBulk', count: bulkCountB });
killedBy: planNavigationPath forward (target > current) uses goNextBulk + goPrevious when overshoot is cheaper and goPrevious exists (3→12, bulk 10)
statusReason: expected [ { type: 'goNext', count: 9 } ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:59:11
 
     if (totalB < totalA) {
       const path: NavigationStep[] = [];
-      if (bulkCountB > 0) path.push({ type: 'goNextBulk', count: bulkCountB });
+      if (false) path.push({ type: 'goNextBulk', count: bulkCountB });
       if (overB > 0) path.push({ type: 'goPrevious', count: overB });
       return path;
killedBy: planNavigationPath forward (target > current) uses goNextBulk + goPrevious when overshoot is cheaper and goPrevious exists (3→12, bulk 10)
statusReason: expected [ { type: 'goPrevious', count: 1 } ] to deeply equal [ …(2) ]

[Killed] EqualityOperator
src/utils/paginationPath.ts:59:11
 
     if (totalB < totalA) {
       const path: NavigationStep[] = [];
-      if (bulkCountB > 0) path.push({ type: 'goNextBulk', count: bulkCountB });
+      if (bulkCountB <= 0) path.push({ type: 'goNextBulk', count: bulkCountB });
       if (overB > 0) path.push({ type: 'goPrevious', count: overB });
       return path;
killedBy: planNavigationPath forward (target > current) uses goNextBulk + goPrevious when overshoot is cheaper and goPrevious exists (3→12, bulk 10)
statusReason: expected [ { type: 'goPrevious', count: 1 } ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:60:11
     if (totalB < totalA) {
       const path: NavigationStep[] = [];
       if (bulkCountB > 0) path.push({ type: 'goNextBulk', count: bulkCountB });
-      if (overB > 0) path.push({ type: 'goPrevious', count: overB });
+      if (false) path.push({ type: 'goPrevious', count: overB });
       return path;
     }
killedBy: planNavigationPath forward (target > current) uses goNextBulk + goPrevious when overshoot is cheaper and goPrevious exists (3→12, bulk 10)
statusReason: expected [ { type: 'goNextBulk', count: 1 } ] to deeply equal [ …(2) ]

[Killed] EqualityOperator
src/utils/paginationPath.ts:60:11
     if (totalB < totalA) {
       const path: NavigationStep[] = [];
       if (bulkCountB > 0) path.push({ type: 'goNextBulk', count: bulkCountB });
-      if (overB > 0) path.push({ type: 'goPrevious', count: overB });
+      if (overB <= 0) path.push({ type: 'goPrevious', count: overB });
       return path;
     }
killedBy: planNavigationPath forward (target > current) uses goNextBulk + goPrevious when overshoot is cheaper and goPrevious exists (3→12, bulk 10)
statusReason: expected [ { type: 'goNextBulk', count: 1 } ] to deeply equal [ …(2) ]

[Killed] ArrayDeclaration
src/utils/paginationPath.ts:64:36
       return path;
     }
 
-    const path: NavigationStep[] = [];
+    const path: NavigationStep[] = ["Stryker was here"];
     if (bulkCountA > 0) path.push({ type: 'goNextBulk', count: bulkCountA });
     if (remA > 0) path.push({ type: 'goNext', count: remA });
killedBy: planNavigationPath forward (target > current) uses goNext only when bulk would overshoot and no goPrevious (3→12, bulk 10)
statusReason: expected [ 'Stryker was here', …(1) ] to deeply equal [ { type: 'goNext', count: 9 } ]

[Killed] EqualityOperator
src/utils/paginationPath.ts:65:9
     }
 
     const path: NavigationStep[] = [];
-    if (bulkCountA > 0) path.push({ type: 'goNextBulk', count: bulkCountA });
+    if (bulkCountA <= 0) path.push({ type: 'goNextBulk', count: bulkCountA });
     if (remA > 0) path.push({ type: 'goNext', count: remA });
     return path;
killedBy: planNavigationPath forward (target > current) uses goNext only when bulk would overshoot and no goPrevious (3→12, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ { type: 'goNext', count: 9 } ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:65:9
     }
 
     const path: NavigationStep[] = [];
-    if (bulkCountA > 0) path.push({ type: 'goNextBulk', count: bulkCountA });
+    if (false) path.push({ type: 'goNextBulk', count: bulkCountA });
     if (remA > 0) path.push({ type: 'goNext', count: remA });
     return path;
killedBy: planNavigationPath forward (target > current) uses goNextBulk then goNext for exact remainder (3→35, bulk 10)
statusReason: expected [ { type: 'goNext', count: 2 } ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:66:9
 
     const path: NavigationStep[] = [];
     if (bulkCountA > 0) path.push({ type: 'goNextBulk', count: bulkCountA });
-    if (remA > 0) path.push({ type: 'goNext', count: remA });
+    if (false) path.push({ type: 'goNext', count: remA });
     return path;
   }
killedBy: planNavigationPath forward (target > current) uses goNext only when bulk would overshoot and no goPrevious (3→12, bulk 10)
statusReason: expected [] to deeply equal [ { type: 'goNext', count: 9 } ]

[Killed] EqualityOperator
src/utils/paginationPath.ts:66:9
 
     const path: NavigationStep[] = [];
     if (bulkCountA > 0) path.push({ type: 'goNextBulk', count: bulkCountA });
-    if (remA > 0) path.push({ type: 'goNext', count: remA });
+    if (remA <= 0) path.push({ type: 'goNext', count: remA });
     return path;
   }
killedBy: planNavigationPath forward (target > current) uses goNext only when bulk would overshoot and no goPrevious (3→12, bulk 10)
statusReason: expected [] to deeply equal [ { type: 'goNext', count: 9 } ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:71:21
   }
 
   // Backward: current → target
-  const stepsBack = currentPageIndex - targetPageIndex;
+  const stepsBack = currentPageIndex + targetPageIndex;
   const hasPrevBulk = !!(primitives.goPreviousBulk && prevBulkSize > 0);
   const hasNext = !!primitives.goNext;
killedBy: planNavigationPath backward (target < current) uses goPrevious only when bulk would overshoot and no goNext (12→3, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ { type: 'goPrevious', count: 9 } ]

[Killed] BooleanLiteral
src/utils/paginationPath.ts:72:24
 
   // Backward: current → target
   const stepsBack = currentPageIndex - targetPageIndex;
-  const hasPrevBulk = !!(primitives.goPreviousBulk && prevBulkSize > 0);
+  const hasPrevBulk = !primitives.goPreviousBulk && prevBulkSize > 0;
   const hasNext = !!primitives.goNext;
 
killedBy: planNavigationPath backward (target < current) uses only goPrevious when no bulk
statusReason: expected [ Array(1) ] to deeply equal [ { type: 'goPrevious', count: 5 } ]

[Killed] LogicalOperator
src/utils/paginationPath.ts:72:26
 
   // Backward: current → target
   const stepsBack = currentPageIndex - targetPageIndex;
-  const hasPrevBulk = !!(primitives.goPreviousBulk && prevBulkSize > 0);
+  const hasPrevBulk = !!(primitives.goPreviousBulk || prevBulkSize > 0);
   const hasNext = !!primitives.goNext;
 
killedBy: planNavigationPath backward (target < current) uses only goPrevious when no bulk
statusReason: expected [ Array(1) ] to deeply equal [ { type: 'goPrevious', count: 5 } ]

[Killed] BooleanLiteral
src/utils/paginationPath.ts:73:20
   // Backward: current → target
   const stepsBack = currentPageIndex - targetPageIndex;
   const hasPrevBulk = !!(primitives.goPreviousBulk && prevBulkSize > 0);
-  const hasNext = !!primitives.goNext;
+  const hasNext = !primitives.goNext;
 
   if (!hasPrevBulk || prevBulkSize <= 0) {
killedBy: planNavigationPath backward (target < current) uses goPrevious only when bulk would overshoot and no goNext (12→3, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ { type: 'goPrevious', count: 9 } ]

[Killed] BlockStatement
src/utils/paginationPath.ts:75:42
   const hasPrevBulk = !!(primitives.goPreviousBulk && prevBulkSize > 0);
   const hasNext = !!primitives.goNext;
 
-  if (!hasPrevBulk || prevBulkSize <= 0) {
-    if (primitives.goPrevious) {
-      return [{ type: 'goPrevious', count: stepsBack }];
-    }
-    // goToFirst + goNext loop is handled by caller (bringIntoView) when path is empty
-    return [];
-  }
+  if (!hasPrevBulk || prevBulkSize <= 0) {}
 
   const bulkCountA = Math.floor(stepsBack / prevBulkSize);
killedBy: planNavigationPath backward (target < current) uses only goPrevious when no bulk
statusReason: expected [ Array(1) ] to deeply equal [ { type: 'goPrevious', count: 5 } ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:75:7
   const hasPrevBulk = !!(primitives.goPreviousBulk && prevBulkSize > 0);
   const hasNext = !!primitives.goNext;
 
-  if (!hasPrevBulk || prevBulkSize <= 0) {
+  if (true) {
     if (primitives.goPrevious) {
       return [{ type: 'goPrevious', count: stepsBack }];
killedBy: planNavigationPath backward (target < current) uses goPreviousBulk once when exact (13→3, bulk 10)
statusReason: expected [ { type: 'goPrevious', count: 10 } ] to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/utils/paginationPath.ts:76:32
   const hasNext = !!primitives.goNext;
 
   if (!hasPrevBulk || prevBulkSize <= 0) {
-    if (primitives.goPrevious) {
-      return [{ type: 'goPrevious', count: stepsBack }];
-    }
+    if (primitives.goPrevious) {}
     // goToFirst + goNext loop is handled by caller (bringIntoView) when path is empty
     return [];
killedBy: planNavigationPath backward (target < current) uses only goPrevious when no bulk
statusReason: expected [] to deeply equal [ { type: 'goPrevious', count: 5 } ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:76:9
   const hasNext = !!primitives.goNext;
 
   if (!hasPrevBulk || prevBulkSize <= 0) {
-    if (primitives.goPrevious) {
+    if (false) {
       return [{ type: 'goPrevious', count: stepsBack }];
     }
killedBy: planNavigationPath backward (target < current) uses only goPrevious when no bulk
statusReason: expected [] to deeply equal [ { type: 'goPrevious', count: 5 } ]

[Killed] ArrayDeclaration
src/utils/paginationPath.ts:77:14
 
   if (!hasPrevBulk || prevBulkSize <= 0) {
     if (primitives.goPrevious) {
-      return [{ type: 'goPrevious', count: stepsBack }];
+      return [];
     }
     // goToFirst + goNext loop is handled by caller (bringIntoView) when path is empty
killedBy: planNavigationPath backward (target < current) uses only goPrevious when no bulk
statusReason: expected [] to deeply equal [ { type: 'goPrevious', count: 5 } ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:83:33
     return [];
   }
 
-  const bulkCountA = Math.floor(stepsBack / prevBulkSize);
+  const bulkCountA = Math.floor(stepsBack * prevBulkSize);
   const remA = stepsBack % prevBulkSize;
   const totalA = bulkCountA + remA;
killedBy: planNavigationPath backward (target < current) uses goPrevious only when bulk would overshoot and no goNext (12→3, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ { type: 'goPrevious', count: 9 } ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:84:16
   }
 
   const bulkCountA = Math.floor(stepsBack / prevBulkSize);
-  const remA = stepsBack % prevBulkSize;
+  const remA = stepsBack * prevBulkSize;
   const totalA = bulkCountA + remA;
 
killedBy: planNavigationPath backward (target < current) uses goPrevious only when bulk would overshoot and no goNext (12→3, bulk 10)
statusReason: expected [ { type: 'goPrevious', count: 90 } ] to deeply equal [ { type: 'goPrevious', count: 9 } ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:85:18
 
   const bulkCountA = Math.floor(stepsBack / prevBulkSize);
   const remA = stepsBack % prevBulkSize;
-  const totalA = bulkCountA + remA;
+  const totalA = bulkCountA - remA;
 
   let totalB = Infinity;
killedBy: planNavigationPath backward (target < current) uses goPreviousBulk + goNext when overshoot is cheaper (19→3, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:90:7
   let totalB = Infinity;
   let bulkCountB = 0;
   let overB = 0;
-  if (hasNext) {
+  if (false) {
     bulkCountB = Math.ceil(stepsBack / prevBulkSize);
     overB = bulkCountB * prevBulkSize - stepsBack;
killedBy: planNavigationPath backward (target < current) uses goPreviousBulk + goNext when overshoot is cheaper (19→3, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:90:7
   let totalB = Infinity;
   let bulkCountB = 0;
   let overB = 0;
-  if (hasNext) {
+  if (true) {
     bulkCountB = Math.ceil(stepsBack / prevBulkSize);
     overB = bulkCountB * prevBulkSize - stepsBack;
killedBy: planNavigationPath backward (target < current) uses goPrevious only when bulk would overshoot and no goNext (12→3, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ { type: 'goPrevious', count: 9 } ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:91:28
   let bulkCountB = 0;
   let overB = 0;
   if (hasNext) {
-    bulkCountB = Math.ceil(stepsBack / prevBulkSize);
+    bulkCountB = Math.ceil(stepsBack * prevBulkSize);
     overB = bulkCountB * prevBulkSize - stepsBack;
     totalB = bulkCountB + overB;
killedBy: planNavigationPath backward (target < current) uses goPreviousBulk + goNext when overshoot is cheaper (19→3, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:92:13
   let overB = 0;
   if (hasNext) {
     bulkCountB = Math.ceil(stepsBack / prevBulkSize);
-    overB = bulkCountB * prevBulkSize - stepsBack;
+    overB = bulkCountB * prevBulkSize + stepsBack;
     totalB = bulkCountB + overB;
   }
killedBy: planNavigationPath backward (target < current) uses goPreviousBulk + goNext when overshoot is cheaper (19→3, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:92:13
   let overB = 0;
   if (hasNext) {
     bulkCountB = Math.ceil(stepsBack / prevBulkSize);
-    overB = bulkCountB * prevBulkSize - stepsBack;
+    overB = bulkCountB / prevBulkSize - stepsBack;
     totalB = bulkCountB + overB;
   }
killedBy: planNavigationPath backward (target < current) uses goPreviousBulk then goPrevious when remainder is small (15→3, bulk 10)
statusReason: expected [ Array(1) ] to deeply equal [ …(2) ]

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:93:14
   if (hasNext) {
     bulkCountB = Math.ceil(stepsBack / prevBulkSize);
     overB = bulkCountB * prevBulkSize - stepsBack;
-    totalB = bulkCountB + overB;
+    totalB = bulkCountB - overB;
   }
 
killedBy: planNavigationPath backward (target < current) uses goPreviousBulk then goPrevious when remainder is small (15→3, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/utils/paginationPath.ts:96:24
     totalB = bulkCountB + overB;
   }
 
-  if (totalB < totalA) {
-    const path: NavigationStep[] = [];
-    if (bulkCountB > 0) path.push({ type: 'goPreviousBulk', count: bulkCountB });
-    if (overB > 0) path.push({ type: 'goNext', count: overB });
-    return path;
-  }
+  if (totalB < totalA) {}
 
   const path: NavigationStep[] = [];
killedBy: planNavigationPath backward (target < current) uses goPreviousBulk + goNext when overshoot is cheaper (19→3, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]
