[Killed] EqualityOperator
src/utils/paginationPath.ts:98:9
 
   if (totalB < totalA) {
     const path: NavigationStep[] = [];
-    if (bulkCountB > 0) path.push({ type: 'goPreviousBulk', count: bulkCountB });
+    if (bulkCountB <= 0) path.push({ type: 'goPreviousBulk', count: bulkCountB });
     if (overB > 0) path.push({ type: 'goNext', count: overB });
     return path;
killedBy: planNavigationPath backward (target < current) uses goPreviousBulk + goNext when overshoot is cheaper (19→3, bulk 10)
statusReason: expected [ { type: 'goNext', count: 4 } ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:98:9
 
   if (totalB < totalA) {
     const path: NavigationStep[] = [];
-    if (bulkCountB > 0) path.push({ type: 'goPreviousBulk', count: bulkCountB });
+    if (false) path.push({ type: 'goPreviousBulk', count: bulkCountB });
     if (overB > 0) path.push({ type: 'goNext', count: overB });
     return path;
killedBy: planNavigationPath backward (target < current) uses goPreviousBulk + goNext when overshoot is cheaper (19→3, bulk 10)
statusReason: expected [ { type: 'goNext', count: 4 } ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:99:9
   if (totalB < totalA) {
     const path: NavigationStep[] = [];
     if (bulkCountB > 0) path.push({ type: 'goPreviousBulk', count: bulkCountB });
-    if (overB > 0) path.push({ type: 'goNext', count: overB });
+    if (false) path.push({ type: 'goNext', count: overB });
     return path;
   }
killedBy: planNavigationPath backward (target < current) uses goPreviousBulk + goNext when overshoot is cheaper (19→3, bulk 10)
statusReason: expected [ Array(1) ] to deeply equal [ …(2) ]

[Killed] EqualityOperator
src/utils/paginationPath.ts:99:9
   if (totalB < totalA) {
     const path: NavigationStep[] = [];
     if (bulkCountB > 0) path.push({ type: 'goPreviousBulk', count: bulkCountB });
-    if (overB > 0) path.push({ type: 'goNext', count: overB });
+    if (overB <= 0) path.push({ type: 'goNext', count: overB });
     return path;
   }
killedBy: planNavigationPath backward (target < current) uses goPreviousBulk + goNext when overshoot is cheaper (19→3, bulk 10)
statusReason: expected [ Array(1) ] to deeply equal [ …(2) ]

[Killed] EqualityOperator
src/utils/paginationPath.ts:104:7
   }
 
   const path: NavigationStep[] = [];
-  if (bulkCountA > 0) path.push({ type: 'goPreviousBulk', count: bulkCountA });
+  if (bulkCountA <= 0) path.push({ type: 'goPreviousBulk', count: bulkCountA });
   if (remA > 0) path.push({ type: 'goPrevious', count: remA });
   return path;
killedBy: planNavigationPath backward (target < current) uses goPrevious only when bulk would overshoot and no goNext (12→3, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ { type: 'goPrevious', count: 9 } ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:104:7
   }
 
   const path: NavigationStep[] = [];
-  if (bulkCountA > 0) path.push({ type: 'goPreviousBulk', count: bulkCountA });
+  if (true) path.push({ type: 'goPreviousBulk', count: bulkCountA });
   if (remA > 0) path.push({ type: 'goPrevious', count: remA });
   return path;
killedBy: planNavigationPath backward (target < current) uses goPrevious only when bulk would overshoot and no goNext (12→3, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ { type: 'goPrevious', count: 9 } ]

[Killed] EqualityOperator
src/utils/paginationPath.ts:105:7
 
   const path: NavigationStep[] = [];
   if (bulkCountA > 0) path.push({ type: 'goPreviousBulk', count: bulkCountA });
-  if (remA > 0) path.push({ type: 'goPrevious', count: remA });
+  if (remA >= 0) path.push({ type: 'goPrevious', count: remA });
   return path;
 }
killedBy: planNavigationPath backward (target < current) uses goPreviousBulk once when exact (13→3, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ Array(1) ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:105:7
 
   const path: NavigationStep[] = [];
   if (bulkCountA > 0) path.push({ type: 'goPreviousBulk', count: bulkCountA });
-  if (remA > 0) path.push({ type: 'goPrevious', count: remA });
+  if (true) path.push({ type: 'goPrevious', count: remA });
   return path;
 }
killedBy: planNavigationPath backward (target < current) uses goPreviousBulk once when exact (13→3, bulk 10)
statusReason: expected [ …(2) ] to deeply equal [ Array(1) ]

[Killed] ConditionalExpression
src/utils/paginationPath.ts:124:7
   getCurrentPage: () => number,
   setCurrentPage: (n: number) => void
 ): Promise<void> {
-  if (!primitives.goToPage) return;
+  if (true) return;
 
   for (let i = 0; i < MAX_GO_TO_PAGE_RETRIES; i++) {
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: expected 3 to be 12 // Object.is equality

[Killed] ConditionalExpression
src/utils/paginationPath.ts:124:7
   getCurrentPage: () => number,
   setCurrentPage: (n: number) => void
 ): Promise<void> {
-  if (!primitives.goToPage) return;
+  if (false) return;
 
   for (let i = 0; i < MAX_GO_TO_PAGE_RETRIES; i++) {
killedBy: executeNavigationWithGoToPageRetry - behaviors & edge cases returns immediately when no goToPage
statusReason: primitives.goToPage is not a function

[Killed] ConditionalExpression
src/utils/paginationPath.ts:126:19
 ): Promise<void> {
   if (!primitives.goToPage) return;
 
-  for (let i = 0; i < MAX_GO_TO_PAGE_RETRIES; i++) {
+  for (let i = 0; false; i++) {
     const current = getCurrentPage();
     if (current === targetPageIndex) return;
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: bringIntoView: failed to reach page 12 after 200 goToPage retries. Available primitives: goToPage, goNext, goNextBulk, nextBulkPages

[Killed] EqualityOperator
src/utils/paginationPath.ts:126:19
 ): Promise<void> {
   if (!primitives.goToPage) return;
 
-  for (let i = 0; i < MAX_GO_TO_PAGE_RETRIES; i++) {
+  for (let i = 0; i >= MAX_GO_TO_PAGE_RETRIES; i++) {
     const current = getCurrentPage();
     if (current === targetPageIndex) return;
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: bringIntoView: failed to reach page 12 after 200 goToPage retries. Available primitives: goToPage, goNext, goNextBulk, nextBulkPages

[Killed] ConditionalExpression
src/utils/paginationPath.ts:128:9
 
   for (let i = 0; i < MAX_GO_TO_PAGE_RETRIES; i++) {
     const current = getCurrentPage();
-    if (current === targetPageIndex) return;
+    if (false) return;
 
     const ok = await primitives.goToPage(targetPageIndex, context);
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: bringIntoView: goToPage(12) returned false and no goPrevious/goPreviousBulk to step back. Available primitives: goToPage, goNext, goNextBulk, nextBulkPages

[Killed] EqualityOperator
src/utils/paginationPath.ts:128:9
 
   for (let i = 0; i < MAX_GO_TO_PAGE_RETRIES; i++) {
     const current = getCurrentPage();
-    if (current === targetPageIndex) return;
+    if (current !== targetPageIndex) return;
 
     const ok = await primitives.goToPage(targetPageIndex, context);
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: expected 3 to be 12 // Object.is equality

[Killed] ConditionalExpression
src/utils/paginationPath.ts:131:9
     if (current === targetPageIndex) return;
 
     const ok = await primitives.goToPage(targetPageIndex, context);
-    if (ok) {
+    if (true) {
       setCurrentPage(targetPageIndex);
       return;
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: expected "vi.fn()" to be called 9 times, but got 0 times

[NoCoverage] BlockStatement
src/utils/paginationPath.ts:131:13
     if (current === targetPageIndex) return;
 
     const ok = await primitives.goToPage(targetPageIndex, context);
-    if (ok) {
-      setCurrentPage(targetPageIndex);
-      return;
-    }
+    if (ok) {}
 
     // Step once toward target. Don't use bulk if it would overshoot and we can't step back (no goPrevious/goNext).

[Killed] EqualityOperator
src/utils/paginationPath.ts:137:9
     }
 
     // Step once toward target. Don't use bulk if it would overshoot and we can't step back (no goPrevious/goNext).
-    if (targetPageIndex > current) {
+    if (targetPageIndex <= current) {
       const nextBulkSize = primitives.nextBulkPages ?? 1;
       const wouldOvershoot = (current + nextBulkSize) > targetPageIndex;
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: bringIntoView: goToPage(12) returned false and no goPrevious/goPreviousBulk to step back. Available primitives: goToPage, goNext, goNextBulk, nextBulkPages

[Killed] ConditionalExpression
src/utils/paginationPath.ts:137:9
     }
 
     // Step once toward target. Don't use bulk if it would overshoot and we can't step back (no goPrevious/goNext).
-    if (targetPageIndex > current) {
+    if (true) {
       const nextBulkSize = primitives.nextBulkPages ?? 1;
       const wouldOvershoot = (current + nextBulkSize) > targetPageIndex;
killedBy: executeNavigationWithGoToPageRetry - behaviors & edge cases throws when goToPage false and no stepping primitives (backward)
statusReason: expected [Function] to throw error matching /no goPrevious\/goPrevio…/goPreviousBulk but got 'bringIntoView: goToPage(3) returned f…'

[Killed] LogicalOperator
src/utils/paginationPath.ts:138:28
 
     // Step once toward target. Don't use bulk if it would overshoot and we can't step back (no goPrevious/goNext).
     if (targetPageIndex > current) {
-      const nextBulkSize = primitives.nextBulkPages ?? 1;
+      const nextBulkSize = primitives.nextBulkPages && 1;
       const wouldOvershoot = (current + nextBulkSize) > targetPageIndex;
       const canStepBack = !!primitives.goPrevious;
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: bringIntoView: goToPage(12) returned false and no goPrevious/goPreviousBulk to step back. Available primitives: goToPage, goNext, goNextBulk, nextBulkPages

[Killed] EqualityOperator
src/utils/paginationPath.ts:139:30
     // Step once toward target. Don't use bulk if it would overshoot and we can't step back (no goPrevious/goNext).
     if (targetPageIndex > current) {
       const nextBulkSize = primitives.nextBulkPages ?? 1;
-      const wouldOvershoot = (current + nextBulkSize) > targetPageIndex;
+      const wouldOvershoot = current + nextBulkSize <= targetPageIndex;
       const canStepBack = !!primitives.goPrevious;
       const useBulk = primitives.goNextBulk && (!wouldOvershoot || canStepBack);
killedBy: executeNavigationWithGoToPageRetry - behaviors & edge cases advances using goNextBulk numeric return
statusReason: bringIntoView: goToPage(20) returned false and no goPrevious/goPreviousBulk to step back. Available primitives: goToPage, goNextBulk, nextBulkPages, goNext

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:139:31
     // Step once toward target. Don't use bulk if it would overshoot and we can't step back (no goPrevious/goNext).
     if (targetPageIndex > current) {
       const nextBulkSize = primitives.nextBulkPages ?? 1;
-      const wouldOvershoot = (current + nextBulkSize) > targetPageIndex;
+      const wouldOvershoot = (current - nextBulkSize) > targetPageIndex;
       const canStepBack = !!primitives.goPrevious;
       const useBulk = primitives.goNextBulk && (!wouldOvershoot || canStepBack);
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: bringIntoView: goToPage(12) returned false and no goPrevious/goPreviousBulk to step back. Available primitives: goToPage, goNext, goNextBulk, nextBulkPages

[Killed] BooleanLiteral
src/utils/paginationPath.ts:140:27
     if (targetPageIndex > current) {
       const nextBulkSize = primitives.nextBulkPages ?? 1;
       const wouldOvershoot = (current + nextBulkSize) > targetPageIndex;
-      const canStepBack = !!primitives.goPrevious;
+      const canStepBack = !primitives.goPrevious;
       const useBulk = primitives.goNextBulk && (!wouldOvershoot || canStepBack);
 
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: bringIntoView: goToPage(12) returned false and no goPrevious/goPreviousBulk to step back. Available primitives: goToPage, goNext, goNextBulk, nextBulkPages

[Killed] LogicalOperator
src/utils/paginationPath.ts:141:49
       const nextBulkSize = primitives.nextBulkPages ?? 1;
       const wouldOvershoot = (current + nextBulkSize) > targetPageIndex;
       const canStepBack = !!primitives.goPrevious;
-      const useBulk = primitives.goNextBulk && (!wouldOvershoot || canStepBack);
+      const useBulk = primitives.goNextBulk && (!wouldOvershoot && canStepBack);
 
       if (useBulk && primitives.goNextBulk) {
killedBy: executeNavigationWithGoToPageRetry uses goNextBulk when it would not overshoot (3→38)
statusReason: expected "vi.fn()" to be called 3 times, but got 0 times

[Killed] BooleanLiteral
src/utils/paginationPath.ts:141:49
       const nextBulkSize = primitives.nextBulkPages ?? 1;
       const wouldOvershoot = (current + nextBulkSize) > targetPageIndex;
       const canStepBack = !!primitives.goPrevious;
-      const useBulk = primitives.goNextBulk && (!wouldOvershoot || canStepBack);
+      const useBulk = primitives.goNextBulk && (wouldOvershoot || canStepBack);
 
       if (useBulk && primitives.goNextBulk) {
killedBy: executeNavigationWithGoToPageRetry - behaviors & edge cases advances using goNextBulk numeric return
statusReason: bringIntoView: goToPage(20) returned false and no goPrevious/goPreviousBulk to step back. Available primitives: goToPage, goNextBulk, nextBulkPages, goNext

[Killed] ConditionalExpression
src/utils/paginationPath.ts:143:11
       const canStepBack = !!primitives.goPrevious;
       const useBulk = primitives.goNextBulk && (!wouldOvershoot || canStepBack);
 
-      if (useBulk && primitives.goNextBulk) {
+      if (true) {
         const result = await primitives.goNextBulk(context);
         if (!result) throw new Error('bringIntoView: goNextBulk failed during goToPage retry');
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: bringIntoView: goToPage(12) returned false and no goPrevious/goPreviousBulk to step back. Available primitives: goToPage, goNext, goNextBulk, nextBulkPages

[Killed] LogicalOperator
src/utils/paginationPath.ts:143:11
       const canStepBack = !!primitives.goPrevious;
       const useBulk = primitives.goNextBulk && (!wouldOvershoot || canStepBack);
 
-      if (useBulk && primitives.goNextBulk) {
+      if (useBulk || primitives.goNextBulk) {
         const result = await primitives.goNextBulk(context);
         if (!result) throw new Error('bringIntoView: goNextBulk failed during goToPage retry');
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: bringIntoView: goToPage(12) returned false and no goPrevious/goPreviousBulk to step back. Available primitives: goToPage, goNext, goNextBulk, nextBulkPages

[Killed] ConditionalExpression
src/utils/paginationPath.ts:145:13
 
       if (useBulk && primitives.goNextBulk) {
         const result = await primitives.goNextBulk(context);
-        if (!result) throw new Error('bringIntoView: goNextBulk failed during goToPage retry');
+        if (true) throw new Error('bringIntoView: goNextBulk failed during goToPage retry');
         const jumped = typeof result === 'number' ? result : nextBulkSize;
         setCurrentPage(getCurrentPage() + jumped);
killedBy: executeNavigationWithGoToPageRetry uses goNextBulk when it would not overshoot (3→38)
statusReason: bringIntoView: goNextBulk failed during goToPage retry

[Killed] BooleanLiteral
src/utils/paginationPath.ts:145:13
 
       if (useBulk && primitives.goNextBulk) {
         const result = await primitives.goNextBulk(context);
-        if (!result) throw new Error('bringIntoView: goNextBulk failed during goToPage retry');
+        if (result) throw new Error('bringIntoView: goNextBulk failed during goToPage retry');
         const jumped = typeof result === 'number' ? result : nextBulkSize;
         setCurrentPage(getCurrentPage() + jumped);
killedBy: executeNavigationWithGoToPageRetry uses goNextBulk when it would not overshoot (3→38)
statusReason: bringIntoView: goNextBulk failed during goToPage retry

[Survived] ConditionalExpression
src/utils/paginationPath.ts:146:24
       if (useBulk && primitives.goNextBulk) {
         const result = await primitives.goNextBulk(context);
         if (!result) throw new Error('bringIntoView: goNextBulk failed during goToPage retry');
-        const jumped = typeof result === 'number' ? result : nextBulkSize;
+        const jumped = false ? result : nextBulkSize;
         setCurrentPage(getCurrentPage() + jumped);
       } else if (primitives.goNext) {

[Survived] EqualityOperator
src/utils/paginationPath.ts:146:24
       if (useBulk && primitives.goNextBulk) {
         const result = await primitives.goNextBulk(context);
         if (!result) throw new Error('bringIntoView: goNextBulk failed during goToPage retry');
-        const jumped = typeof result === 'number' ? result : nextBulkSize;
+        const jumped = typeof result !== 'number' ? result : nextBulkSize;
         setCurrentPage(getCurrentPage() + jumped);
       } else if (primitives.goNext) {

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:147:24
         const result = await primitives.goNextBulk(context);
         if (!result) throw new Error('bringIntoView: goNextBulk failed during goToPage retry');
         const jumped = typeof result === 'number' ? result : nextBulkSize;
-        setCurrentPage(getCurrentPage() + jumped);
+        setCurrentPage(getCurrentPage() - jumped);
       } else if (primitives.goNext) {
         const stepped = await primitives.goNext(context);
killedBy: executeNavigationWithGoToPageRetry uses goNextBulk when it would not overshoot (3→38)
statusReason: bringIntoView: failed to reach page 38 after 200 goToPage retries. Available primitives: goToPage, goNext, goNextBulk, nextBulkPages

[Killed] BlockStatement
src/utils/paginationPath.ts:148:37
         if (!result) throw new Error('bringIntoView: goNextBulk failed during goToPage retry');
         const jumped = typeof result === 'number' ? result : nextBulkSize;
         setCurrentPage(getCurrentPage() + jumped);
-      } else if (primitives.goNext) {
-        const stepped = await primitives.goNext(context);
-        if (!stepped) throw new Error('bringIntoView: goNext failed during goToPage retry');
-        setCurrentPage(getCurrentPage() + 1);
-      } else {
+      } else if (primitives.goNext) {} else {
         const available = Object.keys(primitives).filter(k => (primitives as any)[k]);
         throw new Error(`bringIntoView: goToPage(${targetPageIndex}) returned false and no goNext/goNextBulk to advance. Available primitives: ${available.join(', ')}`);
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: bringIntoView: failed to reach page 12 after 200 goToPage retries. Available primitives: goToPage, goNext, goNextBulk, nextBulkPages

[Killed] ConditionalExpression
src/utils/paginationPath.ts:148:18
         if (!result) throw new Error('bringIntoView: goNextBulk failed during goToPage retry');
         const jumped = typeof result === 'number' ? result : nextBulkSize;
         setCurrentPage(getCurrentPage() + jumped);
-      } else if (primitives.goNext) {
+      } else if (true) {
         const stepped = await primitives.goNext(context);
         if (!stepped) throw new Error('bringIntoView: goNext failed during goToPage retry');
killedBy: executeNavigationWithGoToPageRetry - behaviors & edge cases throws when goToPage false and no stepping primitives (forward)
statusReason: expected [Function] to throw error matching /no goNext\/goNextBulk/goNextBulk but got 'primitives.goNext is not a function'

[Killed] ConditionalExpression
src/utils/paginationPath.ts:150:13
         setCurrentPage(getCurrentPage() + jumped);
       } else if (primitives.goNext) {
         const stepped = await primitives.goNext(context);
-        if (!stepped) throw new Error('bringIntoView: goNext failed during goToPage retry');
+        if (true) throw new Error('bringIntoView: goNext failed during goToPage retry');
         setCurrentPage(getCurrentPage() + 1);
       } else {
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: bringIntoView: goNext failed during goToPage retry

[Killed] BooleanLiteral
src/utils/paginationPath.ts:150:13
         setCurrentPage(getCurrentPage() + jumped);
       } else if (primitives.goNext) {
         const stepped = await primitives.goNext(context);
-        if (!stepped) throw new Error('bringIntoView: goNext failed during goToPage retry');
+        if (stepped) throw new Error('bringIntoView: goNext failed during goToPage retry');
         setCurrentPage(getCurrentPage() + 1);
       } else {
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: bringIntoView: goNext failed during goToPage retry

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:151:24
       } else if (primitives.goNext) {
         const stepped = await primitives.goNext(context);
         if (!stepped) throw new Error('bringIntoView: goNext failed during goToPage retry');
-        setCurrentPage(getCurrentPage() + 1);
+        setCurrentPage(getCurrentPage() - 1);
       } else {
         const available = Object.keys(primitives).filter(k => (primitives as any)[k]);
killedBy: executeNavigationWithGoToPageRetry uses goNext only (not goNextBulk) when bulk would overshoot and goPrevious is missing (3→12)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {},

[Timeout] BlockStatement
src/utils/paginationPath.ts:152:14
         const stepped = await primitives.goNext(context);
         if (!stepped) throw new Error('bringIntoView: goNext failed during goToPage retry');
         setCurrentPage(getCurrentPage() + 1);
-      } else {
-        const available = Object.keys(primitives).filter(k => (primitives as any)[k]);
-        throw new Error(`bringIntoView: goToPage(${targetPageIndex}) returned false and no goNext/goNextBulk to advance. Available primitives: ${available.join(', ')}`);
-      }
+      } else {}
     } else {
       const prevBulkSize = primitives.previousBulkPages ?? 1;

[Survived] MethodExpression
src/utils/paginationPath.ts:153:27
         if (!stepped) throw new Error('bringIntoView: goNext failed during goToPage retry');
         setCurrentPage(getCurrentPage() + 1);
       } else {
-        const available = Object.keys(primitives).filter(k => (primitives as any)[k]);
+        const available = Object.keys(primitives);
         throw new Error(`bringIntoView: goToPage(${targetPageIndex}) returned false and no goNext/goNextBulk to advance. Available primitives: ${available.join(', ')}`);
       }

[Survived] ArrowFunction
src/utils/paginationPath.ts:153:58
         if (!stepped) throw new Error('bringIntoView: goNext failed during goToPage retry');
         setCurrentPage(getCurrentPage() + 1);
       } else {
-        const available = Object.keys(primitives).filter(k => (primitives as any)[k]);
+        const available = Object.keys(primitives).filter(() => undefined);
         throw new Error(`bringIntoView: goToPage(${targetPageIndex}) returned false and no goNext/goNextBulk to advance. Available primitives: ${available.join(', ')}`);
       }

[Killed] BlockStatement
src/utils/paginationPath.ts:156:12
         const available = Object.keys(primitives).filter(k => (primitives as any)[k]);
         throw new Error(`bringIntoView: goToPage(${targetPageIndex}) returned false and no goNext/goNextBulk to advance. Available primitives: ${available.join(', ')}`);
       }
-    } else {
-      const prevBulkSize = primitives.previousBulkPages ?? 1;
-      const wouldOvershoot = (current - prevBulkSize) < targetPageIndex;
-      const canStepBack = !!primitives.goNext;
-      const useBulk = primitives.goPreviousBulk && (!wouldOvershoot || canStepBack);
-
-      if (useBulk && primitives.goPreviousBulk) {
-        const result = await primitives.goPreviousBulk(context);
-        if (!result) throw new Error('bringIntoView: goPreviousBulk failed during goToPage retry');
-        const jumped = typeof result === 'number' ? result : prevBulkSize;
-        setCurrentPage(getCurrentPage() - jumped);
-      } else if (primitives.goPrevious) {
-        const stepped = await primitives.goPrevious(context);
-        if (!stepped) throw new Error('bringIntoView: goPrevious failed during goToPage retry');
-        setCurrentPage(getCurrentPage() - 1);
-      } else {
-        const available = Object.keys(primitives).filter(k => (primitives as any)[k]);
-        throw new Error(`bringIntoView: goToPage(${targetPageIndex}) returned false and no goPrevious/goPreviousBulk to step back. Available primitives: ${available.join(', ')}`);
-      }
-    }
+    } else {}
   }
 
killedBy: executeNavigationWithGoToPageRetry - behaviors & edge cases throws when goToPage false and no stepping primitives (backward)
statusReason: expected [Function] to throw error matching /no goPrevious\/goPrevio…/goPreviousBulk but got 'bringIntoView: failed to reach page 3…'

[Survived] LogicalOperator
src/utils/paginationPath.ts:157:28
         throw new Error(`bringIntoView: goToPage(${targetPageIndex}) returned false and no goNext/goNextBulk to advance. Available primitives: ${available.join(', ')}`);
       }
     } else {
-      const prevBulkSize = primitives.previousBulkPages ?? 1;
+      const prevBulkSize = primitives.previousBulkPages && 1;
       const wouldOvershoot = (current - prevBulkSize) < targetPageIndex;
       const canStepBack = !!primitives.goNext;

[Killed] EqualityOperator
src/utils/paginationPath.ts:158:30
       }
     } else {
       const prevBulkSize = primitives.previousBulkPages ?? 1;
-      const wouldOvershoot = (current - prevBulkSize) < targetPageIndex;
+      const wouldOvershoot = current - prevBulkSize >= targetPageIndex;
       const canStepBack = !!primitives.goNext;
       const useBulk = primitives.goPreviousBulk && (!wouldOvershoot || canStepBack);
killedBy: executeNavigationWithGoToPageRetry - behaviors & edge cases uses goPreviousBulk numeric return to step back
statusReason: bringIntoView: goToPage(1) returned false and no goNext/goNextBulk to advance. Available primitives: goToPage, goPreviousBulk, previousBulkPages, goPrevious

[Survived] ArithmeticOperator
src/utils/paginationPath.ts:158:31
       }
     } else {
       const prevBulkSize = primitives.previousBulkPages ?? 1;
-      const wouldOvershoot = (current - prevBulkSize) < targetPageIndex;
+      const wouldOvershoot = (current + prevBulkSize) < targetPageIndex;
       const canStepBack = !!primitives.goNext;
       const useBulk = primitives.goPreviousBulk && (!wouldOvershoot || canStepBack);

[Survived] BooleanLiteral
src/utils/paginationPath.ts:159:27
     } else {
       const prevBulkSize = primitives.previousBulkPages ?? 1;
       const wouldOvershoot = (current - prevBulkSize) < targetPageIndex;
-      const canStepBack = !!primitives.goNext;
+      const canStepBack = !primitives.goNext;
       const useBulk = primitives.goPreviousBulk && (!wouldOvershoot || canStepBack);
 

[Killed] BooleanLiteral
src/utils/paginationPath.ts:160:53
       const prevBulkSize = primitives.previousBulkPages ?? 1;
       const wouldOvershoot = (current - prevBulkSize) < targetPageIndex;
       const canStepBack = !!primitives.goNext;
-      const useBulk = primitives.goPreviousBulk && (!wouldOvershoot || canStepBack);
+      const useBulk = primitives.goPreviousBulk && (wouldOvershoot || canStepBack);
 
       if (useBulk && primitives.goPreviousBulk) {
killedBy: executeNavigationWithGoToPageRetry - behaviors & edge cases uses goPreviousBulk numeric return to step back
statusReason: bringIntoView: goToPage(1) returned false and no goNext/goNextBulk to advance. Available primitives: goToPage, goPreviousBulk, previousBulkPages, goPrevious

[Survived] ConditionalExpression
src/utils/paginationPath.ts:160:53
       const prevBulkSize = primitives.previousBulkPages ?? 1;
       const wouldOvershoot = (current - prevBulkSize) < targetPageIndex;
       const canStepBack = !!primitives.goNext;
-      const useBulk = primitives.goPreviousBulk && (!wouldOvershoot || canStepBack);
+      const useBulk = primitives.goPreviousBulk && (true);
 
       if (useBulk && primitives.goPreviousBulk) {
