[Killed] ConditionalExpression
src/utils/paginationPath.ts:162:11
       const canStepBack = !!primitives.goNext;
       const useBulk = primitives.goPreviousBulk && (!wouldOvershoot || canStepBack);
 
-      if (useBulk && primitives.goPreviousBulk) {
+      if (true) {
         const result = await primitives.goPreviousBulk(context);
         if (!result) throw new Error('bringIntoView: goPreviousBulk failed during goToPage retry');
killedBy: executeNavigationWithGoToPageRetry - behaviors & edge cases throws when goToPage false and no stepping primitives (backward)
statusReason: expected [Function] to throw error matching /no goPrevious\/goPrevio…/goPreviousBulk but got 'primitives.goPreviousBulk is not a fu…'

[Killed] BlockStatement
src/utils/paginationPath.ts:162:49
       const canStepBack = !!primitives.goNext;
       const useBulk = primitives.goPreviousBulk && (!wouldOvershoot || canStepBack);
 
-      if (useBulk && primitives.goPreviousBulk) {
-        const result = await primitives.goPreviousBulk(context);
-        if (!result) throw new Error('bringIntoView: goPreviousBulk failed during goToPage retry');
-        const jumped = typeof result === 'number' ? result : prevBulkSize;
-        setCurrentPage(getCurrentPage() - jumped);
-      } else if (primitives.goPrevious) {
+      if (useBulk && primitives.goPreviousBulk) {} else if (primitives.goPrevious) {
         const stepped = await primitives.goPrevious(context);
         if (!stepped) throw new Error('bringIntoView: goPrevious failed during goToPage retry');
killedBy: executeNavigationWithGoToPageRetry - behaviors & edge cases uses goPreviousBulk numeric return to step back
statusReason: bringIntoView: failed to reach page 1 after 200 goToPage retries. Available primitives: goToPage, goPreviousBulk, previousBulkPages, goPrevious

[Killed] ConditionalExpression
src/utils/paginationPath.ts:164:13
 
       if (useBulk && primitives.goPreviousBulk) {
         const result = await primitives.goPreviousBulk(context);
-        if (!result) throw new Error('bringIntoView: goPreviousBulk failed during goToPage retry');
+        if (true) throw new Error('bringIntoView: goPreviousBulk failed during goToPage retry');
         const jumped = typeof result === 'number' ? result : prevBulkSize;
         setCurrentPage(getCurrentPage() - jumped);
killedBy: executeNavigationWithGoToPageRetry - behaviors & edge cases uses goPreviousBulk numeric return to step back
statusReason: bringIntoView: goPreviousBulk failed during goToPage retry

[Killed] BooleanLiteral
src/utils/paginationPath.ts:164:13
 
       if (useBulk && primitives.goPreviousBulk) {
         const result = await primitives.goPreviousBulk(context);
-        if (!result) throw new Error('bringIntoView: goPreviousBulk failed during goToPage retry');
+        if (result) throw new Error('bringIntoView: goPreviousBulk failed during goToPage retry');
         const jumped = typeof result === 'number' ? result : prevBulkSize;
         setCurrentPage(getCurrentPage() - jumped);
killedBy: executeNavigationWithGoToPageRetry - behaviors & edge cases uses goPreviousBulk numeric return to step back
statusReason: bringIntoView: goPreviousBulk failed during goToPage retry

[Survived] ConditionalExpression
src/utils/paginationPath.ts:165:24
       if (useBulk && primitives.goPreviousBulk) {
         const result = await primitives.goPreviousBulk(context);
         if (!result) throw new Error('bringIntoView: goPreviousBulk failed during goToPage retry');
-        const jumped = typeof result === 'number' ? result : prevBulkSize;
+        const jumped = false ? result : prevBulkSize;
         setCurrentPage(getCurrentPage() - jumped);
       } else if (primitives.goPrevious) {

[Survived] EqualityOperator
src/utils/paginationPath.ts:165:24
       if (useBulk && primitives.goPreviousBulk) {
         const result = await primitives.goPreviousBulk(context);
         if (!result) throw new Error('bringIntoView: goPreviousBulk failed during goToPage retry');
-        const jumped = typeof result === 'number' ? result : prevBulkSize;
+        const jumped = typeof result !== 'number' ? result : prevBulkSize;
         setCurrentPage(getCurrentPage() - jumped);
       } else if (primitives.goPrevious) {

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:166:24
         const result = await primitives.goPreviousBulk(context);
         if (!result) throw new Error('bringIntoView: goPreviousBulk failed during goToPage retry');
         const jumped = typeof result === 'number' ? result : prevBulkSize;
-        setCurrentPage(getCurrentPage() - jumped);
+        setCurrentPage(getCurrentPage() + jumped);
       } else if (primitives.goPrevious) {
         const stepped = await primitives.goPrevious(context);
killedBy: executeNavigationWithGoToPageRetry - behaviors & edge cases uses goPreviousBulk numeric return to step back
statusReason: bringIntoView: failed to reach page 1 after 200 goToPage retries. Available primitives: goToPage, goPreviousBulk, previousBulkPages, goPrevious

[Killed] ConditionalExpression
src/utils/paginationPath.ts:167:18
         if (!result) throw new Error('bringIntoView: goPreviousBulk failed during goToPage retry');
         const jumped = typeof result === 'number' ? result : prevBulkSize;
         setCurrentPage(getCurrentPage() - jumped);
-      } else if (primitives.goPrevious) {
+      } else if (true) {
         const stepped = await primitives.goPrevious(context);
         if (!stepped) throw new Error('bringIntoView: goPrevious failed during goToPage retry');
killedBy: executeNavigationWithGoToPageRetry - behaviors & edge cases throws when goToPage false and no stepping primitives (backward)
statusReason: expected [Function] to throw error matching /no goPrevious\/goPrevio…/goPreviousBulk but got 'primitives.goPrevious is not a functi…'

[Survived] ConditionalExpression
src/utils/paginationPath.ts:167:18
         if (!result) throw new Error('bringIntoView: goPreviousBulk failed during goToPage retry');
         const jumped = typeof result === 'number' ? result : prevBulkSize;
         setCurrentPage(getCurrentPage() - jumped);
-      } else if (primitives.goPrevious) {
+      } else if (false) {
         const stepped = await primitives.goPrevious(context);
         if (!stepped) throw new Error('bringIntoView: goPrevious failed during goToPage retry');

[NoCoverage] ConditionalExpression
src/utils/paginationPath.ts:169:13
         setCurrentPage(getCurrentPage() - jumped);
       } else if (primitives.goPrevious) {
         const stepped = await primitives.goPrevious(context);
-        if (!stepped) throw new Error('bringIntoView: goPrevious failed during goToPage retry');
+        if (false) throw new Error('bringIntoView: goPrevious failed during goToPage retry');
         setCurrentPage(getCurrentPage() - 1);
       } else {

[NoCoverage] ConditionalExpression
src/utils/paginationPath.ts:169:13
         setCurrentPage(getCurrentPage() - jumped);
       } else if (primitives.goPrevious) {
         const stepped = await primitives.goPrevious(context);
-        if (!stepped) throw new Error('bringIntoView: goPrevious failed during goToPage retry');
+        if (true) throw new Error('bringIntoView: goPrevious failed during goToPage retry');
         setCurrentPage(getCurrentPage() - 1);
       } else {

[NoCoverage] ArithmeticOperator
src/utils/paginationPath.ts:170:24
       } else if (primitives.goPrevious) {
         const stepped = await primitives.goPrevious(context);
         if (!stepped) throw new Error('bringIntoView: goPrevious failed during goToPage retry');
-        setCurrentPage(getCurrentPage() - 1);
+        setCurrentPage(getCurrentPage() + 1);
       } else {
         const available = Object.keys(primitives).filter(k => (primitives as any)[k]);

[Timeout] BlockStatement
src/utils/paginationPath.ts:171:14
         const stepped = await primitives.goPrevious(context);
         if (!stepped) throw new Error('bringIntoView: goPrevious failed during goToPage retry');
         setCurrentPage(getCurrentPage() - 1);
-      } else {
-        const available = Object.keys(primitives).filter(k => (primitives as any)[k]);
-        throw new Error(`bringIntoView: goToPage(${targetPageIndex}) returned false and no goPrevious/goPreviousBulk to step back. Available primitives: ${available.join(', ')}`);
-      }
+      } else {}
     }
   }

[Killed] StringLiteral
src/utils/paginationPath.ts:173:25
         setCurrentPage(getCurrentPage() - 1);
       } else {
         const available = Object.keys(primitives).filter(k => (primitives as any)[k]);
-        throw new Error(`bringIntoView: goToPage(${targetPageIndex}) returned false and no goPrevious/goPreviousBulk to step back. Available primitives: ${available.join(', ')}`);
+        throw new Error(``);
       }
     }
killedBy: executeNavigationWithGoToPageRetry - behaviors & edge cases throws when goToPage false and no stepping primitives (backward)
statusReason: expected [Function] to throw error matching /no goPrevious\/goPrevio…/goPreviousBulk but got ''

[NoCoverage] ArrowFunction
src/utils/paginationPath.ts:178:52
     }
   }
 
-  const available = Object.keys(primitives).filter(k => (primitives as any)[k]);
+  const available = Object.keys(primitives).filter(() => undefined);
   throw new Error(`bringIntoView: failed to reach page ${targetPageIndex} after ${MAX_GO_TO_PAGE_RETRIES} goToPage retries. Available primitives: ${available.join(', ')}`);
 }

[NoCoverage] MethodExpression
src/utils/paginationPath.ts:178:21
     }
   }
 
-  const available = Object.keys(primitives).filter(k => (primitives as any)[k]);
+  const available = Object.keys(primitives);
   throw new Error(`bringIntoView: failed to reach page ${targetPageIndex} after ${MAX_GO_TO_PAGE_RETRIES} goToPage retries. Available primitives: ${available.join(', ')}`);
 }

[NoCoverage] StringLiteral
src/utils/paginationPath.ts:179:164
   }
 
   const available = Object.keys(primitives).filter(k => (primitives as any)[k]);
-  throw new Error(`bringIntoView: failed to reach page ${targetPageIndex} after ${MAX_GO_TO_PAGE_RETRIES} goToPage retries. Available primitives: ${available.join(', ')}`);
+  throw new Error(`bringIntoView: failed to reach page ${targetPageIndex} after ${MAX_GO_TO_PAGE_RETRIES} goToPage retries. Available primitives: ${available.join("")}`);
 }
 

[Killed] ConditionalExpression
src/utils/paginationPath.ts:195:7
 ): Promise<void> {
   for (const step of path) {
     switch (step.type) {
-      case 'goToPage':
-        if (primitives.goToPage) {
-          const ok = await primitives.goToPage(step.pageIndex, context);
-          if (!ok) throw new Error(`goToPage(${step.pageIndex}) failed`);
-          setCurrentPage(step.pageIndex);
-        }
-        break;
+      case 'goToPage':
       case 'goNextBulk':
         for (let i = 0; i < step.count && primitives.goNextBulk; i++) {
killedBy: executeNavigationPath - failure modes & updates throws when goToPage primitive fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/utils/paginationPath.ts:195:12
 ): Promise<void> {
   for (const step of path) {
     switch (step.type) {
-      case 'goToPage':
+      case "":
         if (primitives.goToPage) {
           const ok = await primitives.goToPage(step.pageIndex, context);
killedBy: executeNavigationPath - failure modes & updates throws when goToPage primitive fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/utils/paginationPath.ts:196:13
   for (const step of path) {
     switch (step.type) {
       case 'goToPage':
-        if (primitives.goToPage) {
+        if (false) {
           const ok = await primitives.goToPage(step.pageIndex, context);
           if (!ok) throw new Error(`goToPage(${step.pageIndex}) failed`);
killedBy: executeNavigationPath - failure modes & updates throws when goToPage primitive fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/utils/paginationPath.ts:196:34
   for (const step of path) {
     switch (step.type) {
       case 'goToPage':
-        if (primitives.goToPage) {
-          const ok = await primitives.goToPage(step.pageIndex, context);
-          if (!ok) throw new Error(`goToPage(${step.pageIndex}) failed`);
-          setCurrentPage(step.pageIndex);
-        }
+        if (primitives.goToPage) {}
         break;
       case 'goNextBulk':
killedBy: executeNavigationPath - failure modes & updates throws when goToPage primitive fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/utils/paginationPath.ts:198:15
       case 'goToPage':
         if (primitives.goToPage) {
           const ok = await primitives.goToPage(step.pageIndex, context);
-          if (!ok) throw new Error(`goToPage(${step.pageIndex}) failed`);
+          if (ok) throw new Error(`goToPage(${step.pageIndex}) failed`);
           setCurrentPage(step.pageIndex);
         }
killedBy: executeNavigationPath - failure modes & updates throws when goToPage primitive fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/utils/paginationPath.ts:198:15
       case 'goToPage':
         if (primitives.goToPage) {
           const ok = await primitives.goToPage(step.pageIndex, context);
-          if (!ok) throw new Error(`goToPage(${step.pageIndex}) failed`);
+          if (false) throw new Error(`goToPage(${step.pageIndex}) failed`);
           setCurrentPage(step.pageIndex);
         }
killedBy: executeNavigationPath - failure modes & updates throws when goToPage primitive fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/utils/paginationPath.ts:202:7
           setCurrentPage(step.pageIndex);
         }
         break;
-      case 'goNextBulk':
-        for (let i = 0; i < step.count && primitives.goNextBulk; i++) {
-          const result = await primitives.goNextBulk(context);
-          if (!result) throw new Error('goNextBulk failed');
-          const jumped = typeof result === 'number' ? result : 1;
-          setCurrentPage(getCurrentPage() + jumped);
-        }
-        break;
+      case 'goNextBulk':
       case 'goNext':
         for (let i = 0; i < step.count && primitives.goNext; i++) {
killedBy: executeNavigationPath - failure modes & updates throws when goNextBulk fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/utils/paginationPath.ts:202:12
           setCurrentPage(step.pageIndex);
         }
         break;
-      case 'goNextBulk':
+      case "":
         for (let i = 0; i < step.count && primitives.goNextBulk; i++) {
           const result = await primitives.goNextBulk(context);
killedBy: executeNavigationPath - failure modes & updates throws when goNextBulk fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/utils/paginationPath.ts:203:25
         }
         break;
       case 'goNextBulk':
-        for (let i = 0; i < step.count && primitives.goNextBulk; i++) {
+        for (let i = 0; i >= step.count && primitives.goNextBulk; i++) {
           const result = await primitives.goNextBulk(context);
           if (!result) throw new Error('goNextBulk failed');
killedBy: executeNavigationPath - failure modes & updates throws when goNextBulk fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/utils/paginationPath.ts:203:25
         }
         break;
       case 'goNextBulk':
-        for (let i = 0; i < step.count && primitives.goNextBulk; i++) {
+        for (let i = 0; false; i++) {
           const result = await primitives.goNextBulk(context);
           if (!result) throw new Error('goNextBulk failed');
killedBy: executeNavigationPath - failure modes & updates throws when goNextBulk fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/utils/paginationPath.ts:205:15
       case 'goNextBulk':
         for (let i = 0; i < step.count && primitives.goNextBulk; i++) {
           const result = await primitives.goNextBulk(context);
-          if (!result) throw new Error('goNextBulk failed');
+          if (false) throw new Error('goNextBulk failed');
           const jumped = typeof result === 'number' ? result : 1;
           setCurrentPage(getCurrentPage() + jumped);
killedBy: executeNavigationPath - failure modes & updates throws when goNextBulk fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/utils/paginationPath.ts:205:15
       case 'goNextBulk':
         for (let i = 0; i < step.count && primitives.goNextBulk; i++) {
           const result = await primitives.goNextBulk(context);
-          if (!result) throw new Error('goNextBulk failed');
+          if (result) throw new Error('goNextBulk failed');
           const jumped = typeof result === 'number' ? result : 1;
           setCurrentPage(getCurrentPage() + jumped);
killedBy: executeNavigationPath - failure modes & updates throws when goNextBulk fails
statusReason: promise resolved "undefined" instead of rejecting

[NoCoverage] EqualityOperator
src/utils/paginationPath.ts:206:26
         for (let i = 0; i < step.count && primitives.goNextBulk; i++) {
           const result = await primitives.goNextBulk(context);
           if (!result) throw new Error('goNextBulk failed');
-          const jumped = typeof result === 'number' ? result : 1;
+          const jumped = typeof result !== 'number' ? result : 1;
           setCurrentPage(getCurrentPage() + jumped);
         }

[NoCoverage] ConditionalExpression
src/utils/paginationPath.ts:206:26
         for (let i = 0; i < step.count && primitives.goNextBulk; i++) {
           const result = await primitives.goNextBulk(context);
           if (!result) throw new Error('goNextBulk failed');
-          const jumped = typeof result === 'number' ? result : 1;
+          const jumped = false ? result : 1;
           setCurrentPage(getCurrentPage() + jumped);
         }

[NoCoverage] ArithmeticOperator
src/utils/paginationPath.ts:207:26
           const result = await primitives.goNextBulk(context);
           if (!result) throw new Error('goNextBulk failed');
           const jumped = typeof result === 'number' ? result : 1;
-          setCurrentPage(getCurrentPage() + jumped);
+          setCurrentPage(getCurrentPage() - jumped);
         }
         break;

[Killed] ConditionalExpression
src/utils/paginationPath.ts:210:7
           setCurrentPage(getCurrentPage() + jumped);
         }
         break;
-      case 'goNext':
-        for (let i = 0; i < step.count && primitives.goNext; i++) {
-          const ok = await primitives.goNext(context);
-          if (!ok) throw new Error('goNext failed');
-          setCurrentPage(getCurrentPage() + 1);
-        }
-        break;
+      case 'goNext':
       case 'goPreviousBulk':
         for (let i = 0; i < step.count && primitives.goPreviousBulk; i++) {
killedBy: executeNavigationPath - failure modes & updates runs goNext/goPrevious and updates current page
statusReason: expected -1 to be 3 // Object.is equality

[Killed] StringLiteral
src/utils/paginationPath.ts:210:12
           setCurrentPage(getCurrentPage() + jumped);
         }
         break;
-      case 'goNext':
+      case "":
         for (let i = 0; i < step.count && primitives.goNext; i++) {
           const ok = await primitives.goNext(context);
killedBy: executeNavigationPath - failure modes & updates runs goNext/goPrevious and updates current page
statusReason: expected 1 to be 3 // Object.is equality

[Killed] EqualityOperator
src/utils/paginationPath.ts:211:25
         }
         break;
       case 'goNext':
-        for (let i = 0; i < step.count && primitives.goNext; i++) {
+        for (let i = 0; i <= step.count && primitives.goNext; i++) {
           const ok = await primitives.goNext(context);
           if (!ok) throw new Error('goNext failed');
killedBy: executeNavigationPath - failure modes & updates runs goNext/goPrevious and updates current page
statusReason: expected 4 to be 3 // Object.is equality

[Killed] BlockStatement
src/utils/paginationPath.ts:211:67
         }
         break;
       case 'goNext':
-        for (let i = 0; i < step.count && primitives.goNext; i++) {
-          const ok = await primitives.goNext(context);
-          if (!ok) throw new Error('goNext failed');
-          setCurrentPage(getCurrentPage() + 1);
-        }
+        for (let i = 0; i < step.count && primitives.goNext; i++) {}
         break;
       case 'goPreviousBulk':
killedBy: executeNavigationPath - failure modes & updates runs goNext/goPrevious and updates current page
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/utils/paginationPath.ts:213:15
       case 'goNext':
         for (let i = 0; i < step.count && primitives.goNext; i++) {
           const ok = await primitives.goNext(context);
-          if (!ok) throw new Error('goNext failed');
+          if (true) throw new Error('goNext failed');
           setCurrentPage(getCurrentPage() + 1);
         }
killedBy: executeNavigationPath - failure modes & updates runs goNext/goPrevious and updates current page
statusReason: goNext failed

[Killed] BooleanLiteral
src/utils/paginationPath.ts:213:15
       case 'goNext':
         for (let i = 0; i < step.count && primitives.goNext; i++) {
           const ok = await primitives.goNext(context);
-          if (!ok) throw new Error('goNext failed');
+          if (ok) throw new Error('goNext failed');
           setCurrentPage(getCurrentPage() + 1);
         }
killedBy: executeNavigationPath - failure modes & updates runs goNext/goPrevious and updates current page
statusReason: goNext failed

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:214:26
         for (let i = 0; i < step.count && primitives.goNext; i++) {
           const ok = await primitives.goNext(context);
           if (!ok) throw new Error('goNext failed');
-          setCurrentPage(getCurrentPage() + 1);
+          setCurrentPage(getCurrentPage() - 1);
         }
         break;
killedBy: executeNavigationPath - failure modes & updates runs goNext/goPrevious and updates current page
statusReason: expected -1 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/utils/paginationPath.ts:217:7
           setCurrentPage(getCurrentPage() + 1);
         }
         break;
-      case 'goPreviousBulk':
-        for (let i = 0; i < step.count && primitives.goPreviousBulk; i++) {
-          const result = await primitives.goPreviousBulk(context);
-          if (!result) throw new Error('goPreviousBulk failed');
-          const jumped = typeof result === 'number' ? result : 1;
-          setCurrentPage(getCurrentPage() - jumped);
-        }
-        break;
+      case 'goPreviousBulk':
       case 'goPrevious':
         for (let i = 0; i < step.count && primitives.goPrevious; i++) {
killedBy: executeNavigationPath - failure modes & updates throws when goPreviousBulk fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/utils/paginationPath.ts:217:12
           setCurrentPage(getCurrentPage() + 1);
         }
         break;
-      case 'goPreviousBulk':
+      case "":
         for (let i = 0; i < step.count && primitives.goPreviousBulk; i++) {
           const result = await primitives.goPreviousBulk(context);
killedBy: executeNavigationPath - failure modes & updates throws when goPreviousBulk fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/utils/paginationPath.ts:218:25
         }
         break;
       case 'goPreviousBulk':
-        for (let i = 0; i < step.count && primitives.goPreviousBulk; i++) {
+        for (let i = 0; false; i++) {
           const result = await primitives.goPreviousBulk(context);
           if (!result) throw new Error('goPreviousBulk failed');
killedBy: executeNavigationPath - failure modes & updates throws when goPreviousBulk fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/utils/paginationPath.ts:218:75
         }
         break;
       case 'goPreviousBulk':
-        for (let i = 0; i < step.count && primitives.goPreviousBulk; i++) {
-          const result = await primitives.goPreviousBulk(context);
-          if (!result) throw new Error('goPreviousBulk failed');
-          const jumped = typeof result === 'number' ? result : 1;
-          setCurrentPage(getCurrentPage() - jumped);
-        }
+        for (let i = 0; i < step.count && primitives.goPreviousBulk; i++) {}
         break;
       case 'goPrevious':
killedBy: executeNavigationPath - failure modes & updates throws when goPreviousBulk fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/utils/paginationPath.ts:220:15
       case 'goPreviousBulk':
         for (let i = 0; i < step.count && primitives.goPreviousBulk; i++) {
           const result = await primitives.goPreviousBulk(context);
-          if (!result) throw new Error('goPreviousBulk failed');
+          if (false) throw new Error('goPreviousBulk failed');
           const jumped = typeof result === 'number' ? result : 1;
           setCurrentPage(getCurrentPage() - jumped);
killedBy: executeNavigationPath - failure modes & updates throws when goPreviousBulk fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/utils/paginationPath.ts:220:15
       case 'goPreviousBulk':
         for (let i = 0; i < step.count && primitives.goPreviousBulk; i++) {
           const result = await primitives.goPreviousBulk(context);
-          if (!result) throw new Error('goPreviousBulk failed');
+          if (result) throw new Error('goPreviousBulk failed');
           const jumped = typeof result === 'number' ? result : 1;
           setCurrentPage(getCurrentPage() - jumped);
killedBy: executeNavigationPath - failure modes & updates throws when goPreviousBulk fails
statusReason: promise resolved "undefined" instead of rejecting

[NoCoverage] EqualityOperator
src/utils/paginationPath.ts:221:26
         for (let i = 0; i < step.count && primitives.goPreviousBulk; i++) {
           const result = await primitives.goPreviousBulk(context);
           if (!result) throw new Error('goPreviousBulk failed');
-          const jumped = typeof result === 'number' ? result : 1;
+          const jumped = typeof result !== 'number' ? result : 1;
           setCurrentPage(getCurrentPage() - jumped);
         }

[NoCoverage] ConditionalExpression
src/utils/paginationPath.ts:221:26
         for (let i = 0; i < step.count && primitives.goPreviousBulk; i++) {
           const result = await primitives.goPreviousBulk(context);
           if (!result) throw new Error('goPreviousBulk failed');
-          const jumped = typeof result === 'number' ? result : 1;
+          const jumped = false ? result : 1;
           setCurrentPage(getCurrentPage() - jumped);
         }

[NoCoverage] ArithmeticOperator
src/utils/paginationPath.ts:222:26
           const result = await primitives.goPreviousBulk(context);
           if (!result) throw new Error('goPreviousBulk failed');
           const jumped = typeof result === 'number' ? result : 1;
-          setCurrentPage(getCurrentPage() - jumped);
+          setCurrentPage(getCurrentPage() + jumped);
         }
         break;

[Killed] ConditionalExpression
src/utils/paginationPath.ts:225:7
           setCurrentPage(getCurrentPage() - jumped);
         }
         break;
-      case 'goPrevious':
-        for (let i = 0; i < step.count && primitives.goPrevious; i++) {
-          const ok = await primitives.goPrevious(context);
-          if (!ok) throw new Error('goPrevious failed');
-          setCurrentPage(getCurrentPage() - 1);
-        }
-        break;
+      case 'goPrevious':
     }
   }
killedBy: executeNavigationPath - failure modes & updates runs goNext/goPrevious and updates current page
statusReason: expected 4 to be 3 // Object.is equality

[Killed] EqualityOperator
src/utils/paginationPath.ts:226:25
         }
         break;
       case 'goPrevious':
-        for (let i = 0; i < step.count && primitives.goPrevious; i++) {
+        for (let i = 0; i >= step.count && primitives.goPrevious; i++) {
           const ok = await primitives.goPrevious(context);
           if (!ok) throw new Error('goPrevious failed');
killedBy: executeNavigationPath - failure modes & updates runs goNext/goPrevious and updates current page
statusReason: expected 4 to be 3 // Object.is equality

[Killed] EqualityOperator
src/utils/paginationPath.ts:226:25
         }
         break;
       case 'goPrevious':
-        for (let i = 0; i < step.count && primitives.goPrevious; i++) {
+        for (let i = 0; i <= step.count && primitives.goPrevious; i++) {
           const ok = await primitives.goPrevious(context);
           if (!ok) throw new Error('goPrevious failed');
killedBy: executeNavigationPath - failure modes & updates runs goNext/goPrevious and updates current page
statusReason: expected 2 to be 3 // Object.is equality

[Killed] BooleanLiteral
src/utils/paginationPath.ts:228:15
       case 'goPrevious':
         for (let i = 0; i < step.count && primitives.goPrevious; i++) {
           const ok = await primitives.goPrevious(context);
-          if (!ok) throw new Error('goPrevious failed');
+          if (ok) throw new Error('goPrevious failed');
           setCurrentPage(getCurrentPage() - 1);
         }
killedBy: executeNavigationPath - failure modes & updates runs goNext/goPrevious and updates current page
statusReason: goPrevious failed
