[Killed] ConditionalExpression
src/utils/paginationPath.ts:228:15
       case 'goPrevious':
         for (let i = 0; i < step.count && primitives.goPrevious; i++) {
           const ok = await primitives.goPrevious(context);
-          if (!ok) throw new Error('goPrevious failed');
+          if (true) throw new Error('goPrevious failed');
           setCurrentPage(getCurrentPage() - 1);
         }
killedBy: executeNavigationPath - failure modes & updates runs goNext/goPrevious and updates current page
statusReason: goPrevious failed

[Killed] ArithmeticOperator
src/utils/paginationPath.ts:229:26
         for (let i = 0; i < step.count && primitives.goPrevious; i++) {
           const ok = await primitives.goPrevious(context);
           if (!ok) throw new Error('goPrevious failed');
-          setCurrentPage(getCurrentPage() - 1);
+          setCurrentPage(getCurrentPage() + 1);
         }
         break;
killedBy: executeNavigationPath - failure modes & updates runs goNext/goPrevious and updates current page
statusReason: expected 5 to be 3 // Object.is equality
