[NoCoverage] BlockStatement
src/utils/smartRowArray.ts:16:79
 /**
  * Wraps a SmartRow array with a convenient toJSON() method
  */
-export function createSmartRowArray<T>(rows: SmartRow<T>[]): SmartRowArray<T> {
-    const arr = rows as SmartRowArray<T>;
-
-    arr.toJSON = async (): Promise<T[]> => {
-        return Promise.all(rows.map(r => r.toJSON()));
-    };
-
-    return arr;
-}
+export function createSmartRowArray<T>(rows: SmartRow<T>[]): SmartRowArray<T> {}
 

[NoCoverage] BlockStatement
src/utils/smartRowArray.ts:19:44
 export function createSmartRowArray<T>(rows: SmartRow<T>[]): SmartRowArray<T> {
     const arr = rows as SmartRowArray<T>;
 
-    arr.toJSON = async (): Promise<T[]> => {
-        return Promise.all(rows.map(r => r.toJSON()));
-    };
+    arr.toJSON = async (): Promise<T[]> => {};
 
     return arr;

[NoCoverage] ArrowFunction
src/utils/smartRowArray.ts:20:37
     const arr = rows as SmartRowArray<T>;
 
     arr.toJSON = async (): Promise<T[]> => {
-        return Promise.all(rows.map(r => r.toJSON()));
+        return Promise.all(rows.map(() => undefined));
     };
 
