[NoCoverage] BlockStatement
src/utils.ts:13:24
   predicate: () => Promise<boolean>, 
   timeout: number, 
   page: Page
-): Promise<boolean> => {
-  const startTime = Date.now();
-  
-  while (Date.now() - startTime < timeout) {
-    if (await predicate()) {
-      return true;
-    }
-    // Wait 100ms before next check (Standard Polling)
-    await page.waitForTimeout(100).catch(() => new Promise(r => setTimeout(r, 100)));
-  }
-  
-  return false;
-};
+): Promise<boolean> => {};
 

[NoCoverage] BlockStatement
src/utils.ts:16:44
 ): Promise<boolean> => {
   const startTime = Date.now();
   
-  while (Date.now() - startTime < timeout) {
-    if (await predicate()) {
-      return true;
-    }
-    // Wait 100ms before next check (Standard Polling)
-    await page.waitForTimeout(100).catch(() => new Promise(r => setTimeout(r, 100)));
-  }
+  while (Date.now() - startTime < timeout) {}
   
   return false;

[NoCoverage] ConditionalExpression
src/utils.ts:16:10
 ): Promise<boolean> => {
   const startTime = Date.now();
   
-  while (Date.now() - startTime < timeout) {
+  while (false) {
     if (await predicate()) {
       return true;

[NoCoverage] BlockStatement
src/utils.ts:17:28
   const startTime = Date.now();
   
   while (Date.now() - startTime < timeout) {
-    if (await predicate()) {
-      return true;
-    }
+    if (await predicate()) {}
     // Wait 100ms before next check (Standard Polling)
     await page.waitForTimeout(100).catch(() => new Promise(r => setTimeout(r, 100)));

[NoCoverage] ConditionalExpression
src/utils.ts:17:9
   const startTime = Date.now();
   
   while (Date.now() - startTime < timeout) {
-    if (await predicate()) {
+    if (false) {
       return true;
     }

[NoCoverage] BooleanLiteral
src/utils.ts:18:14
   
   while (Date.now() - startTime < timeout) {
     if (await predicate()) {
-      return true;
+      return false;
     }
     // Wait 100ms before next check (Standard Polling)

[NoCoverage] ArrowFunction
src/utils.ts:21:42
       return true;
     }
     // Wait 100ms before next check (Standard Polling)
-    await page.waitForTimeout(100).catch(() => new Promise(r => setTimeout(r, 100)));
+    await page.waitForTimeout(100).catch(() => undefined);
   }
   

[NoCoverage] ArrowFunction
src/utils.ts:21:60
       return true;
     }
     // Wait 100ms before next check (Standard Polling)
-    await page.waitForTimeout(100).catch(() => new Promise(r => setTimeout(r, 100)));
+    await page.waitForTimeout(100).catch(() => new Promise(() => undefined));
   }
   
