[Killed] ConditionalExpression
src/filterEngine.ts:33:17
             // Find column index
             const colIndex = map.get(colName);
 
-            if (colIndex === undefined) {
+            if (false) {
                 throw new Error(buildColumnNotFoundError(colName, Array.from(map.keys())));
             }
killedBy: FilterEngine applyFilters should throw error if column not found
statusReason: expected [Function] to throw error matching /Column 'Age' not found/ but got 'Cannot read properties of undefined (…'

[Killed] EqualityOperator
src/filterEngine.ts:33:17
             // Find column index
             const colIndex = map.get(colName);
 
-            if (colIndex === undefined) {
+            if (colIndex !== undefined) {
                 throw new Error(buildColumnNotFoundError(colName, Array.from(map.keys())));
             }
killedBy: FilterEngine applyFilters should throw error if column not found
statusReason: expected [Function] to throw error matching /Column 'Age' not found/ but got 'Cannot read properties of undefined (…'

[Killed] OptionalChaining
src/filterEngine.ts:40:17
             const filterVal = value;
 
             // If a pluggable FilterStrategy is provided, prefer it.
-            if (this.config.strategies?.filter && typeof this.config.strategies.filter.apply === 'function') {
+            if (this.config.strategies.filter && typeof this.config.strategies.filter.apply === 'function') {
                 const tableContext: TableContext = {
                     root: rootLocator as any,
killedBy: FilterEngine applyFilters should chain .filter() for each criteria
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] BlockStatement
src/filterEngine.ts:40:110
             const filterVal = value;
 
             // If a pluggable FilterStrategy is provided, prefer it.
-            if (this.config.strategies?.filter && typeof this.config.strategies.filter.apply === 'function') {
-                const tableContext: TableContext = {
-                    root: rootLocator as any,
-                    config: this.config,
-                    page,
-                    resolve: this.resolve
-                };
-                filtered = this.config.strategies.filter.apply({
-                    rows: filtered,
-                    filter: { column: colName, value: filterVal },
-                    colIndex,
-                    tableContext
-                });
-                continue;
-            }
+            if (this.config.strategies?.filter && typeof this.config.strategies.filter.apply === 'function') {}
 
             // Default Filter Logic
killedBy: FilterEngine pluggable strategy delegates to strategies.filter.apply when present
statusReason: Cannot read properties of undefined (reading 'nth')

[Survived] ObjectLiteral
src/filterEngine.ts:47:64
                     page,
                     resolve: this.resolve
                 };
-                filtered = this.config.strategies.filter.apply({
-                    rows: filtered,
-                    filter: { column: colName, value: filterVal },
-                    colIndex,
-                    tableContext
-                });
+                filtered = this.config.strategies.filter.apply({});
                 continue;
             }

[Killed] EqualityOperator
src/filterEngine.ts:62:17
             // Playwright scoping: `cellTemplate.nth(colIndex)` will be re-based when used in filtered.filter({ has: ... })
             const targetCell = cellTemplate.nth(colIndex);
 
-            if (typeof filterVal === 'function') {
+            if (typeof filterVal !== 'function') {
                 // Locator-based filter: (cell) => cell.locator(...)
                 filtered = filtered.filter({
killedBy: FilterEngine applyFilters should chain .filter() for each criteria
statusReason: filterVal is not a function

[Killed] ConditionalExpression
src/filterEngine.ts:62:17
             // Playwright scoping: `cellTemplate.nth(colIndex)` will be re-based when used in filtered.filter({ has: ... })
             const targetCell = cellTemplate.nth(colIndex);
 
-            if (typeof filterVal === 'function') {
+            if (true) {
                 // Locator-based filter: (cell) => cell.locator(...)
                 filtered = filtered.filter({
killedBy: FilterEngine applyFilters should chain .filter() for each criteria
statusReason: filterVal is not a function

[Killed] MethodExpression
src/filterEngine.ts:64:28
 
             if (typeof filterVal === 'function') {
                 // Locator-based filter: (cell) => cell.locator(...)
-                filtered = filtered.filter({
-                    has: filterVal(targetCell)
-                });
+                filtered = filtered;
             } else {
                 // Text-based filter
killedBy: FilterEngine - function filters should support function-based filter values
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/filterEngine.ts:67:20
                 filtered = filtered.filter({
                     has: filterVal(targetCell)
                 });
-            } else {
-                // Text-based filter
-                const textVal = typeof filterVal === 'number' ? String(filterVal) : filterVal;
-                filtered = filtered.filter({
-                    has: targetCell.getByText(textVal, { exact }),
-                });
-            }
+            } else {}
         }
         return filtered;
killedBy: FilterEngine applyFilters should chain .filter() for each criteria
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Survived] ConditionalExpression
src/filterEngine.ts:69:33
                 });
             } else {
                 // Text-based filter
-                const textVal = typeof filterVal === 'number' ? String(filterVal) : filterVal;
+                const textVal = true ? String(filterVal) : filterVal;
                 filtered = filtered.filter({
                     has: targetCell.getByText(textVal, { exact }),

[Survived] EqualityOperator
src/filterEngine.ts:69:33
                 });
             } else {
                 // Text-based filter
-                const textVal = typeof filterVal === 'number' ? String(filterVal) : filterVal;
+                const textVal = typeof filterVal !== 'number' ? String(filterVal) : filterVal;
                 filtered = filtered.filter({
                     has: targetCell.getByText(textVal, { exact }),

[Killed] MethodExpression
src/filterEngine.ts:70:28
             } else {
                 // Text-based filter
                 const textVal = typeof filterVal === 'number' ? String(filterVal) : filterVal;
-                filtered = filtered.filter({
-                    has: targetCell.getByText(textVal, { exact }),
-                });
+                filtered = filtered;
             }
         }
killedBy: FilterEngine applyFilters should chain .filter() for each criteria
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] ObjectLiteral
src/filterEngine.ts:70:44
             } else {
                 // Text-based filter
                 const textVal = typeof filterVal === 'number' ? String(filterVal) : filterVal;
-                filtered = filtered.filter({
-                    has: targetCell.getByText(textVal, { exact }),
-                });
+                filtered = filtered.filter({});
             }
         }
killedBy: FilterEngine applyFilters should chain .filter() for each criteria
statusReason: expected "vi.fn()" to be called with arguments: [ 'John', { exact: true } ]

Number of calls: 0
