[Killed] BlockStatement
src/strategies/validation.ts:8:117
  * @param result - The result from a pagination strategy
  * @param strategyName - Name of the strategy for error messages
  */
-export function validatePaginationResult(result: any, strategyName: string = 'Custom Pagination Strategy'): boolean {
-    if (typeof result !== 'boolean' && typeof result !== 'number') {
-        throw new Error(
-            `[${strategyName}] Pagination strategy must return a boolean (true if paginated, false if no more pages) or a number (pages jumped). ` +
-            `Received: ${typeof result} (${JSON.stringify(result)})`
-        );
-    }
-
-    if (typeof result === 'number') {
-        return result > 0;
-    }
-
-    return result;
-}
+export function validatePaginationResult(result: any, strategyName: string = 'Custom Pagination Strategy'): boolean {}
 
 /**
killedBy: validatePaginationResult returns true for boolean true
statusReason: expected undefined to be true // Object.is equality

[Survived] StringLiteral
src/strategies/validation.ts:8:78
  * @param result - The result from a pagination strategy
  * @param strategyName - Name of the strategy for error messages
  */
-export function validatePaginationResult(result: any, strategyName: string = 'Custom Pagination Strategy'): boolean {
+export function validatePaginationResult(result: any, strategyName: string = ""): boolean {
     if (typeof result !== 'boolean' && typeof result !== 'number') {
         throw new Error(

[Killed] ConditionalExpression
src/strategies/validation.ts:9:40
  * @param strategyName - Name of the strategy for error messages
  */
 export function validatePaginationResult(result: any, strategyName: string = 'Custom Pagination Strategy'): boolean {
-    if (typeof result !== 'boolean' && typeof result !== 'number') {
+    if (typeof result !== 'boolean' && true) {
         throw new Error(
             `[${strategyName}] Pagination strategy must return a boolean (true if paginated, false if no more pages) or a number (pages jumped). ` +
killedBy: validatePaginationResult returns true for positive number (pages jumped)
statusReason: [Custom Pagination Strategy] Pagination strategy must return a boolean (true if paginated, false if no more pages) or a number (pages jumped). Received: number (1)

[Killed] ConditionalExpression
src/strategies/validation.ts:9:9
  * @param strategyName - Name of the strategy for error messages
  */
 export function validatePaginationResult(result: any, strategyName: string = 'Custom Pagination Strategy'): boolean {
-    if (typeof result !== 'boolean' && typeof result !== 'number') {
+    if (true) {
         throw new Error(
             `[${strategyName}] Pagination strategy must return a boolean (true if paginated, false if no more pages) or a number (pages jumped). ` +
killedBy: validatePaginationResult returns true for boolean true
statusReason: [Custom Pagination Strategy] Pagination strategy must return a boolean (true if paginated, false if no more pages) or a number (pages jumped). Received: boolean (true)

[Killed] StringLiteral
src/strategies/validation.ts:11:13
 export function validatePaginationResult(result: any, strategyName: string = 'Custom Pagination Strategy'): boolean {
     if (typeof result !== 'boolean' && typeof result !== 'number') {
         throw new Error(
-            `[${strategyName}] Pagination strategy must return a boolean (true if paginated, false if no more pages) or a number (pages jumped). ` +
+            `` +
             `Received: ${typeof result} (${JSON.stringify(result)})`
         );
killedBy: validatePaginationResult throws for invalid types
statusReason: expected [Function] to throw error matching /Pagination strategy must return a boo…/ but got 'Received: undefined (undefined)'

[Killed] EqualityOperator
src/strategies/validation.ts:16:9
         );
     }
 
-    if (typeof result === 'number') {
+    if (typeof result !== 'number') {
         return result > 0;
     }
killedBy: validatePaginationResult returns true for positive number (pages jumped)
statusReason: expected 1 to be true // Object.is equality

[Killed] BlockStatement
src/strategies/validation.ts:16:37
         );
     }
 
-    if (typeof result === 'number') {
-        return result > 0;
-    }
+    if (typeof result === 'number') {}
 
     return result;
killedBy: validatePaginationResult returns true for positive number (pages jumped)
statusReason: expected 1 to be true // Object.is equality

[Killed] ConditionalExpression
src/strategies/validation.ts:17:16
     }
 
     if (typeof result === 'number') {
-        return result > 0;
+        return true;
     }
 
killedBy: validatePaginationResult returns false for number 0
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/strategies/validation.ts:17:16
     }
 
     if (typeof result === 'number') {
-        return result > 0;
+        return result >= 0;
     }
 
killedBy: validatePaginationResult returns false for number 0
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/strategies/validation.ts:27:85
  * Validates that a sorting strategy has the required methods.
  * @param strategy - The sorting strategy to validate
  */
-export function validateSortingStrategy(strategy: any): strategy is SortingStrategy {
-    if (!strategy || typeof strategy !== 'object') {
-        throw new Error(
-            `Sorting strategy must be an object with 'doSort' and 'getSortState' methods. Received: ${typeof strategy}`
-        );
-    }
-
-    if (typeof strategy.doSort !== 'function') {
-        throw new Error(
-            `Sorting strategy must have a 'doSort' method. Missing or not a function.`
-        );
-    }
-
-    if (typeof strategy.getSortState !== 'function') {
-        throw new Error(
-            `Sorting strategy must have a 'getSortState' method. Missing or not a function.`
-        );
-    }
-
-    return true;
-}
+export function validateSortingStrategy(strategy: any): strategy is SortingStrategy {}
 
 /**
killedBy: validateSortingStrategy throws for non-object
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/strategies/validation.ts:28:9
  * @param strategy - The sorting strategy to validate
  */
 export function validateSortingStrategy(strategy: any): strategy is SortingStrategy {
-    if (!strategy || typeof strategy !== 'object') {
+    if (true) {
         throw new Error(
             `Sorting strategy must be an object with 'doSort' and 'getSortState' methods. Received: ${typeof strategy}`
killedBy: validateSortingStrategy returns true for valid strategy
statusReason: Sorting strategy must be an object with 'doSort' and 'getSortState' methods. Received: object

[Killed] EqualityOperator
src/strategies/validation.ts:28:22
  * @param strategy - The sorting strategy to validate
  */
 export function validateSortingStrategy(strategy: any): strategy is SortingStrategy {
-    if (!strategy || typeof strategy !== 'object') {
+    if (!strategy || typeof strategy === 'object') {
         throw new Error(
             `Sorting strategy must be an object with 'doSort' and 'getSortState' methods. Received: ${typeof strategy}`
killedBy: validateSortingStrategy returns true for valid strategy
statusReason: Sorting strategy must be an object with 'doSort' and 'getSortState' methods. Received: object

[Survived] StringLiteral
src/strategies/validation.ts:30:13
 export function validateSortingStrategy(strategy: any): strategy is SortingStrategy {
     if (!strategy || typeof strategy !== 'object') {
         throw new Error(
-            `Sorting strategy must be an object with 'doSort' and 'getSortState' methods. Received: ${typeof strategy}`
+            ``
         );
     }

[Killed] EqualityOperator
src/strategies/validation.ts:34:9
         );
     }
 
-    if (typeof strategy.doSort !== 'function') {
+    if (typeof strategy.doSort === 'function') {
         throw new Error(
             `Sorting strategy must have a 'doSort' method. Missing or not a function.`
killedBy: validateSortingStrategy throws when doSort missing
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/strategies/validation.ts:34:9
         );
     }
 
-    if (typeof strategy.doSort !== 'function') {
+    if (true) {
         throw new Error(
             `Sorting strategy must have a 'doSort' method. Missing or not a function.`
killedBy: validateSortingStrategy returns true for valid strategy
statusReason: Sorting strategy must have a 'doSort' method. Missing or not a function.

[Killed] EqualityOperator
src/strategies/validation.ts:40:9
         );
     }
 
-    if (typeof strategy.getSortState !== 'function') {
+    if (typeof strategy.getSortState === 'function') {
         throw new Error(
             `Sorting strategy must have a 'getSortState' method. Missing or not a function.`
killedBy: validateSortingStrategy throws when getSortState missing
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/strategies/validation.ts:40:9
         );
     }
 
-    if (typeof strategy.getSortState !== 'function') {
+    if (true) {
         throw new Error(
             `Sorting strategy must have a 'getSortState' method. Missing or not a function.`
killedBy: validateSortingStrategy returns true for valid strategy
statusReason: Sorting strategy must have a 'getSortState' method. Missing or not a function.

[Killed] BlockStatement
src/strategies/validation.ts:53:79
  * Validates that a fill strategy is properly configured.
  * @param strategy - The fill strategy to validate
  */
-export function validateFillStrategy(strategy: any): strategy is FillStrategy {
-    if (typeof strategy !== 'function') {
-        throw new Error(
-            `Fill strategy must be a function. Received: ${typeof strategy}`
-        );
-    }
-    return true;
-}
+export function validateFillStrategy(strategy: any): strategy is FillStrategy {}
 
killedBy: validateFillStrategy throws when not a function
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/strategies/validation.ts:54:9
  * @param strategy - The fill strategy to validate
  */
 export function validateFillStrategy(strategy: any): strategy is FillStrategy {
-    if (typeof strategy !== 'function') {
+    if (false) {
         throw new Error(
             `Fill strategy must be a function. Received: ${typeof strategy}`
killedBy: validateFillStrategy throws when not a function
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/strategies/validation.ts:54:41
  * @param strategy - The fill strategy to validate
  */
 export function validateFillStrategy(strategy: any): strategy is FillStrategy {
-    if (typeof strategy !== 'function') {
-        throw new Error(
-            `Fill strategy must be a function. Received: ${typeof strategy}`
-        );
-    }
+    if (typeof strategy !== 'function') {}
     return true;
 }
killedBy: validateFillStrategy throws when not a function
statusReason: expected [Function] to throw an error

[Survived] StringLiteral
src/strategies/validation.ts:56:13
 export function validateFillStrategy(strategy: any): strategy is FillStrategy {
     if (typeof strategy !== 'function') {
         throw new Error(
-            `Fill strategy must be a function. Received: ${typeof strategy}`
+            ``
         );
     }
