[Killed] ConditionalExpression
src/utils/stringUtils.ts:8:21
 export function levenshteinDistance(a: string, b: string): number {
     const matrix: number[][] = [];
 
-    for (let i = 0; i <= b.length; i++) {
+    for (let i = 0; false; i++) {
         matrix[i] = [i];
     }
killedBy: FilterEngine applyFilters should throw error if column not found
statusReason: expected [Function] to throw error matching /Column 'Age' not found/ but got 'Cannot set properties of undefined (s…'

[Killed] EqualityOperator
src/utils/stringUtils.ts:8:21
 export function levenshteinDistance(a: string, b: string): number {
     const matrix: number[][] = [];
 
-    for (let i = 0; i <= b.length; i++) {
+    for (let i = 0; i > b.length; i++) {
         matrix[i] = [i];
     }
killedBy: FilterEngine applyFilters should throw error if column not found
statusReason: expected [Function] to throw error matching /Column 'Age' not found/ but got 'Cannot set properties of undefined (s…'

[Killed] ArrayDeclaration
src/utils/stringUtils.ts:9:21
     const matrix: number[][] = [];
 
     for (let i = 0; i <= b.length; i++) {
-        matrix[i] = [i];
+        matrix[i] = [];
     }
 
killedBy: String Utils levenshteinDistance should calculate distance correctly
statusReason: expected NaN to be 3 // Object.is equality

[Killed] ConditionalExpression
src/utils/stringUtils.ts:12:21
         matrix[i] = [i];
     }
 
-    for (let j = 0; j <= a.length; j++) {
+    for (let j = 0; false; j++) {
         matrix[0][j] = j;
     }
killedBy: String Utils levenshteinDistance should calculate distance correctly
statusReason: expected NaN to be 3 // Object.is equality

[Killed] BlockStatement
src/utils/stringUtils.ts:12:41
         matrix[i] = [i];
     }
 
-    for (let j = 0; j <= a.length; j++) {
-        matrix[0][j] = j;
-    }
+    for (let j = 0; j <= a.length; j++) {}
 
     for (let i = 1; i <= b.length; i++) {
killedBy: String Utils levenshteinDistance should calculate distance correctly
statusReason: expected NaN to be 3 // Object.is equality

[Killed] UpdateOperator
src/utils/stringUtils.ts:16:36
         matrix[0][j] = j;
     }
 
-    for (let i = 1; i <= b.length; i++) {
+    for (let i = 1; i <= b.length; i--) {
         for (let j = 1; j <= a.length; j++) {
             const charB = b.charAt(i - 1);
killedBy: String Utils levenshteinDistance should return 0 for identical strings
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/utils/stringUtils.ts:16:21
         matrix[0][j] = j;
     }
 
-    for (let i = 1; i <= b.length; i++) {
+    for (let i = 1; false; i++) {
         for (let j = 1; j <= a.length; j++) {
             const charB = b.charAt(i - 1);
killedBy: String Utils levenshteinDistance should return 0 for identical strings
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/utils/stringUtils.ts:17:45
     }
 
     for (let i = 1; i <= b.length; i++) {
-        for (let j = 1; j <= a.length; j++) {
-            const charB = b.charAt(i - 1);
-            const charA = a.charAt(j - 1);
-
-            if (charB === charA) {
-                // Exact match
-                matrix[i][j] = matrix[i - 1][j - 1];
-            } else {
-                let cost = 1;
-                // If characters match ignoring case, cost is only 0.1 (almost identical)
-                if (charB.toLowerCase() === charA.toLowerCase()) {
-                    cost = 0.1;
-                }
-
-                matrix[i][j] = Math.min(
-                    matrix[i - 1][j - 1] + cost,    // substitution
-                    matrix[i][j - 1] + 1,           // insertion
-                    matrix[i - 1][j] + 1            // deletion
-                );
-            }
-        }
+        for (let j = 1; j <= a.length; j++) {}
     }
 
killedBy: String Utils levenshteinDistance should return 0 for identical strings
statusReason: expected undefined to be +0 // Object.is equality

[Killed] EqualityOperator
src/utils/stringUtils.ts:17:25
     }
 
     for (let i = 1; i <= b.length; i++) {
-        for (let j = 1; j <= a.length; j++) {
+        for (let j = 1; j < a.length; j++) {
             const charB = b.charAt(i - 1);
             const charA = a.charAt(j - 1);
killedBy: String Utils levenshteinDistance should return 0 for identical strings
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/utils/stringUtils.ts:18:36
 
     for (let i = 1; i <= b.length; i++) {
         for (let j = 1; j <= a.length; j++) {
-            const charB = b.charAt(i - 1);
+            const charB = b.charAt(i + 1);
             const charA = a.charAt(j - 1);
 
killedBy: String Utils levenshteinDistance should return 0 for identical strings
statusReason: expected 3 to be +0 // Object.is equality

[Killed] MethodExpression
src/utils/stringUtils.ts:18:27
 
     for (let i = 1; i <= b.length; i++) {
         for (let j = 1; j <= a.length; j++) {
-            const charB = b.charAt(i - 1);
+            const charB = b;
             const charA = a.charAt(j - 1);
 
killedBy: String Utils levenshteinDistance should return 0 for identical strings
statusReason: expected 3 to be +0 // Object.is equality

[Killed] MethodExpression
src/utils/stringUtils.ts:19:27
     for (let i = 1; i <= b.length; i++) {
         for (let j = 1; j <= a.length; j++) {
             const charB = b.charAt(i - 1);
-            const charA = a.charAt(j - 1);
+            const charA = a;
 
             if (charB === charA) {
killedBy: String Utils levenshteinDistance should return 0 for identical strings
statusReason: expected 3 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/utils/stringUtils.ts:19:36
     for (let i = 1; i <= b.length; i++) {
         for (let j = 1; j <= a.length; j++) {
             const charB = b.charAt(i - 1);
-            const charA = a.charAt(j - 1);
+            const charA = a.charAt(j + 1);
 
             if (charB === charA) {
killedBy: String Utils levenshteinDistance should return 0 for identical strings
statusReason: expected 3 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/utils/stringUtils.ts:21:17
             const charB = b.charAt(i - 1);
             const charA = a.charAt(j - 1);
 
-            if (charB === charA) {
+            if (true) {
                 // Exact match
                 matrix[i][j] = matrix[i - 1][j - 1];
killedBy: String Utils levenshteinDistance should calculate distance correctly
statusReason: expected 1 to be 3 // Object.is equality

[Killed] BlockStatement
src/utils/stringUtils.ts:21:34
             const charB = b.charAt(i - 1);
             const charA = a.charAt(j - 1);
 
-            if (charB === charA) {
-                // Exact match
-                matrix[i][j] = matrix[i - 1][j - 1];
-            } else {
+            if (charB === charA) {} else {
                 let cost = 1;
                 // If characters match ignoring case, cost is only 0.1 (almost identical)
killedBy: String Utils levenshteinDistance should return 0 for identical strings
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/utils/stringUtils.ts:23:46
 
             if (charB === charA) {
                 // Exact match
-                matrix[i][j] = matrix[i - 1][j - 1];
+                matrix[i][j] = matrix[i - 1][j + 1];
             } else {
                 let cost = 1;
killedBy: String Utils levenshteinDistance should return 0 for identical strings
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/utils/stringUtils.ts:23:39
 
             if (charB === charA) {
                 // Exact match
-                matrix[i][j] = matrix[i - 1][j - 1];
+                matrix[i][j] = matrix[i + 1][j - 1];
             } else {
                 let cost = 1;
killedBy: String Utils levenshteinDistance should return 0 for identical strings
statusReason: Cannot read properties of undefined (reading '2')

[Killed] BlockStatement
src/utils/stringUtils.ts:24:20
             if (charB === charA) {
                 // Exact match
                 matrix[i][j] = matrix[i - 1][j - 1];
-            } else {
-                let cost = 1;
-                // If characters match ignoring case, cost is only 0.1 (almost identical)
-                if (charB.toLowerCase() === charA.toLowerCase()) {
-                    cost = 0.1;
-                }
-
-                matrix[i][j] = Math.min(
-                    matrix[i - 1][j - 1] + cost,    // substitution
-                    matrix[i][j - 1] + 1,           // insertion
-                    matrix[i - 1][j] + 1            // deletion
-                );
-            }
+            } else {}
         }
     }
killedBy: String Utils levenshteinDistance should calculate distance correctly
statusReason: expected undefined to be 3 // Object.is equality

[Killed] ConditionalExpression
src/utils/stringUtils.ts:27:21
             } else {
                 let cost = 1;
                 // If characters match ignoring case, cost is only 0.1 (almost identical)
-                if (charB.toLowerCase() === charA.toLowerCase()) {
+                if (false) {
                     cost = 0.1;
                 }
killedBy: String Utils levenshteinDistance should return 0.1 for case mismatch
statusReason: expected 1 to be close to 0.1, received difference is 0.9, but expected 0.005

[Killed] EqualityOperator
src/utils/stringUtils.ts:27:21
             } else {
                 let cost = 1;
                 // If characters match ignoring case, cost is only 0.1 (almost identical)
-                if (charB.toLowerCase() === charA.toLowerCase()) {
+                if (charB.toLowerCase() !== charA.toLowerCase()) {
                     cost = 0.1;
                 }
killedBy: String Utils levenshteinDistance should calculate distance correctly
statusReason: expected 1.2 to be 3 // Object.is equality

[Killed] MethodExpression
src/utils/stringUtils.ts:31:32
                     cost = 0.1;
                 }
 
-                matrix[i][j] = Math.min(
-                    matrix[i - 1][j - 1] + cost,    // substitution
-                    matrix[i][j - 1] + 1,           // insertion
-                    matrix[i - 1][j] + 1            // deletion
-                );
+                matrix[i][j] = Math.max(matrix[i - 1][j - 1] + cost,
+// substitution
+matrix[i][j - 1] + 1,
+// insertion
+matrix[i - 1][j] + 1 // deletion
+);
             }
         }
killedBy: String Utils levenshteinDistance should calculate distance correctly
statusReason: expected 13 to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/utils/stringUtils.ts:32:21
                 }
 
                 matrix[i][j] = Math.min(
-                    matrix[i - 1][j - 1] + cost,    // substitution
+                    matrix[i - 1][j - 1] - cost,    // substitution
                     matrix[i][j - 1] + 1,           // insertion
                     matrix[i - 1][j] + 1            // deletion
killedBy: String Utils levenshteinDistance should calculate distance correctly
statusReason: expected -4 to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/utils/stringUtils.ts:32:35
                 }
 
                 matrix[i][j] = Math.min(
-                    matrix[i - 1][j - 1] + cost,    // substitution
+                    matrix[i - 1][j + 1] + cost,    // substitution
                     matrix[i][j - 1] + 1,           // insertion
                     matrix[i - 1][j] + 1            // deletion
killedBy: String Utils levenshteinDistance should calculate distance correctly
statusReason: expected NaN to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/utils/stringUtils.ts:33:31
 
                 matrix[i][j] = Math.min(
                     matrix[i - 1][j - 1] + cost,    // substitution
-                    matrix[i][j - 1] + 1,           // insertion
+                    matrix[i][j + 1] + 1,           // insertion
                     matrix[i - 1][j] + 1            // deletion
                 );
killedBy: String Utils levenshteinDistance should calculate distance correctly
statusReason: expected NaN to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/utils/stringUtils.ts:33:21
 
                 matrix[i][j] = Math.min(
                     matrix[i - 1][j - 1] + cost,    // substitution
-                    matrix[i][j - 1] + 1,           // insertion
+                    // substitution
+matrix[i][j - 1] - 1,           // insertion
                     matrix[i - 1][j] + 1            // deletion
                 );
killedBy: String Utils levenshteinDistance should calculate distance correctly
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/utils/stringUtils.ts:34:21
                 matrix[i][j] = Math.min(
                     matrix[i - 1][j - 1] + cost,    // substitution
                     matrix[i][j - 1] + 1,           // insertion
-                    matrix[i - 1][j] + 1            // deletion
+                    // insertion
+matrix[i - 1][j] - 1 // deletion            // deletion
                 );
             }
killedBy: String Utils levenshteinDistance should calculate distance correctly
statusReason: expected -1 to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/utils/stringUtils.ts:34:28
                 matrix[i][j] = Math.min(
                     matrix[i - 1][j - 1] + cost,    // substitution
                     matrix[i][j - 1] + 1,           // insertion
-                    matrix[i - 1][j] + 1            // deletion
+                    matrix[i + 1][j] + 1            // deletion
                 );
             }
killedBy: String Utils levenshteinDistance should return 0 for identical strings
statusReason: Cannot read properties of undefined (reading '1')

[Killed] BlockStatement
src/utils/stringUtils.ts:47:64
  * Calculate similarity score between two strings (0-1)
  * 1 = identical, 0 = completely different
  */
-export function stringSimilarity(a: string, b: string): number {
-    // We do NOT modify case here anymore, because levenshteinDistance now handles case weighting
-    const distance = levenshteinDistance(a, b);
-    const maxLen = Math.max(a.length, b.length);
-    return maxLen === 0 ? 1 : 1 - (distance / maxLen);
-}
+export function stringSimilarity(a: string, b: string): number {}
 
 /**
killedBy: String Utils stringSimilarity should return very high score for case mismatch (weight 0.1)
statusReason: expected undefined to be close to 0.967, received difference is NaN, but expected 0.0005

[Survived] MethodExpression
src/utils/stringUtils.ts:50:20
 export function stringSimilarity(a: string, b: string): number {
     // We do NOT modify case here anymore, because levenshteinDistance now handles case weighting
     const distance = levenshteinDistance(a, b);
-    const maxLen = Math.max(a.length, b.length);
+    const maxLen = Math.min(a.length, b.length);
     return maxLen === 0 ? 1 : 1 - (distance / maxLen);
 }

[Killed] ArithmeticOperator
src/utils/stringUtils.ts:51:36
     // We do NOT modify case here anymore, because levenshteinDistance now handles case weighting
     const distance = levenshteinDistance(a, b);
     const maxLen = Math.max(a.length, b.length);
-    return maxLen === 0 ? 1 : 1 - (distance / maxLen);
+    return maxLen === 0 ? 1 : 1 - (distance * maxLen);
 }
 
killedBy: String Utils stringSimilarity should return very high score for case mismatch (weight 0.1)
statusReason: expected 0.7 to be close to 0.967, received difference is 0.267, but expected 0.0005

[Killed] ArithmeticOperator
src/utils/stringUtils.ts:51:31
     // We do NOT modify case here anymore, because levenshteinDistance now handles case weighting
     const distance = levenshteinDistance(a, b);
     const maxLen = Math.max(a.length, b.length);
-    return maxLen === 0 ? 1 : 1 - (distance / maxLen);
+    return maxLen === 0 ? 1 : 1 + distance / maxLen;
 }
 
killedBy: String Utils stringSimilarity should return very high score for case mismatch (weight 0.1)
statusReason: expected 1.0333333333333334 to be close to 0.967, received difference is 0.06633333333333347, but expected 0.0005

[Killed] BlockStatement
src/utils/stringUtils.ts:62:44
     input: string,
     available: string[],
     threshold: number = 0.5
-): Array<{ value: string; score: number }> {
-    return available
-        .map(value => ({
-            value,
-            score: stringSimilarity(input, value)
-        }))
-        .filter(x => x.score >= threshold)
-        .sort((a, b) => b.score - a.score)
-        .slice(0, 3); // Top 3 suggestions
-}
+): Array<{ value: string; score: number }> {}
 
 /**
killedBy: String Utils findSimilar should find exact match
statusReason: Cannot read properties of undefined (reading '0')

[Killed] MethodExpression
src/utils/stringUtils.ts:63:12
     available: string[],
     threshold: number = 0.5
 ): Array<{ value: string; score: number }> {
-    return available
-        .map(value => ({
-            value,
-            score: stringSimilarity(input, value)
-        }))
-        .filter(x => x.score >= threshold)
+    return available.map(value => ({
+  value,
+  score: stringSimilarity(input, value)
+}))
         .sort((a, b) => b.score - a.score)
         .slice(0, 3); // Top 3 suggestions
killedBy: String Utils findSimilar should return empty if no similar strings found
statusReason: expected [ …(3) ] to have a length of +0 but got 3

[Survived] MethodExpression
src/utils/stringUtils.ts:63:12
     available: string[],
     threshold: number = 0.5
 ): Array<{ value: string; score: number }> {
-    return available
-        .map(value => ({
-            value,
-            score: stringSimilarity(input, value)
-        }))
-        .filter(x => x.score >= threshold)
-        .sort((a, b) => b.score - a.score)
-        .slice(0, 3); // Top 3 suggestions
+    return available.map(value => ({
+  value,
+  score: stringSimilarity(input, value)
+})).filter(x => x.score >= threshold).sort((a, b) => b.score - a.score); // Top 3 suggestions
 }
 

[Killed] ArrowFunction
src/utils/stringUtils.ts:64:14
     threshold: number = 0.5
 ): Array<{ value: string; score: number }> {
     return available
-        .map(value => ({
-            value,
-            score: stringSimilarity(input, value)
-        }))
+        .map(() => undefined)
         .filter(x => x.score >= threshold)
         .sort((a, b) => b.score - a.score)
killedBy: String Utils findSimilar should find exact match
statusReason: Cannot read properties of undefined (reading 'score')

[Killed] EqualityOperator
src/utils/stringUtils.ts:68:22
             value,
             score: stringSimilarity(input, value)
         }))
-        .filter(x => x.score >= threshold)
+        .filter(x => x.score < threshold)
         .sort((a, b) => b.score - a.score)
         .slice(0, 3); // Top 3 suggestions
killedBy: String Utils findSimilar should find exact match
statusReason: expected 'Phone Number' to be 'First Name' // Object.is equality

[Killed] ConditionalExpression
src/utils/stringUtils.ts:68:22
             value,
             score: stringSimilarity(input, value)
         }))
-        .filter(x => x.score >= threshold)
+        .filter(x => true)
         .sort((a, b) => b.score - a.score)
         .slice(0, 3); // Top 3 suggestions
killedBy: String Utils findSimilar should return empty if no similar strings found
statusReason: expected [ …(3) ] to have a length of +0 but got 3

[Survived] ArrowFunction
src/utils/stringUtils.ts:69:15
             score: stringSimilarity(input, value)
         }))
         .filter(x => x.score >= threshold)
-        .sort((a, b) => b.score - a.score)
+        .sort(() => undefined)
         .slice(0, 3); // Top 3 suggestions
 }

[Survived] ArithmeticOperator
src/utils/stringUtils.ts:69:25
             score: stringSimilarity(input, value)
         }))
         .filter(x => x.score >= threshold)
-        .sort((a, b) => b.score - a.score)
+        .sort((a, b) => b.score + a.score)
         .slice(0, 3); // Top 3 suggestions
 }

[Killed] BlockStatement
src/utils/stringUtils.ts:79:11
 export function buildColumnNotFoundError(
     columnName: string,
     availableColumns: string[]
-): string {
-    const suggestions = findSimilar(columnName, availableColumns);
-
-    let message = `Column '${columnName}' not found`;
-
-    if (suggestions.length > 0) {
-        message += `\n\nDid you mean:`;
-        suggestions.forEach(({ value, score }) => {
-            const percentage = Math.round(score * 100);
-            message += `\n  • ${value} (${percentage}% match)`;
-        });
-    }
-
-    message += `\n\nAvailable columns: ${availableColumns.join(', ')}`;
-    message += `\n\nTip: Column names are case-sensitive`;
-
-    return message;
-}
+): string {}
 
killedBy: String Utils buildColumnNotFoundError should include the missing column name
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
src/utils/stringUtils.ts:84:9
 
     let message = `Column '${columnName}' not found`;
 
-    if (suggestions.length > 0) {
+    if (false) {
         message += `\n\nDid you mean:`;
         suggestions.forEach(({ value, score }) => {
killedBy: String Utils buildColumnNotFoundError should suggest similar columns
statusReason: expected 'Column \'Fist Name\' not found\n\nAva…' to contain 'Did you mean:'

[Killed] BlockStatement
src/utils/stringUtils.ts:84:33
 
     let message = `Column '${columnName}' not found`;
 
-    if (suggestions.length > 0) {
-        message += `\n\nDid you mean:`;
-        suggestions.forEach(({ value, score }) => {
-            const percentage = Math.round(score * 100);
-            message += `\n  • ${value} (${percentage}% match)`;
-        });
-    }
+    if (suggestions.length > 0) {}
 
     message += `\n\nAvailable columns: ${availableColumns.join(', ')}`;
killedBy: String Utils buildColumnNotFoundError should suggest similar columns
statusReason: expected 'Column \'Fist Name\' not found\n\nAva…' to contain 'Did you mean:'

[Survived] BlockStatement
src/utils/stringUtils.ts:86:51
 
     if (suggestions.length > 0) {
         message += `\n\nDid you mean:`;
-        suggestions.forEach(({ value, score }) => {
-            const percentage = Math.round(score * 100);
-            message += `\n  • ${value} (${percentage}% match)`;
-        });
+        suggestions.forEach(({ value, score }) => {});
     }
 

[Survived] ArithmeticOperator
src/utils/stringUtils.ts:87:43
     if (suggestions.length > 0) {
         message += `\n\nDid you mean:`;
         suggestions.forEach(({ value, score }) => {
-            const percentage = Math.round(score * 100);
+            const percentage = Math.round(score / 100);
             message += `\n  • ${value} (${percentage}% match)`;
         });
