[Killed] ArrowFunction
src/strategies/filter.ts:29:8
     }
   } as FilterStrategy,
 
-  spy: (calledRef: { called?: boolean } = {}) => ({
-    apply({ rows, filter, colIndex, tableContext }: {
-      rows: Locator;
-      filter: { column: string; value: FilterValue };
-      colIndex: number;
-      tableContext: TableContext;
-    }) {
-      calledRef.called = true;
-      // Delegate to default behaviour for actual filtering
-      const page = tableContext.page;
-      const resolve = tableContext.resolve;
-      const cellTemplate = resolve(tableContext.config.cellSelector as any, page);
-      const targetCell = cellTemplate.nth(colIndex);
-      if (typeof filter.value === 'function') {
-        return rows.filter({ has: (filter.value as any)(targetCell) });
-      }
-      const textVal = typeof filter.value === 'number' ? String(filter.value) : filter.value;
-      return rows.filter({ has: targetCell.getByText(textVal, { exact: true }) });
-    }
-  }) as FilterStrategy,
+  spy: () => undefined,
 };
 
killedBy: FilterStrategies additional branches spy strategy sets calledRef and delegates
statusReason: Cannot read properties of undefined (reading 'apply')
